[
    {
        "title": "Israel-Gaza War",
        "link": "https://www.bbc.com/news/topics/c2vdnvdg6xxt",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nFears are growing that the cross-border hostilities could escalate into an all-out war.\n\nAshraf El Attar's wife and six children were killed when an air strike destroyed their home in Deir al-Balah.\n\nIsrael's military says it targeted a Hamas command and control centre inside the Gaza City school.\n\nFive of their deaths had already been confirmed by Israel, though it was thought one could still be alive. \n\nUS Secretary State Antony Blinken met with Israeli leader Benjamin Netanyahu to push for an urgent ceasefire.\n\nAshraf El Attar's wife and six children were killed when an air strike destroyed their home in Deir al-Balah.\n\nInbal Peri tells the BBC her father might be alive if Israel's PM had agreed to a Gaza ceasefire.\n\nA senior US official says Benjamin Netanyahu's reported comments are “not constructive to getting a ceasefire deal\".\n\nIsrael's military says it targeted a Hamas command and control centre inside the Gaza City school.\n\nA brief guide to some of the leading figures in the group behind the attacks on Israel.\n\nA deadly attack on the Israeli occupied Golan Heights has heightened fears of full-on fighting.\n\nIsrael's military is heavily reliant on imported aircraft and munitions to conduct its war in Gaza.\n\nTensions between Israel and the Palestinians date back decades, but what are the key issues?\n\nThe US believes a deal could help calm the Middle East, but do Israel and Hamas's leader want one?\n\nMore than 600 Palestinians and at least 17 Israelis have been killed in the West Bank since October.\n\nThe BBC's Rushdi Abualouf witnessed Hamas’s shadowy veterans gather in Qatar to vote for their new chief.\n\nThe Hamas leader was assassinated in Tehran, and it is widely believed Israel was behind the killing.\n\nHow Israel retaliates could determine whether the conflict stays limited or explodes into something much worse.\n\nLocals in the capital Beirut tell the BBC their fears of another war between Israel and Hezbollah.\n\n\nIn the hills of the West Bank, Palestinian shepherds and Israeli activists unite to face down settler violence.\n\nAn Israeli rights group says prisons are overwhelmed, amid allegations of physical and mental violence.\n\nA young woman's sporadic messages to the BBC's Paul Adams give unique insight into life in Gaza.\n\nOne of the patients had been waiting six months to be able to get out of the war-torn territory.\n\nColin Cowan said the SNP displayed \"double standards\" in the fallout of Angus Robertson's meeting with an Israeli diplomat.\n\nThe US president stresses to Israel's PM the importance of removing “any remaining obstacles”.\n\nDelegates from the Uncommitted National Movement said the decision by Democratic Party leaders was \"unacceptable\".\n\nFears are growing that the cross-border hostilities could escalate into an all-out war.\n\nIn response to calls for his suspension from the Labour Party, Clive Lewis MP says it is \"wrong\" to \"silence\" politicians.\n\nAshraf El Attar's wife and six children were killed when an air strike destroyed their home in Deir al-Balah.\n\nInbal Peri tells the BBC her father might be alive if Israel's PM had agreed to a Gaza ceasefire.\n\nA senior US official says Benjamin Netanyahu's reported comments are “not constructive to getting a ceasefire deal\".\n\nIsrael's military says it targeted a Hamas command and control centre inside the Gaza City school.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "War in Ukraine",
        "link": "https://www.bbc.com/news/war-in-ukraine",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nAlmost 2,000 people have been convicted of collaborating with Russia under a new Ukrainian law.\n\nMore than 500 firefighters have been tackling the giant blaze at a fuel depot sparked by a Ukrainian attack.\n\nUkrainian forces continue their incursion into Russia's Kursk region, claiming destruction of a second bridge.\n\nUkraine surprised many with its incursion which came as Russia was making progress in the east.\n\nThousands of Ukrainian refugees could be forced on to the streets or back to Ukraine.\n\nMore than 500 firefighters have been tackling the giant blaze at a fuel depot sparked by a Ukrainian attack.\n\nUkraine does not confirm the loss of Niu-York, saying Russian forces are attacking near the town.\n\nOfficials said families with children living in Pokrovsk and surrounding villages would be forced to leave. \n\nUkrainian forces continue their incursion into Russia's Kursk region, claiming destruction of a second bridge.\n\nAs Russian forces make slow progress in eastern Ukraine, Ukraine's military stages a surprise cross-border attack.\n\nUkrainians say the foray into Kursk brings tactical advantages - and opens the door to ending the war.\n\nThe way US weapons are used in the war keeps changing - US officials are assessing how Putin might react.\n\nAs a hot war rages between Russia and Ukraine, there are fears Europe has slipped into a new Cold War.\n\nUkraine's incursion into Kursk raises questions about Mr Putin's ability to keep Russia safe.\n\nKyiv needs to decide whether to keep its forces in Russia to exert maximum pressure on Moscow or withdraw now.\n\nThe BBC's Steve Rosenberg in Aleksin meets Russians wondering how Ukraine's incursion could have happened.\n\nUkrainian troops who entered Russia's Kursk this past week say they took the Russians by surprise.\n\nValerii Kaluiev's son says the new exhibition is a thank you to the people of Bury St Edmunds.\n\nVehicles donated through London's Ulez scrappage scheme are making the four-day journey to Ukraine.\n\nMichael Betoin from Sheffield says he felt a \"calling\" to help those affected by the conflict.\n\nAnd your questions answered on Ukraine’s cross-border offensive.\n\nAlmost 2,000 people have been convicted of collaborating with Russia under a new Ukrainian law.\n\nMore than 500 firefighters have been tackling the giant blaze at a fuel depot sparked by a Ukrainian attack.\n\nAlex Ryzhuk, who is 20 years old and from Dublin, is presumed dead.\n\nThousands of Ukrainian refugees could be forced on to the streets or back to Ukraine.\n\nUkrainian Mike Vorobets runs a mobile barber business, offering haircuts and a listening ear.\n\nUkraine does not confirm the loss of Niu-York, saying Russian forces are attacking near the town.\n\nOfficials said families with children living in Pokrovsk and surrounding villages would be forced to leave. \n\nVolodymyr Zelensky says UK support has \"slowed down\" as he repeats plea for long-range missile capability. \n\nUkrainian forces continue their incursion into Russia's Kursk region, claiming destruction of a second bridge.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "US Election",
        "link": "https://www.bbc.com/news/topics/cj3ergr8209t",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nTrying to understand it for the first time or need a refresher? This guide can help.\n\nThe running mate of Kamala Harris told the Democratic convention that voters should back \"the right team\" and \"turn the page on Donald Trump\".\n\nThe TV star's unannounced speech hit back at Republican jibes at \"childless cat ladies\".\n\nTim Walz said it was the honour of his life to be selected as Kamala Harris's running mate, as he addressed crowds at the DNC.\n\nDemocrats used the convention to try to flip the script on Republican criticism of their immigration policies.\n\nWhat they have tried to avoid says as much about their weaknesses as what they choose to highlight, writes Anthony Zurcher.\n\nIndependent says he will address nation about his campaign as Trump says he would welcome his support.\n\nThe former wrestler, who supports Donald Trump, also made comments about the vice-president's racial identity.\n\nFederal agencies say Iran was trying \"to stoke discord and undermine confidence in our democratic institutions\".\n\nThe two vice-presidential candidates will face off in a debate hosted by CBS in New York. \n\nJoe Biden offered a glowing endorsement of Kamala Harris, and Donald Trump spoke in New Jersey.\n\nThe Minnesota governor is a former public school teacher, National Guardsman and member of Congress.\n\nExperts say Arizona, Georgia, Michigan, Nevada, Pennsylvania and Wisconsin could hold the key to the White House.\n\nHow does the US electoral college elect the president? And what's Congress got to do with it?\n\nA very quick guide to Donald Trump's life story.\n\nRobert F Kennedy Jr has seen his fortunes dip but third-party candidates could threaten Harris and Trump.\n\nTake a look at the husband, step-children and others supporting Kamala Harris in her White House bid. \n\nThe former basketball star who has expressed fringe and conspiratorial beliefs won the Republican senate primary in Minnesota.\n\nA educator and prison reform advocate, Gwen Walz advises her husband from an office in the Minnesota capitol. \n\nThe Republican presidential candidate is forging new alliances as his campaign gains momentum.\n\nAmericans are taking loans to afford basic necessities - as groceries prices have surged by 25%.\n\n\nTim Walz accepts his VP nomination, Bill Clinton pokes fun at Trump and Oprah makes a surprise appearance.\n\n\nHer Gen Z supporters say the economy, abortion rights and a Gaza ceasefire are among their priorities.\n\nHillary Clinton says she and Kamala Harris have both put \"cracks in the glass ceiling\" for women.\n\nNorth America editor Sarah Smith describes the atmosphere as the president addressed fellow Democrats.\n\nWho is Kamala Harris and how did she rise to the top of the US Democratic Party?\n\nA think-tank with ties to Trump has set out a vision for another term in office. The former president denies any links.\n\nThe mass deportation of undocumented immigrants would face legal and practical challenges - and cost billions.\n\nThe Republican presidential candidate wrongly said AI was used on a photo showing thousands at a Harris rally in Detroit, BBC Verify reports. \n\nKamala Harris' running mate taught high school, and those he taught say he was \"a gifted educator\".\n\nA shake up for the Democrats has led to an attention deficit for Trump - an unusual position for the ex-president, writes the BBC's Katty Kay.\n\nThe mass deportation of undocumented immigrants would face legal and practical challenges - and cost billions.\n\nThe two businessmen have sparred in the past - but in this election seem firmly on the same side.\n\nSome political experts say calling Trump “weird” effectively repackages President Biden’s “threat to democracy” theme with a light touch.\n\nWeak jobs figures have spooked stock markets but does this mean a downturn is on the way?\n\nThe Republican presidential candidate wrongly said AI was used on a photo showing thousands at a Harris rally in Detroit, BBC Verify reports. \n\nThe BBC spoke to Democratic voters about Kamala Harris's choice of running-mate.\n\nLiberal voters - and one Republican sceptical of Trump - react to Biden's decision to endorse Harris.\n\nWe spoke with voters about Trump's selection of Vance as his running mate. \n\nWe asked Democratic voters if they thought Joe Biden should be replaced and by whom. \n\nWe asked voters across the political spectrum what they thought of 2024's first presidential debate.\n\nThe TV star's unannounced speech hit back at Republican jibes at \"childless cat ladies\".\n\nThe running mate of Kamala Harris told the Democratic convention that voters should back \"the right team\" and \"turn the page on Donald Trump\".\n\nTim Walz said it was the honour of his life to be selected as Kamala Harris's running mate, as he addressed crowds at the DNC.\n\nOprah Winfrey spoke about racism, sexism, and income inequality as she addressed the DNC.\n\nDemocrats used the convention to try to flip the script on Republican criticism of their immigration policies.\n\nFormer President Bill Clinton criticised Kamala Harris's rival as he took to the stage at the DNC.\n\nTrump was in North Carolina, at his first outdoor rally since an attempted assassination.\n\nThe Obamas opted to use jokes, not dark and ominous warnings, in their takedown of the Republican candidate.\n\nIndependent says he will address nation about his campaign as Trump says he would welcome his support.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "US & Canada",
        "link": "https://www.bbc.com/news/us-canada",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nThe running mate of Kamala Harris told the Democratic convention that voters should back \"the right team\" and \"turn the page on Donald Trump\".\n\nThe TV star's unannounced speech hit back at Republican jibes at \"childless cat ladies\".\n\nTrump was in North Carolina, at his first outdoor rally since an attempted assassination.\n\nAs a labour dispute rages on, businesses warn of a \"devastating impact\" on goods from beans to timber.\n\nThe ex-Las Vegas public administrator denies stabbing a journalist who had written negative stories about him.\n\nThe TV star's unannounced speech hit back at Republican jibes at \"childless cat ladies\".\n\nTim Walz said it was the honour of his life to be selected as Kamala Harris's running mate, as he addressed crowds at the DNC.\n\nDemocrats used the convention to try to flip the script on Republican criticism of their immigration policies.\n\nTrump was in North Carolina, at his first outdoor rally since an attempted assassination.\n\nIndependent says he will address nation about his campaign as Trump says he would welcome his support.\n\nThe couple lauded Kamala Harris but urged their party members to \"get to work\" if they wanted to defeat Donald Trump. \n\nThe US says jobs growth was weaker than previously estimated. So how worried should we be?\n\nThe rate of unruly passengers has dropped by over 80% since peaking in early 2021. \n\n\nTim Walz accepts his VP nomination, Bill Clinton pokes fun at Trump and Oprah makes a surprise appearance.\n\n\nOprah Winfrey spoke about racism, sexism, and income inequality as she addressed the DNC.\n\nHer Gen Z supporters say the economy, abortion rights and a Gaza ceasefire are among their priorities.\n\nThe Obamas capitivated the crowd in Chicago as Michelle told supporters \"hope is making a comeback\".\n\nFormer First Lady Michelle Obama got a lengthy standing ovation as she told delegates she thought \"something magical was in the air\".\n\nThe former president and first lady aim jokes at Donald Trump - and rapper Lil Jon gets delegates on their feet.\n\nBBC Verify examined claims made by Harris, about her record and Trump's on the economy, abortion and immigration.\n\nTwo decades after they first met, he will use his convention speech to try to propel her to the White House.\n\nThe former Los Angeles entertainment lawyer could make his own history if his wife, Kamala Harris, is elected president in November. \n\nThe president lauded Kamala Harris and said he gave his \"heart and soul to this nation”.\n\nAs a labour dispute rages on, businesses warn of a \"devastating impact\" on goods from beans to timber.\n\nThe running mate of Kamala Harris told the Democratic convention that voters should back \"the right team\" and \"turn the page on Donald Trump\".\n\n\nTim Walz accepts his VP nomination, Bill Clinton pokes fun at Trump and Oprah makes a surprise appearance.\n\n\nTim Walz said it was the honour of his life to be selected as Kamala Harris's running mate, as he addressed crowds at the DNC.\n\nOprah Winfrey spoke about racism, sexism, and income inequality as she addressed the DNC.\n\nDemocrats used the convention to try to flip the script on Republican criticism of their immigration policies.\n\nThe ex-Las Vegas public administrator denies stabbing a journalist who had written negative stories about him.\n\nFormer President Bill Clinton criticised Kamala Harris's rival as he took to the stage at the DNC.\n\nTrump was in North Carolina, at his first outdoor rally since an attempted assassination.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "UK",
        "link": "https://www.bbc.com/news/uk",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nOur panel of experts are answering your questions after GCSE, BTec Tech Awards and other Level 2 results are released in England, Wales and NI.\n\nFirms across the supply chain to the oil and gas industry have warned that official plans threaten investment.\n\nStrong winds and heavy rain set to hit the UK on Friday morning which could cause some disruption\n\nPolice \"urgently\" want to trace Eddie Hampshire over the death of Claudiu-Carol Kondor in Leeds.\n\nThe decline comes after the former Conservative government introduced restrictions on foreign workers and their families in an effort to slash overall immigration.\n\nFirms across the supply chain to the oil and gas industry have warned that official plans threaten investment.\n\nHealth assessment body NICE says the benefits “are too small to justify the costs”.\n\nReport finds officers are having to cancel appointments with victims and delay making arrests.\n\nStrong winds and heavy rain set to hit the UK on Friday morning which could cause some disruption\n\nA hearing at Colchester Magistrates' Court is told the dogs were called Beauty and Bear.\n\nVisitors would be charged an additional 5% on top of their hotel bill to stay in the city if plans are approved. \n\nThe 1912 newspaper shows two women in Southampton waiting for a list of survivors to be posted.\n\nThe number of new claims rose in April, after a rule change on how much parents can earn and still be eligible.\n\nThe public will vote for which of the trees will become the UK's favourite.\n\nThe GCSE pass rate is down for the third year running across England, Wales and Northern Ireland.\n\nThe self-named Brickie Boys want to show young people they can be a success without the grades.\n\nThe 9-1 grading system for GCSEs began in 2017 in England.\n\nBBC journalist Terel Edmunds goes through the options available if your GCSEs didn't go as planned.\n\nMatch of the Day presenter Gary Lineker speaks to BBC Breakfast's John Watson as the flagship football show celebrates its 60th birthday.\nLineker has been presenting the show for 25 years since 1999.\n\nVideo released by the National Crime Agency shows two men leaping off a boat whilst being pursed by UK Border Force.\n\nEngland make a strong start to life under Ollie Pope’s temporary captaincy, bowling out Sri Lanka for 236 on the first day of the first Test at Emirates Old Trafford.\n\nLondoners are surprised when a German Navy ship blasts out the music from the Star Wars trilogies.\n\nA group of young martial artists from Rochdale are celebrating after a pan-European tournament.\n\nNew play Shifters tells the story of two young black people who meet again after years apart.\n\nLearn more about some of the British athletes hoping to impress at the Paris Paralympic Games.\n\nThe GCSE pass rate is down for the third year running across England, Wales and Northern Ireland.\n\nThe self-named Brickie Boys want to show young people they can be a success without the grades.\n\nKeziah Hall was forced out her home of 16 years and spent a year trying to find a new place to live.\n\nThe decline comes after the former Conservative government introduced restrictions on foreign workers and their families in an effort to slash overall immigration.\n\nReport finds officers are having to cancel appointments with victims and delay making arrests.\n\nThe public will vote for which of the trees will become the UK's favourite.\n\nLuke Moran's assault left an officer fearing for their life as he tried to smash a van window during the Southport riots.\n\nKeir Starmer has said the UK will \"smash the gangs\" bringing people to the UK in small boats.\n\nMalignant skin cancer makes up about 40% of all cases in Jersey and Guernsey, data shows.\n\nPolice tell the BBC the man is suspected of cyber terrorism.\n\nThe family of the student killed in the Nottingham attacks make a first donation in his memory.\n\nSeveral men who participated in a riot in Rotherham outside a hotel were also given lengthy prison sentences.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Africa",
        "link": "https://www.bbc.com/news/world/africa",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nWilliam Smith, hailed for being a maths and science education innovator, has died aged 85.\n\nA 2,492-carat stone has been unearthed, in the biggest find since the Cullinan diamond in 1905. \n\nHumans could be at risk following the discovery of contaminated maize batches, health minister says.\n\nNigerians say the timing is wrong considering the country is facing its worst economic crisis in decades.\n\nCharlie the elephant has been in captivity since 1984, when he was captured at two years old.\n\nA 2,492-carat stone has been unearthed, in the biggest find since the Cullinan diamond in 1905. \n\nWhile Lesotho sells water to South Africa some near a huge dam have to use an unreliable spring. \n\nAs a global emergency is declared over mpox, our health and science correspondent assesses the threat.\n\nHumans could be at risk following the discovery of contaminated maize batches, health minister says.\n\nThousands of Africans employed as domestic workers are fearing what could happen if war breaks out.\n\nMia Couto grew up in Mozambique during the colonial era, and joined its struggle for independence. \n\nLiya’u Sa’adu cannot afford to rent a shack, let alone a room - like some 500,000 others in Nigeria’s main city.\n\nNineteen years and 10 miles separated Zambia's football team from a lost, golden generation on a fateful night in Libreville.\n\nA selection of the week's best photos from across the African continent.\n\nMpox, which used to be called monkeypox, is declared a global public health emergency.\n\nLocal authorities are seeking to build a seawall to prevent further intrusion of the ocean to the village. \n\nKyiv's hand in aiding rebels in Mali against Russian mercenaries may scupper its Africa diplomacy.\n\nNigeria are narrowing down their options in the hunt for a new manager, with Herve Renard still a contender to replace Finidi George.\n\nHusnah Kukundakwe made history at the Tokyo Paralympic Games as the youngest competitor, age 14. Now the Ugandan Para-swimmer is aiming to become her nation's first female Paralympic medallist.\n\nMeet Sly, a young BMXer in Lagos who is looking to outride the boys and turn professional.\n\nFollowing a heated build-up to their fight at UFC 305, Israel Adesanya and Dricus du Plessis agree that Africa was the real winner of the night after the pair settled their differences.\n\nAfrica secured a total of 39 medals at the Paris 2024 Olympics, but which countries were winners and losers?\n\nAhead of the new Premier League season, Arsenal have released a new kit celebrating the club's connection to Africa.\n\nRwanda’s only official parkour athlete, Niyonzima Alfred, on the dedication it takes to reach the top of the sport.\n\nThree essential stories to round off your working day. Explaining the news from Africa.\n\nOne question to wake up to every weekday morning. One story from Africa, for Africa\n\nA 2,492-carat stone has been unearthed, in the biggest find since the Cullinan diamond in 1905. \n\nWilliam Smith, hailed for being a maths and science education innovator, has died aged 85.\n\nWhile Lesotho sells water to South Africa some near a huge dam have to use an unreliable spring. \n\nCharlie the elephant has been in captivity since 1984, when he was captured at two years old.\n\nHumans could be at risk following the discovery of contaminated maize batches, health minister says.\n\nEight officers have been suspended after the 33-year-old escaped by scaling a wall, police say.\n\nNigerians say the timing is wrong considering the country is facing its worst economic crisis in decades.\n\nThe interim president says he wants to \"immerse\" politicians in the realities of ordinary people.\n\nPeter Mutharika is picked to run in next year's presidential election by the main opposition DPP.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Asia",
        "link": "https://www.bbc.com/news/world/asia",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nThe country's leaders want to reverse a constitutional court decision to open up elections to their rivals.\n\nAuthorities had initially installed the barrier after growing tired of visitors' bad behaviour.\n\nThe pilgrims had been on their way to Iraq to commemorate Arbaeen, one of the biggest events in the Shia calendar.\n\nEllen Rachel Craig was sentenced to nine years for beating the toddler to death for failing to do her chores.\n\nShakib, considered one of his country's greatest sportsmen, was cleared to play against Pakistan.\n\nAuthorities had initially installed the barrier after growing tired of visitors' bad behaviour.\n\nDang Tien Lam was found by locals who heard a child's cries while they were farming near the forest.\n\nSoaring prices have been a major concern for the country as its currency comes under pressure.\n\nThe pilgrims had been on their way to Iraq to commemorate Arbaeen, one of the biggest events in the Shia calendar.\n\nFormer deputy PM Prawit Wongsuwon hit the female reporter on the head while surrounded by media.\n\nFormer mayor Alice Guo left the country undetected last month, invoking the fury of President Ferdinand Marcos Jr.\n\nOfficials at the National Assembly tell the BBC the rats have been terrifying new starters.\n\nHundreds gathered to protest against the alleged sexual assault of two children in Maharashtra .\n\nThirty six flights were cancelled and 201 delayed on the weekend at one of Japan's busiest airports.\n\nParents of the doctor, who was raped and murdered, talk about their caring and affectionate daughter.\n\nClimate change is melting glaciers at unprecedented rates - and putting thousands in Nepal at risk.\n\nThe firm is deciding whether to remain in Japanese ownership or return to its Northern American roots.\n\nStanford University is fighting to keep the diaries, in a case framed as a battle against China's censorship.\n\nThe BBC has spoken to survivors to piece together the attack on civilians earlier this month.\n\nThe country's leaders want to reverse a constitutional court decision to open up elections to their rivals.\n\nAuthorities had initially installed the barrier after growing tired of visitors' bad behaviour.\n\nDang Tien Lam was found by locals who heard a child's cries while they were farming near the forest.\n\nYuanjun Tang, now an American citizen, is alleged to have spied on US-based Chinese democracy activists.\n\n\nMany countries have lifted bans on blood donations by LGBT people, but India hasn't yet.\n\nShakib, considered one of his country's greatest sportsmen, was cleared to play against Pakistan.\n\nFormer deputy PM Prawit Wongsuwon hit the female reporter on the head while surrounded by media.\n\nParents of the doctor, who was raped and murdered, talk about their caring and affectionate daughter.\n\nFormer mayor Alice Guo left the country undetected last month, invoking the fury of President Ferdinand Marcos Jr.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Australia",
        "link": "https://www.bbc.com/news/world/australia",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nSphen and his partner Magic shot to global stardom in 2018 when they fell in love at a Sydney aquarium.\n\nEllen Rachel Craig was sentenced to nine years for beating the toddler to death for failing to do her chores.\n\nPatrick Delaney tried to explain the context of an old photo that showed him \"demonstrating\" the gesture.\n\nThe Australian hip-hop community has been shaken by the reaction to Raygun's efforts in Paris.\n\nHorseracing great Black Caviar, who won a record 25 consecutive races and was affectionately known as the 'Wonder from Down Under', dies at the age of 17.\n\nEllen Rachel Craig was sentenced to nine years for beating the toddler to death for failing to do her chores.\n\nAn innovative research method helps discover sea lion behaviours and chart ocean habitats.\n\nTrack cyclist Matt Richardson, who won three medals for Australia at the Paris Olympics, switches nationality and will now represent Great Britain. \n\nPatrick Delaney tried to explain the context of an old photo that showed him \"demonstrating\" the gesture.\n\nLolita was allegedly taken from her home by a group of Saudi men after fleeing an abusive marriage.\n\nEven those who knew him best had no clue crocodile expert Adam Britton was torturing dozens of dogs to death.\n\nMary is a frail pensioner who is living out of her car after losing her rental property.\n\nMichelle Heyman's comeback has been called one of the greatest in Australian sporting history.\n\nA whistleblower vet alleges some dogs are being over-raced and euthanised without cause.\n\nThe supermoon - also a blue moon - doesn't actually turn blue but it glowed red in some places due to wildfire smoke.\n\nABC News Breakfast's Nate Byrne speaks with the BBC about how he handled the on-air moment.\n\nThe Australian b-girl said she \"gave her best\" during her performance at the Paris Olympics\n\nMany flights have been grounded, with huge queues and delays at airports all over the world.\n\nWikileaks founder Julian Assange has walked free from a US court after pleading guilty in a deal to end a years long legal battle.\n\nSphen and his partner Magic shot to global stardom in 2018 when they fell in love at a Sydney aquarium.\n\nEllen Rachel Craig was sentenced to nine years for beating the toddler to death for failing to do her chores.\n\nPatrick Delaney tried to explain the context of an old photo that showed him \"demonstrating\" the gesture.\n\nThe Australian hip-hop community has been shaken by the reaction to Raygun's efforts in Paris.\n\nTottenham sign Australia international Clare Hunt from Paris St-Germain on a three-year deal. \n\nThe Australian b-girl said she \"gave her best\" during her performance at the Paris Olympics\n\nJayson Gillham premiered a piece that was dedicated to the journalists of Gaza.\n\nMore than 100 candidates cannot run in New South Wales after the Liberal party misses a nomination deadline.\n\nABC News Breakfast's Nate Byrne speaks with the BBC about how he handled the on-air moment.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Europe",
        "link": "https://www.bbc.com/news/world/europe",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nAlmost 2,000 people have been convicted of collaborating with Russia under a new Ukrainian law.\n\nThe search is resuming for one person who's still missing after a luxury yacht sank in a storm off the coast of Sicily on Monday.\n\nThousands of Ukrainian refugees could be forced on to the streets or back to Ukraine.\n\nMore than 500 firefighters have been tackling the giant blaze at a fuel depot sparked by a Ukrainian attack.\n\nThe gunman is said to have shot the employees and then himself at a school in Sanski Most, north-western Bosnia.\n\nThe search is resuming for one person who's still missing after a luxury yacht sank in a storm off the coast of Sicily on Monday.\n\nThe US pop star cancelled three concerts in Austria after an alleged suicide attack plot was uncovered.\n\nThe internet personality and his brother have been remanded in custody as part of a probe into new allegations.\n\nThousands of Ukrainian refugees could be forced on to the streets or back to Ukraine.\n\nThe search is resuming for one person who's still missing after a luxury yacht sank in a storm off the coast of Sicily on Monday.\n\nDivers trained to work in small spaces are flown in but strong winds are making conditions harder.\n\nUkrainian forces continue their incursion into Russia's Kursk region, claiming destruction of a second bridge.\n\nThe 19-year-old describes his arrest, surviving Russian jail and being part of the recent prisoner swap.\n\nThe boy was attacked on a football pitch by a masked person with a sharp object, Spanish media report.\n\nSix people are still missing after the British-flagged superyacht Bayesian sank during freak weather.\n\nTravellers will have to pay €7 for a visa waiver every three years or until their passport expires.\n\nThe BBC's Steve Rosenberg in Aleksin meets Russians wondering how Ukraine's incursion could have happened.\n\nUkrainians say the foray into Kursk brings tactical advantages - and opens the door to ending the war.\n\nAs Russian forces make slow progress in eastern Ukraine, Ukraine's military stages a surprise cross-border attack.\n\nUK ambassador to Italy Edward Llewellyn says survivors described 'distressing' situation\n\nA helicopter and divers were deployed at the scene where a yacht sank, as rescue operations continue.\n\nThe supermoon - also a blue moon - doesn't actually turn blue but it glowed red in some places due to wildfire smoke.\n\nHomes shook and ash covered the roads after an earthquake caused the Shiveluch volcano to erupt.\n\nThe BBC's Steve Rosenberg in Aleksin meets Russians wondering how Ukraine's incursion could have happened.\n\nAlmost 2,000 people have been convicted of collaborating with Russia under a new Ukrainian law.\n\nMore than 500 firefighters have been tackling the giant blaze at a fuel depot sparked by a Ukrainian attack.\n\nAlex Ryzhuk, who is 20 years old and from Dublin, is presumed dead.\n\nThe internet personality and his brother have been remanded in custody as part of a probe into new allegations.\n\nSix people are still missing after the British-flagged superyacht Bayesian sank during freak weather.\n\nThe grim discoveries come two days after the Bayesian sank in a freak storm off  Sicily.\n\nTravellers will have to pay €7 for a visa waiver every three years or until their passport expires.\n\nThousands of Ukrainian refugees could be forced on to the streets or back to Ukraine.\n\nSadik Duraku, 54, was arrested on 17 April while travelling to visit relatives in Kosovo. \n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Latin America",
        "link": "https://www.bbc.com/news/world/latin_america",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nAna Carolina Guaita is the latest person to be detained in a post-election crackdown by authorities. \n\nSome 50,000 barrels of oil have leaked since the ship overturned off the Caribbean nation's coast in February.\n\nOpposition leader María Corina Machado joined thousands of demonstrators in the capital Caracas.\n\nNew Zealand thrash Argentina 42-10 to avenge the defeat by the Pumas in their opening match of the 2024 Rugby Championship.\n\nThe social media platform says its legal representative was threatened by a supreme court judge. \n\nSome 50,000 barrels of oil have leaked since the ship overturned off the Caribbean nation's coast in February.\n\nA Brazilian police investigation into allegations of domestic abuse by Manchester United winger Antony is closed, though prosecutors could still look the claims.\n\nThe United States is paying for flights taking US-bound migrants back to South America.\n\nOpposition leader María Corina Machado joined thousands of demonstrators in the capital Caracas.\n\nJuly's presidential election lacked \"basic transparency and integrity\", a UN panel of experts finds.\n\nPressure groups say there is a new pattern of more targeted arrests following the disputed election.\n\nAn election dismissed by independent observers as \"undemocratic\" has thrown Venezuela into turmoil.\n\nHundreds of demonstrators have been detained following Venezuela's disputed presidential election.\n\nUnder pressure to back up claims he won the election, President Maduro turns to the country's top court. \n\nA British-Mexican man arrested in Qatar has given his first interview since returning home.\n\nThe couple's South America visit was an attempt to still show their influence on the world stage.\n\nStudies show the hearts and brains of Bolivia's indigenous Tsimane people are the healthiest on the planet.\n\nThe mass deportation of undocumented immigrants would face legal and practical challenges - and cost billions.\n\nCritics call the vice-president a \"failed border tsar\" - but supporters say that was not her mission. \n\nThe supermoon - also a blue moon - doesn't actually turn blue but it glowed red in some places due to wildfire smoke.\n\nPrince Harry and his wife Meghan have been taking part in a series of events in Colombia.\n\nAll 61 people on board were killed when a Voepass plane came down in São Paulo state.\n\nVideos show opposition protesters in multiple locations taking to the streets.\n\n\nAna Carolina Guaita is the latest person to be detained in a post-election crackdown by authorities. \n\nSome 50,000 barrels of oil have leaked since the ship overturned off the Caribbean nation's coast in February.\n\nThe couple's South America visit was an attempt to still show their influence on the world stage.\n\nPrince Harry and his wife Meghan have been taking part in a series of events in Colombia.\n\nOpposition leader María Corina Machado joined thousands of demonstrators in the capital Caracas.\n\nStudies show the hearts and brains of Bolivia's indigenous Tsimane people are the healthiest on the planet.\n\nThe social media platform says its legal representative was threatened by a supreme court judge. \n\nProvides an overview of Venezuela, including key dates and facts about this South American country.\n\nThe Duke and Duchess of Sussex are visiting Colombia following an invitation from the vice-president.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Middle East",
        "link": "https://www.bbc.com/news/world/middle_east",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nThe US president stresses to Israel's PM the importance of removing “any remaining obstacles”.\n\nFears are growing that the cross-border hostilities could escalate into an all-out war.\n\nInbal Peri tells the BBC her father might be alive if Israel's PM had agreed to a Gaza ceasefire.\n\nA senior US official says Benjamin Netanyahu's reported comments are “not constructive to getting a ceasefire deal\".\n\nThe pilgrims had been on their way to Iraq to commemorate Arbaeen, one of the biggest events in the Shia calendar.\n\nFears are growing that the cross-border hostilities could escalate into an all-out war.\n\nThe Greek-flagged Sounion was hit by gunfire from small boats and three unidentified projectiles.\n\nAshraf El Attar's wife and six children were killed when an air strike destroyed their home in Deir al-Balah.\n\nInbal Peri tells the BBC her father might be alive if Israel's PM had agreed to a Gaza ceasefire.\n\nIsrael's military says it targeted a Hamas command and control centre inside the Gaza City school.\n\nThousands of Africans employed as domestic workers are fearing what could happen if war breaks out.\n\nFederal agencies say Iran was trying \"to stoke discord and undermine confidence in our democratic institutions\".\n\nA British-Mexican man arrested in Qatar has given his first interview since returning home.\n\nIsraeli security forces said Sunday's blast killed the suspected attacker and injured a passer-by.\n\nThe Saudi royal, who vows to modernise his country, has faced accusations of human rights violations.\n\nThe US believes a deal could help calm the Middle East, but do Israel and Hamas's leader want one?\n\nLocals in the capital Beirut tell the BBC their fears of another war between Israel and Hezbollah.\n\nMore than 600 Palestinians and at least 17 Israelis have been killed in the West Bank since October.\n\nKhaled's equestrian centre was destroyed by Israel after being built without a permit.\n\nThe supermoon - also a blue moon - doesn't actually turn blue but it glowed red in some places due to wildfire smoke.\n\nThe Hamas leader was killed in Tehran, after attending the inauguration of President Masoud Pezeshkian.\n\nSmoke seen rising from above the Lebanese capital, as building is damaged and crowds of people gathered outside.\n\nThousands of displaced Gazans return to the ruins of the southern city, after a week-long Israeli operation ends.\n\nThe BBC's Paul Adams visits the site where 12 people, mostly children, were killed in the Israeli-occupied Golan Heights.\n\nFears are growing that the cross-border hostilities could escalate into an all-out war.\n\nAshraf El Attar's wife and six children were killed when an air strike destroyed their home in Deir al-Balah.\n\nInbal Peri tells the BBC her father might be alive if Israel's PM had agreed to a Gaza ceasefire.\n\nIsrael's military says it targeted a Hamas command and control centre inside the Gaza City school.\n\nFive of their deaths had already been confirmed by Israel, though it was thought one could still be alive. \n\nIt is thought 116 Israelis and foreigners remain unaccounted for after the 7 October attacks.\n\nIsraeli security forces said Sunday's blast killed the suspected attacker and injured a passer-by.\n\nThe US, Qatar and Egypt say talks will resume in Cairo next week with the aim of agreeing a deal.\n\nThe Israeli prime minister says he views the incident with “utmost severity”.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "In Pictures",
        "link": "https://www.bbc.com/news/in_pictures",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nA nature reserve's photography club is holding its annual display at the end of August.\n\nSmoke from wildfires in north America has brought a \"vivid\" hue to skies above Britain ahead of a rare lunar phenomenon.\n\nThe Mangrove Photography Awards entries capture unique ecosystems above and below the waterline.\n\nA selection of eye-catching moments from the opening ceremony for the 2024 Olympic Games in Paris.\n\nA selection of the week's best photos from across the African continent.\n\nSmoke from wildfires in north America has brought a \"vivid\" hue to skies above Britain ahead of a rare lunar phenomenon.\n\nA selection of photos of the spectacular event from around the world.\n\nA selection of the week's best photos from across the African continent.\n\nThe Mangrove Photography Awards entries capture unique ecosystems above and below the waterline.\n\nQueen by Magnus Hastings is a \"one of a kind\" drag photography exhibition.\n\nDonald Trump rushed off stage during a rally in Butler, Pennsylvania after loud bangs were heard\n\nTwo early photographers, who took images of street life and political upheaval, honoured in London.\n\nMohamed Zakaria made the dangerous journey to flee the besieged city of el-Fasher.\n\nWaterlooville artist Caroline West says she has featured locations like Stonehenge on her bags.\n\nA selection of striking news photographs taken around the world this week.\n\nA selection of striking news photographs taken around the world this week.\n\nA selection of striking news photographs taken around the world this week.\n\nA selection of striking news photographs taken around the world this week.\n\nA selection of striking news photographs taken around the world this week.\n\nA selection of your pictures on the theme of 'in the kitchen'.\n\nA  selection of your pictures on the theme of 'time'.\n\nEach week, we ask you to send in your pictures on a set theme and a selection of these are then published each Thursday on our In pictures page\n\nA  selection of your pictures on the theme of 'shadows'.\n\nA selection of the photographs on a given theme.\n\nJames Barnor, who has photographed the likes of Muhammad Ali, is being honoured in Accra.\n\nAndy Bailey has been photographing bins in his Cheshire town, giving them a rating out of 25.\n\nMore than 1,000 images of the national park are being made available for use free of charge.\n\nJohn Hayward's pictures feature in a new version of A Shropshire Lad by A. E. Housman.\n\nWith her eye in the sky, Joanna Steidle captures images of the elusive creatures.\n\nA selection of striking news photographs taken around the world this week.\n\nShowcasing the best images sent to us from around Hampshire & Isle of Wight.\n\nA selection of your pictures on the theme of 'in the kitchen'.\n\nA selection of striking news photographs taken around the world this week.\n\nA selection of striking news photographs taken around the world this week.\n\nA selection of striking news photographs taken around the world this week.\n\nShowcasing the best images sent to us from around Hampshire & Isle of Wight.\n\nShowcasing the best images sent to us from around Hampshire & Isle of Wight.\n\nShowcasing the best images sent to us from around Dorset.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "BBC Verify",
        "link": "https://www.bbc.com/news/reality_check",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nBBC Verify examined claims made by Harris, about her record and Trump's on the economy, abortion and immigration.\n\nIt's been a week since the start of the country's largest and most significant incursion into Russia since the war began.\n\n Walz's military record has been under scrutiny after a series of claims made by veterans and leading Republicans.\n\nCrisis is unfolding in northern Ethiopia - driven by drought, crop failure and insecurity following war.\n\nThe former president's speech contained plenty of claims which BBC Verify has been checking.  \n\n\nIt's been a week since the start of the country's largest and most significant incursion into Russia since the war began.\n\nIn a two-hour discussion, Trump made a number of questionable and false claims  which went largely unchallenged. \n\nThe Republican presidential candidate wrongly said AI was used on a photo showing thousands at a Harris rally in Detroit, BBC Verify reports. \n\n Walz's military record has been under scrutiny after a series of claims made by veterans and leading Republicans.\n\nIt's been a week since the start of the country's largest and most significant incursion into Russia since the war began.\n\nBBC Verify's Richard Irvine-Brown analyses the footage from Manchester Airport's Terminal 2.\n\nFrench rail company SNCF said its high-speed network had been targeted by \"malicious acts\" aimed at paralysing the rail network.\n\nRos Atkins examines the evidence about crucial warnings in the minutes before the attack on Donald Trump.\n\nWatch BBC Verify's visual analysis of the strike which killed two adults and injured 300.\n\nThe Irish government claims over 80% of asylum seekers have crossed the border from Northern Ireland.\n\nSimeon Boikov sparked a social media frenzy implicating an innocent 20-year-old in the shopping mall attack.\n\nBBC Verify examines the evidence on combatant deaths, as concern grows about the scale of civilian killing.\n\nPresident Putin has said Western military advisers are actively involved in Ukraine.\n\nRussia called footage of bodies in Bucha 'staged' but its evidence for this does not stack up.\n\nThe target, set out in the 2024 Labour manifesto, is for 1.5 million new homes over the next parliament.\n\nWarnings for rain have been issued in the UK today and the details are on our weather app. Here's a guide how to get the most from it.\n\nThe prime minister said five priorities should be used to hold his government to account.\n\nVladimir Putin visits Beijing this week, as it faces accusations of supporting Moscow's war in Ukraine.\n\nThe government's climate advisers warn the UK risks falling behind on efforts to reach net zero by 2050.\n\nThe government has awarded funding to projects across the country as part of its \"levelling up\" plan.\n\nOfficially, the highest tax rate is 45% - but some workers can end up paying higher effective rates.\n\nMore parents are losing child benefit because the threshold at which it starts being withdrawn has not changed in 10 years.\n\nNew data suggests that the cost of living has been rising faster than official inflation figures.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Israel-Gaza War",
        "link": "https://www.bbc.com/news/topics/c2vdnvdg6xxt",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nFears are growing that the cross-border hostilities could escalate into an all-out war.\n\nAshraf El Attar's wife and six children were killed when an air strike destroyed their home in Deir al-Balah.\n\nIsrael's military says it targeted a Hamas command and control centre inside the Gaza City school.\n\nFive of their deaths had already been confirmed by Israel, though it was thought one could still be alive. \n\nUS Secretary State Antony Blinken met with Israeli leader Benjamin Netanyahu to push for an urgent ceasefire.\n\nAshraf El Attar's wife and six children were killed when an air strike destroyed their home in Deir al-Balah.\n\nInbal Peri tells the BBC her father might be alive if Israel's PM had agreed to a Gaza ceasefire.\n\nA senior US official says Benjamin Netanyahu's reported comments are “not constructive to getting a ceasefire deal\".\n\nIsrael's military says it targeted a Hamas command and control centre inside the Gaza City school.\n\nA brief guide to some of the leading figures in the group behind the attacks on Israel.\n\nA deadly attack on the Israeli occupied Golan Heights has heightened fears of full-on fighting.\n\nIsrael's military is heavily reliant on imported aircraft and munitions to conduct its war in Gaza.\n\nTensions between Israel and the Palestinians date back decades, but what are the key issues?\n\nThe US believes a deal could help calm the Middle East, but do Israel and Hamas's leader want one?\n\nMore than 600 Palestinians and at least 17 Israelis have been killed in the West Bank since October.\n\nThe BBC's Rushdi Abualouf witnessed Hamas’s shadowy veterans gather in Qatar to vote for their new chief.\n\nThe Hamas leader was assassinated in Tehran, and it is widely believed Israel was behind the killing.\n\nHow Israel retaliates could determine whether the conflict stays limited or explodes into something much worse.\n\nLocals in the capital Beirut tell the BBC their fears of another war between Israel and Hezbollah.\n\n\nIn the hills of the West Bank, Palestinian shepherds and Israeli activists unite to face down settler violence.\n\nAn Israeli rights group says prisons are overwhelmed, amid allegations of physical and mental violence.\n\nA young woman's sporadic messages to the BBC's Paul Adams give unique insight into life in Gaza.\n\nOne of the patients had been waiting six months to be able to get out of the war-torn territory.\n\nColin Cowan said the SNP displayed \"double standards\" in the fallout of Angus Robertson's meeting with an Israeli diplomat.\n\nThe US president stresses to Israel's PM the importance of removing “any remaining obstacles”.\n\nDelegates from the Uncommitted National Movement said the decision by Democratic Party leaders was \"unacceptable\".\n\nFears are growing that the cross-border hostilities could escalate into an all-out war.\n\nIn response to calls for his suspension from the Labour Party, Clive Lewis MP says it is \"wrong\" to \"silence\" politicians.\n\nAshraf El Attar's wife and six children were killed when an air strike destroyed their home in Deir al-Balah.\n\nInbal Peri tells the BBC her father might be alive if Israel's PM had agreed to a Gaza ceasefire.\n\nA senior US official says Benjamin Netanyahu's reported comments are “not constructive to getting a ceasefire deal\".\n\nIsrael's military says it targeted a Hamas command and control centre inside the Gaza City school.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "War in Ukraine",
        "link": "https://www.bbc.com/news/war-in-ukraine",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nAlmost 2,000 people have been convicted of collaborating with Russia under a new Ukrainian law.\n\nMore than 500 firefighters have been tackling the giant blaze at a fuel depot sparked by a Ukrainian attack.\n\nUkrainian forces continue their incursion into Russia's Kursk region, claiming destruction of a second bridge.\n\nUkraine surprised many with its incursion which came as Russia was making progress in the east.\n\nThousands of Ukrainian refugees could be forced on to the streets or back to Ukraine.\n\nMore than 500 firefighters have been tackling the giant blaze at a fuel depot sparked by a Ukrainian attack.\n\nUkraine does not confirm the loss of Niu-York, saying Russian forces are attacking near the town.\n\nOfficials said families with children living in Pokrovsk and surrounding villages would be forced to leave. \n\nUkrainian forces continue their incursion into Russia's Kursk region, claiming destruction of a second bridge.\n\nAs Russian forces make slow progress in eastern Ukraine, Ukraine's military stages a surprise cross-border attack.\n\nUkrainians say the foray into Kursk brings tactical advantages - and opens the door to ending the war.\n\nThe way US weapons are used in the war keeps changing - US officials are assessing how Putin might react.\n\nAs a hot war rages between Russia and Ukraine, there are fears Europe has slipped into a new Cold War.\n\nUkraine's incursion into Kursk raises questions about Mr Putin's ability to keep Russia safe.\n\nKyiv needs to decide whether to keep its forces in Russia to exert maximum pressure on Moscow or withdraw now.\n\nThe BBC's Steve Rosenberg in Aleksin meets Russians wondering how Ukraine's incursion could have happened.\n\nUkrainian troops who entered Russia's Kursk this past week say they took the Russians by surprise.\n\nValerii Kaluiev's son says the new exhibition is a thank you to the people of Bury St Edmunds.\n\nVehicles donated through London's Ulez scrappage scheme are making the four-day journey to Ukraine.\n\nMichael Betoin from Sheffield says he felt a \"calling\" to help those affected by the conflict.\n\nAnd your questions answered on Ukraine’s cross-border offensive.\n\nAlmost 2,000 people have been convicted of collaborating with Russia under a new Ukrainian law.\n\nMore than 500 firefighters have been tackling the giant blaze at a fuel depot sparked by a Ukrainian attack.\n\nAlex Ryzhuk, who is 20 years old and from Dublin, is presumed dead.\n\nThousands of Ukrainian refugees could be forced on to the streets or back to Ukraine.\n\nUkrainian Mike Vorobets runs a mobile barber business, offering haircuts and a listening ear.\n\nUkraine does not confirm the loss of Niu-York, saying Russian forces are attacking near the town.\n\nOfficials said families with children living in Pokrovsk and surrounding villages would be forced to leave. \n\nVolodymyr Zelensky says UK support has \"slowed down\" as he repeats plea for long-range missile capability. \n\nUkrainian forces continue their incursion into Russia's Kursk region, claiming destruction of a second bridge.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "US Election",
        "link": "https://www.bbc.com/news/topics/cj3ergr8209t",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nTrying to understand it for the first time or need a refresher? This guide can help.\n\nThe running mate of Kamala Harris told the Democratic convention that voters should back \"the right team\" and \"turn the page on Donald Trump\".\n\nThe TV star's unannounced speech hit back at Republican jibes at \"childless cat ladies\".\n\nTim Walz said it was the honour of his life to be selected as Kamala Harris's running mate, as he addressed crowds at the DNC.\n\nDemocrats used the convention to try to flip the script on Republican criticism of their immigration policies.\n\nWhat they have tried to avoid says as much about their weaknesses as what they choose to highlight, writes Anthony Zurcher.\n\nIndependent says he will address nation about his campaign as Trump says he would welcome his support.\n\nThe former wrestler, who supports Donald Trump, also made comments about the vice-president's racial identity.\n\nFederal agencies say Iran was trying \"to stoke discord and undermine confidence in our democratic institutions\".\n\nThe two vice-presidential candidates will face off in a debate hosted by CBS in New York. \n\nJoe Biden offered a glowing endorsement of Kamala Harris, and Donald Trump spoke in New Jersey.\n\nThe Minnesota governor is a former public school teacher, National Guardsman and member of Congress.\n\nExperts say Arizona, Georgia, Michigan, Nevada, Pennsylvania and Wisconsin could hold the key to the White House.\n\nHow does the US electoral college elect the president? And what's Congress got to do with it?\n\nA very quick guide to Donald Trump's life story.\n\nRobert F Kennedy Jr has seen his fortunes dip but third-party candidates could threaten Harris and Trump.\n\nTake a look at the husband, step-children and others supporting Kamala Harris in her White House bid. \n\nThe former basketball star who has expressed fringe and conspiratorial beliefs won the Republican senate primary in Minnesota.\n\nA educator and prison reform advocate, Gwen Walz advises her husband from an office in the Minnesota capitol. \n\nThe Republican presidential candidate is forging new alliances as his campaign gains momentum.\n\nAmericans are taking loans to afford basic necessities - as groceries prices have surged by 25%.\n\n\nTim Walz accepts his VP nomination, Bill Clinton pokes fun at Trump and Oprah makes a surprise appearance.\n\n\nHer Gen Z supporters say the economy, abortion rights and a Gaza ceasefire are among their priorities.\n\nHillary Clinton says she and Kamala Harris have both put \"cracks in the glass ceiling\" for women.\n\nNorth America editor Sarah Smith describes the atmosphere as the president addressed fellow Democrats.\n\nWho is Kamala Harris and how did she rise to the top of the US Democratic Party?\n\nA think-tank with ties to Trump has set out a vision for another term in office. The former president denies any links.\n\nThe mass deportation of undocumented immigrants would face legal and practical challenges - and cost billions.\n\nThe Republican presidential candidate wrongly said AI was used on a photo showing thousands at a Harris rally in Detroit, BBC Verify reports. \n\nKamala Harris' running mate taught high school, and those he taught say he was \"a gifted educator\".\n\nA shake up for the Democrats has led to an attention deficit for Trump - an unusual position for the ex-president, writes the BBC's Katty Kay.\n\nThe mass deportation of undocumented immigrants would face legal and practical challenges - and cost billions.\n\nThe two businessmen have sparred in the past - but in this election seem firmly on the same side.\n\nSome political experts say calling Trump “weird” effectively repackages President Biden’s “threat to democracy” theme with a light touch.\n\nWeak jobs figures have spooked stock markets but does this mean a downturn is on the way?\n\nThe Republican presidential candidate wrongly said AI was used on a photo showing thousands at a Harris rally in Detroit, BBC Verify reports. \n\nThe BBC spoke to Democratic voters about Kamala Harris's choice of running-mate.\n\nLiberal voters - and one Republican sceptical of Trump - react to Biden's decision to endorse Harris.\n\nWe spoke with voters about Trump's selection of Vance as his running mate. \n\nWe asked Democratic voters if they thought Joe Biden should be replaced and by whom. \n\nWe asked voters across the political spectrum what they thought of 2024's first presidential debate.\n\nThe TV star's unannounced speech hit back at Republican jibes at \"childless cat ladies\".\n\nThe running mate of Kamala Harris told the Democratic convention that voters should back \"the right team\" and \"turn the page on Donald Trump\".\n\nTim Walz said it was the honour of his life to be selected as Kamala Harris's running mate, as he addressed crowds at the DNC.\n\nOprah Winfrey spoke about racism, sexism, and income inequality as she addressed the DNC.\n\nDemocrats used the convention to try to flip the script on Republican criticism of their immigration policies.\n\nFormer President Bill Clinton criticised Kamala Harris's rival as he took to the stage at the DNC.\n\nTrump was in North Carolina, at his first outdoor rally since an attempted assassination.\n\nThe Obamas opted to use jokes, not dark and ominous warnings, in their takedown of the Republican candidate.\n\nIndependent says he will address nation about his campaign as Trump says he would welcome his support.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "US & Canada",
        "link": "https://www.bbc.com/news/us-canada",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nThe running mate of Kamala Harris told the Democratic convention that voters should back \"the right team\" and \"turn the page on Donald Trump\".\n\nThe TV star's unannounced speech hit back at Republican jibes at \"childless cat ladies\".\n\nTrump was in North Carolina, at his first outdoor rally since an attempted assassination.\n\nAs a labour dispute rages on, businesses warn of a \"devastating impact\" on goods from beans to timber.\n\nThe ex-Las Vegas public administrator denies stabbing a journalist who had written negative stories about him.\n\nThe TV star's unannounced speech hit back at Republican jibes at \"childless cat ladies\".\n\nTim Walz said it was the honour of his life to be selected as Kamala Harris's running mate, as he addressed crowds at the DNC.\n\nDemocrats used the convention to try to flip the script on Republican criticism of their immigration policies.\n\nTrump was in North Carolina, at his first outdoor rally since an attempted assassination.\n\nIndependent says he will address nation about his campaign as Trump says he would welcome his support.\n\nThe couple lauded Kamala Harris but urged their party members to \"get to work\" if they wanted to defeat Donald Trump. \n\nThe US says jobs growth was weaker than previously estimated. So how worried should we be?\n\nThe rate of unruly passengers has dropped by over 80% since peaking in early 2021. \n\n\nTim Walz accepts his VP nomination, Bill Clinton pokes fun at Trump and Oprah makes a surprise appearance.\n\n\nOprah Winfrey spoke about racism, sexism, and income inequality as she addressed the DNC.\n\nHer Gen Z supporters say the economy, abortion rights and a Gaza ceasefire are among their priorities.\n\nThe Obamas capitivated the crowd in Chicago as Michelle told supporters \"hope is making a comeback\".\n\nFormer First Lady Michelle Obama got a lengthy standing ovation as she told delegates she thought \"something magical was in the air\".\n\nThe former president and first lady aim jokes at Donald Trump - and rapper Lil Jon gets delegates on their feet.\n\nBBC Verify examined claims made by Harris, about her record and Trump's on the economy, abortion and immigration.\n\nTwo decades after they first met, he will use his convention speech to try to propel her to the White House.\n\nThe former Los Angeles entertainment lawyer could make his own history if his wife, Kamala Harris, is elected president in November. \n\nThe president lauded Kamala Harris and said he gave his \"heart and soul to this nation”.\n\nAs a labour dispute rages on, businesses warn of a \"devastating impact\" on goods from beans to timber.\n\nThe running mate of Kamala Harris told the Democratic convention that voters should back \"the right team\" and \"turn the page on Donald Trump\".\n\n\nTim Walz accepts his VP nomination, Bill Clinton pokes fun at Trump and Oprah makes a surprise appearance.\n\n\nTim Walz said it was the honour of his life to be selected as Kamala Harris's running mate, as he addressed crowds at the DNC.\n\nOprah Winfrey spoke about racism, sexism, and income inequality as she addressed the DNC.\n\nDemocrats used the convention to try to flip the script on Republican criticism of their immigration policies.\n\nThe ex-Las Vegas public administrator denies stabbing a journalist who had written negative stories about him.\n\nFormer President Bill Clinton criticised Kamala Harris's rival as he took to the stage at the DNC.\n\nTrump was in North Carolina, at his first outdoor rally since an attempted assassination.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "UK",
        "link": "https://www.bbc.com/news/uk",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nOur panel of experts are answering your questions after GCSE, BTec Tech Awards and other Level 2 results are released in England, Wales and NI.\n\nFirms across the supply chain to the oil and gas industry have warned that official plans threaten investment.\n\nStrong winds and heavy rain set to hit the UK on Friday morning which could cause some disruption\n\nPolice \"urgently\" want to trace Eddie Hampshire over the death of Claudiu-Carol Kondor in Leeds.\n\nThe decline comes after the former Conservative government introduced restrictions on foreign workers and their families in an effort to slash overall immigration.\n\nFirms across the supply chain to the oil and gas industry have warned that official plans threaten investment.\n\nHealth assessment body NICE says the benefits “are too small to justify the costs”.\n\nReport finds officers are having to cancel appointments with victims and delay making arrests.\n\nStrong winds and heavy rain set to hit the UK on Friday morning which could cause some disruption\n\nA hearing at Colchester Magistrates' Court is told the dogs were called Beauty and Bear.\n\nVisitors would be charged an additional 5% on top of their hotel bill to stay in the city if plans are approved. \n\nThe 1912 newspaper shows two women in Southampton waiting for a list of survivors to be posted.\n\nThe number of new claims rose in April, after a rule change on how much parents can earn and still be eligible.\n\nThe public will vote for which of the trees will become the UK's favourite.\n\nThe GCSE pass rate is down for the third year running across England, Wales and Northern Ireland.\n\nThe self-named Brickie Boys want to show young people they can be a success without the grades.\n\nThe 9-1 grading system for GCSEs began in 2017 in England.\n\nBBC journalist Terel Edmunds goes through the options available if your GCSEs didn't go as planned.\n\nMatch of the Day presenter Gary Lineker speaks to BBC Breakfast's John Watson as the flagship football show celebrates its 60th birthday.\nLineker has been presenting the show for 25 years since 1999.\n\nVideo released by the National Crime Agency shows two men leaping off a boat whilst being pursed by UK Border Force.\n\nEngland make a strong start to life under Ollie Pope’s temporary captaincy, bowling out Sri Lanka for 236 on the first day of the first Test at Emirates Old Trafford.\n\nLondoners are surprised when a German Navy ship blasts out the music from the Star Wars trilogies.\n\nA group of young martial artists from Rochdale are celebrating after a pan-European tournament.\n\nNew play Shifters tells the story of two young black people who meet again after years apart.\n\nLearn more about some of the British athletes hoping to impress at the Paris Paralympic Games.\n\nThe GCSE pass rate is down for the third year running across England, Wales and Northern Ireland.\n\nThe self-named Brickie Boys want to show young people they can be a success without the grades.\n\nKeziah Hall was forced out her home of 16 years and spent a year trying to find a new place to live.\n\nThe decline comes after the former Conservative government introduced restrictions on foreign workers and their families in an effort to slash overall immigration.\n\nReport finds officers are having to cancel appointments with victims and delay making arrests.\n\nThe public will vote for which of the trees will become the UK's favourite.\n\nLuke Moran's assault left an officer fearing for their life as he tried to smash a van window during the Southport riots.\n\nKeir Starmer has said the UK will \"smash the gangs\" bringing people to the UK in small boats.\n\nMalignant skin cancer makes up about 40% of all cases in Jersey and Guernsey, data shows.\n\nPolice tell the BBC the man is suspected of cyber terrorism.\n\nThe family of the student killed in the Nottingham attacks make a first donation in his memory.\n\nSeveral men who participated in a riot in Rotherham outside a hotel were also given lengthy prison sentences.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "UK Politics",
        "link": "https://www.bbc.com/news/politics",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nThe decline comes after the former Conservative government introduced restrictions on foreign workers and their families in an effort to slash overall immigration.\n\nThe transport secretary says local communities should have the power to decide on road calming schemes.\n\nThe Home Office says it will also deploy 100 intelligence officers to tackle people-smuggling gangs.\n\nThe Conservatives have accused the new government of undermining the civil service's impartiality.\n\nBorrowing hit £3.1bn last month, the highest level for July since 2021, official figures show.\n\nThe transport secretary says local communities should have the power to decide on road calming schemes.\n\nFirms across the supply chain to the oil and gas industry have warned that official plans threaten investment.\n\nThe number of new claims rose in April, after a rule change on how much parents can earn and still be eligible.\n\nThe Home Office says it will also deploy 100 intelligence officers to tackle people-smuggling gangs.\n\nThe outgoing Scottish Conservative leader has accused some MSPs of regularly briefing against him.\n\nJane Hutt says scrapping universal pensioner winter fuel payments risks pushing some into poverty.\n\nThe appeal for more funding was criticised by the top civil servant at the Department of Justice.\n\nEmergency measures in response to prison overcrowding were triggered on Monday.\n\nIn response to calls for his suspension from the Labour Party, Clive Lewis MP says it is \"wrong\" to \"silence\" politicians.\n\nTravellers will have to pay €7 for a visa waiver every three years or until their passport expires.\n\nKeir Starmer has said the UK will \"smash the gangs\" bringing people to the UK in small boats.\n\nNo single group owned or organised the recent riots - they were bigger than that, says Daniel De Simone.\n\nThe government is facing calls to reverse changes making it harder for Ukrainians to bring family to the UK.\n\nSomerset Council is opening its own children's homes to avoid relying on private providers.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "England",
        "link": "https://www.bbc.com/news/england",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nClaudiu-Carol Kondor was a \"beloved colleague and confidant\", his company says.\n\nA hearing at Colchester Magistrates' Court is told the dogs were called Beauty and Bear.\n\nOur panel of experts are answering your questions after GCSE, BTec Tech Awards and other Level 2 results are released in England, Wales and NI.\n\nTharel Thompson sustained life-changing injuries in an attack in the Walkabout Bar in Reading.\n\nDerbyshire County Council said it had been \"moved\" by personal stories about the love locks.\n\nA hearing at Colchester Magistrates' Court is told the dogs were called Beauty and Bear.\n\nJordan Wilkes, who is 28 and from Christchurch, is charged with attempted murder.\n\nKeziah Hall was forced out her home of 16 years and spent a year trying to find a new place to live.\n\nOur panel of experts are answering your questions after GCSE, BTec Tech Awards and other Level 2 results are released in England, Wales and NI.\n\nLeah Senior, 27, died after she was seen falling from a van in Wakefield in January. \n\nOutline planning permission for 250 homes in Lawley West is due to be submitted in the autumn.\n\nPolice say 20-year-old Shekhem Manning-Egeonwon's actions were \"menacing and highly intrusive\".\n\nA 17-year-old is arrested after a woman reportedly escaped from a car and pleaded for help.\n\nFormer teacher Heather Monaghan has just completed the first year of a college course in her 80s.\n\nThe 1912 newspaper shows two women in Southampton waiting for a list of survivors to be posted.\n\nThe public will vote for which of the trees will become the UK's favourite.\n\nThe self-named Brickie Boys want to show young people they can be a success without the grades.\n\nThe family of swimmer Olivia Newman-Baronius, 17, from Bedfordshire, say her achievements \"blow their minds\".\n\nNaomi Dalby says her deaf clients regularly travel to be inked by her.\n\nThe Bedfordshire zoo uses the animals' favourite foods to get them involved.\n\nGuidance from Newcastle University suggests using the term could be patronising.\n\nVideo released by the National Crime Agency shows two men leaping off a boat whilst being pursed by UK Border Force.\n\nLondoners are surprised when a German Navy ship blasts out the music from the Star Wars trilogies.\n\nFollow live text, in-play video clips and radio commentary as England host Sri Lanka in the first Test at Old Trafford.\n\nListen to live BBC radio commentaries and follow live text coverage of day one of the County Championship.\n\nEngland and Manchester City defender Kyle Walker says the tough love of his father made him an elite player.\n\nOlympic 800m champion Keely Hodgkinson will miss the rest of the 2024 athletics season because of injury.\n\nLearn more about some of the British athletes hoping to impress at the Paris Paralympic Games.\n\nCampaigners say trams could serve heavily populated areas which are not part of the Metro system.\n\nPolice say 20-year-old Shekhem Manning-Egeonwon's actions were \"menacing and highly intrusive\".\n\nBetty Everest's son says she analysed signals intercepted between countries during World War Two.\n\nTVP released the most recent report earlier this month after the first was published in the spring.\n\nThere are signs of recovery at Dunwich Heath following the damage caused by the 2022 heatwave.\n\nPeople can surrender the weapons to certain police stations in return for compensation.\n\nDorset and Wiltshire Fire and Rescue Service is facing \"significant financial challenges\".\n\nThe 1912 newspaper shows two women in Southampton waiting for a list of survivors to be posted.\n\nThe latest weather forecast for the East of England from BBC Look East.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "N. Ireland",
        "link": "https://www.bbc.com/news/northern_ireland",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nAs with A-level, the percentage of people receiving top GCSE grades in Northern Ireland in 2024 has fallen.\n\nThree RUC officers in an unmarked police car were killed in the blast at Kinnego Embankment.\n\nOur panel of experts are answering your questions after GCSE, BTec Tech Awards and other Level 2 results are released in England, Wales and NI.\n\nAlmost 900 government files from the Assembly's early years have been released into the public domain.\n\nBBC Northern Ireland announces its upcoming season of new commissions.\n\nThree RUC officers in an unmarked police car were killed in the blast at Kinnego Embankment.\n\nThe appeal for more funding was criticised by the top civil servant at the Department of Justice.\n\nOur panel of experts are answering your questions after GCSE, BTec Tech Awards and other Level 2 results are released in England, Wales and NI.\n\nElkstone wants to construct an 870-bedroom scheme but residents have raised concerns.\n\nAbjan Acharya, who only took over the restaurant a few months ago, says he is going to have close down after the building was set alight.\n\nJoe McCrisken had been in charge of the pre-inquest proceedings over the past number of years.\n\nAlex Ryzhuk, who is 20 years old and from Dublin, is presumed dead.\n\nBusinessman Alexander E Orr, who helped finance and arrange construction of the system, gets a blue plaque.\n\nThe GCSE pass rate is down for the third year running across England, Wales and Northern Ireland.\n\nApples, cathedrals and museums remain the main draw for tourists to the Orchard County.\n\nSurvivors of institutions for unmarried mothers hit out at plans to limit a compensation scheme.\n\nThe algae has been confirmed at the Barmouth between Portstewart and Castlerock.\n\n\n\nThe weather forecast in Northern Ireland.\n\nThe 500kg bomb was detonated in a controlled explosion after hundreds of homes were evacuated.\n\nSome councils haven not raised off-street car park prices since April 2015.\n\n\nThe World War Two bomb was detonated in a controlled explosion on Tuesday afernoon.\n\n'All of a sudden people have become bomb disposal experts overnight' after residents were told to evacuate their homes.\n\nBorn in Derry, McCafferty wrote several books and campaigned for legalising contraception.\n\nNeighbours say sales have fallen through multiple times because of a dispute over sewers and roads.\n\nDerry City's League of Ireland title bid will be boosted by the arrival of former Liverpool defender Andre Wisdom at the Brandywell.\n\nShane Frane killed PC Philippa Reynolds in Derry in 2013 when a stolen car crashed into a police car.\n\nThe men are accused of threatening and abusive behaviour during morning mass in Donegal\n\nThe incident happened on Thursday evening at Renmore Barracks in County Galway.\n\nAbout 75,000 people are in County Laois for Ireland's biggest annual festival.\n\nKylie, Calvin Harris, Gerry Cinnamon, Nas and Tom Grennan are among the acts at Ireland's biggest music festival.\n\nThe single-vehicle crash happened at Burnfoot, County Donegal, on Thursday night.\n\nAs with A-level, the percentage of people receiving top GCSE grades in Northern Ireland in 2024 has fallen.\n\nThe appeal for more funding was criticised by the top civil servant at the Department of Justice.\n\nElkstone wants to construct an 870-bedroom scheme but residents have raised concerns.\n\nThree RUC officers in an unmarked police car were killed in the blast at Kinnego Embankment.\n\nThe weather forecast in Northern Ireland.\n\nBBC Northern Ireland announces its upcoming season of new commissions.\n\nAbjan Acharya, who only took over the restaurant a few months ago, says he is going to have close down after the building was set alight.\n\nIrish police arrest a man in his 60s who is wanted in connection with an explosion which killed three RUC officers.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "N. Ireland Politics",
        "link": "https://www.bbc.com/news/northern_ireland/northern_ireland_politics",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nAlmost 900 government files from the Assembly's early years have been released into the public domain.\n\nMr Beattie said it \"would simply not be credible, or right, for me to put my name forward\".\n\nA senior party colleague says Mr Beattie's decision to quit came as a shock.\n\nBBC News NI's political correspondent Gareth Gordon says internal divisions have been exposed again.\n\nHe was speaking on the BBC Red Lines podcast for an in-depth interview about his political career. \n\nMr Beattie said it \"would simply not be credible, or right, for me to put my name forward\".\n\nMr McNulty had the whip suspended after leaving an assembly sitting early for a GAA game.\n\nThe UUP says an extraordinary meeting will be held on 14 September to ratify or elect the new leader.\n\nA senior party colleague says Mr Beattie's decision to quit came as a shock.\n\nA planned £300m redevelopment of the site has been in limbo for 11 years after a political row.\n\nSince the weekend, there have been consecutive nights of violence in parts of Belfast.\n\nThe Stormont Assembly is recalled from its summer recess in the wake of violent disorder in Belfast.\n\nThe deputy first minister says she wants to send a strong message against racism.\n\nThe first and deputy first ministers say no one should live in fear after disorder following an anti-immigration protest.\n\nShe says discussions were against the backdrop of the partnership between the SDLP and Fianna Fáil. \n\n\nA government minister says when negotiating with the EU he intends to have Northern Ireland at the forefront.\n\nNI Secretary Hilary Benn held talks with Tánaiste Micheál Martin at Hillsborough Castle.\n\nJustice Minister Naomi Long says a further 75 Prison Service staff will be recruited at an annual cost of £3.5m.\n\nThe loss-making shipbuilder had applied for a loan guarantee of up to £200m.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Scotland",
        "link": "https://www.bbc.com/news/scotland",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nVisitors would be charged an additional 5% on top of their hotel bill to stay in the city if plans are approved. \n\nThe three candidates left in the race are Murdo Fraser, Meghan Gallacher and Russell Findlay.\n\nThe award-winning star of spy drama Slow Horses is heading back to the stage for his much-anticipated latest project.\n\nHighland Council says park revamps and costs means the Red Hot Highland Fling cannot go ahead.\n\nThe trees - in the Highlands, Midlothian and Scottish Borders - are each at least 1,000-years-old.\n\nThe three candidates left in the race are Murdo Fraser, Meghan Gallacher and Russell Findlay.\n\nMarie McDowall has been displaced from her home for nearly three years following a devastating gas blast.\n\nHouseholds who rent from private sector landlords rise by almost 10% in a decade.\n\nThe award-winning star of spy drama Slow Horses is heading back to the stage for his much-anticipated latest project.\n\nReports suggest Emma Ramsay, 19, died after an accident at her hotel on the Mediterranean island on Tuesday morning.\n\nA student has died in a fall from a balcony in Ibiza and teacher cuts could affect the \"poorest children\" in today's papers.\n\nAllan Lipp and Mhairi Ross have about 220 miles left of their 2,302-mile journey to complete.\n\nSince Yesterday will receive its world premiere as the closing gala at the Edinburgh International Film Festival.\n\nFirms across the supply chain to the oil and gas industry have warned that official plans threaten investment.\n\nBBC Scotland's Lynsey Bews considers the political fallout of the Scottish government's meeting with Israel's ambassador to the UK. \n\nThe 34-year-old, who told her story to BBC News last year, was found dead in a flat in Glasgow in March.\n\nGrant Anderson has never ventured very far since 2020 for fear of missing out on a transplant.\n\nA nautical one-liner has been named the funniest gag at the Fringe after being chosen from a shortlist by members of the public.\n\nA selection of photographs submitted to BBC Scotland News from around the country this week.\n\nAs the award-winning star of spy drama Slow Horses heads back to the stage, he explains why he feels the arts are \"a necessity\".\n\nAlmost three years ago, an explosion ripped through Gorse Park in Kincaidston, near Ayr.\n\nA primary school on Orkney is starting its new P1 class with and intake of only boys.\n\nThe Whaligoe steps and harbour on the Caithness coast have a fascinating history and are an intriguing visitor attraction.\n\nRobotic \"coaches\" programmed to guide stroke patients through rehabilitation exercises could soon be tested in Scotland.\n\nVisitors would be charged an additional 5% on top of their hotel bill to stay in the city if plans are approved. \n\nHighland Council says park revamps and costs means the Red Hot Highland Fling cannot go ahead.\n\nFirms across the supply chain to the oil and gas industry have warned that official plans threaten investment.\n\nThe award-winning star of spy drama Slow Horses is heading back to the stage for his much-anticipated latest project.\n\nThe largest Scottish freshwater pearl found in living memory was expected to fetch between £40,000 and £60,000.\n\nFollow live BBC Radio 5 Live golf commentary of the first round of the Women's Open at St Andrews.\n\nCeltic would be unlikely to block a deal for Kyogo if Manchester City bid more than £20m for the Japan striker.\n\nAC Milan captain Christy Grimshaw says players \"now don't have to make a choice\" between being a mother or a footballer after the club's new maternity policy.\n\nHouseholds who rent from private sector landlords rise by almost 10% in a decade.\n\nAs the award-winning star of spy drama Slow Horses heads back to the stage, he explains why he feels the arts are \"a necessity\".\n\nA student has died in a fall from a balcony in Ibiza and teacher cuts could affect the \"poorest children\" in today's papers.\n\nA selection of photographs submitted to BBC Scotland News from around the country this week.\n\nSince Yesterday will receive its world premiere as the closing gala at the Edinburgh International Film Festival.\n\nThe trees - in the Highlands, Midlothian and Scottish Borders - are each at least 1,000-years-old.\n\nA review found Lochgelly High School was wrongly named the winner in a junior category at the championships in Glasgow.\n\nThe Scottish government is warned of a \"crisis\" including museum and gallery closures if funding promises are not kept.\n\nSome grants were distributed despite ongoing police investigations and workers having been recognised as victims of trafficking.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Scotland Politics",
        "link": "https://www.bbc.com/news/scotland/scotland_politics",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nThe three candidates left in the race are Murdo Fraser, Meghan Gallacher and Russell Findlay.\n\nThe outgoing Scottish Conservative leader has accused some MSPs of regularly briefing against him.\n\nThe cabinet secretary has come under fire from SNP colleagues over talks with the deputy ambassador.\n\nBBC Scotland's Lynsey Bews considers the political fallout of the Scottish government's meeting with Israel's ambassador to the UK. \n\nChristina McKelvie, the Scottish drugs and alcohol policy minister, is undergoing treatment for secondary breast cancer.\n\nThe outgoing Scottish Conservative leader has accused some MSPs of regularly briefing against him.\n\nThe justice secretary said in June she would write to those affected.\n\nBrian Whittle confirms he has dropped out of the six-way contest to replace Douglas Ross.\n\nThe cabinet secretary has come under fire from SNP colleagues over talks with the deputy ambassador.\n\nThe government had planned a nationwide pilot for asylum seekers who cannot work under UK immigration rules.\n\nThe outspoken backbench MSP has been urged by a minister to  \"educate himself\" about the Gaza conflict.\n\nFinance Secretary Shona Robison says spending constraints are the only option available to her in the current climate.\n\nIs the move to restrict winter fuel payments the end of an era of universal entitlements in Scotland?\n\nParty leader Douglas Ross is reported to have said last year that he should be replaced by candidate Russell Findlay.\n\nThe gap between what people earn and the average cost of a home has grown substantially over the past 20 years.\n\nScottish Labour leader Anas Sarwar has called for the prime minister to scrap the limit. \n\nScottish ministers are considering plans to build a new power station using carbon capture and storage technology. \n\nAs rail unions threaten industrial action, refuse staff and teachers are also unhappy with pay offers.\n\nAn ex-SNP deputy leader describes John Swinney's leadership as \"a busted flush\" and Nicola Sturgeon as \"Stalin's wee sister\".\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Wales",
        "link": "https://www.bbc.com/news/wales",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nMabli Cariad Hall died in hospital four days after the crash outside Withybush Hospital.\n\nResults are slightly below pre-Covid levels as GCSEs get back to normal.\n\nOur panel of experts are answering your questions after GCSE, BTec Tech Awards and other Level 2 results are released in England, Wales and NI.\n\nEnergy bill rises and cuts in winter fuel payments leave some pensioners \"frightened\" about winter.\n\nThe card was addressed to a Miss Lydia Davies, who lived at the address when it was sent in 1903.\n\nResults are slightly below pre-Covid levels as GCSEs get back to normal.\n\nScott James left college after three months, but soon found his entrepreneurial passion for coffee.\n\nActor, singer and TV presenter Dewi \"Pws\" Morris - best known for rugby film Grand Slam - dies 76.\n\nOur panel of experts are answering your questions after GCSE, BTec Tech Awards and other Level 2 results are released in England, Wales and NI.\n\nOne of the men wrongly accused of the murder says the real killer's parole hearing should be public.\n\nJane Hutt says scrapping universal pensioner winter fuel payments risks pushing some into poverty.\n\nThose giving up zombie-style knives and machetes are entitled to £10 per weapon.\n\nA group representing care homes in Wales says more could shut after changes to immigration rules.\n\nA shirt thought to be one of the first in red for Wales went missing from a collection in the 1980s\n\nThe Veterans World Cup arrives in Cardiff, with footballers from across the globe playing a part.\n\nJude Wall has been photographing and taking samples from sites where women's bodies were left.\n\nA growing flood of visitors to a national park are urged to research and respect the area.\n\nLouis Rees-Zammit, the former Wales rugby star, made a second appearance for the Kansas City Chiefs on Saturday.\n\nScott Mills and his husband Sam Vaughan got married after filming Celebrity Race Across the World.\n\nBBC journalist Terel Edmunds goes through the options available if your GCSEs didn't go as planned.\n\nWatch as firefighters tackle a huge fire that ripped through a car dealership on Friday night. \n\nA company director and his partner allegedly used \"power tools and crowbars\" to destroy the blooms.\n\nCCTV captures the moment a van crashed into the walls of a road tunnel after the driver collapsed.\n\nAshes continue to smoulder on an industrial estate after a large fire destroys a car dealership. \n\nSwansea City are being heavily linked with Florian Bianchini after Luke Williams revealed the club will sign a centre-back and a winger before Sunday’s south Wales derby against Cardiff City.\n\nBBC Sport will have exclusive rights to broadcast every game of the 2025 Women’s Rugby World Cup in England.\n\nListen to live BBC radio commentaries and follow live text coverage of day one of the County Championship.\n\nThe New Saints will be looking to take a huge step towards becoming the first domestic Welsh club to reach the group stages of a European club competition.\n\nWest Indies and South Africa will both face England Men at Cardiff's Sophia Gardens in 2025.\n\nCofio'r cerddor, actor a'r digrifwr amryddawn Dewi Pws Morris, sydd wedi marw yn 76 oed.\n\nBydd disgyblion Cymru'n derbyn eu canlyniadau fore Iau, gyda'r patrwm arholi wedi dychwelyd i fel oedd hi yn 2019.\n\nPobl yn bryderus yn sgil y disgwyl y bydd biliau ynni’n codi ar gyfer tri mis olaf y flwyddyn.\n\nYr awdur Mike Parker sydd wedi dewis pump o lefydd Cymreig yr ochr draw i Glawdd Offa.\n\nHanes yr Orsedd, un o rannau mwyaf lliwgar yr Eisteddfod Genedlaethol.\n\nActor, singer and TV presenter Dewi \"Pws\" Morris - best known for rugby film Grand Slam - dies 76.\n\nResults are slightly below pre-Covid levels as GCSEs get back to normal.\n\nMabli Cariad Hall died in hospital four days after the crash outside Withybush Hospital.\n\nScott James left college after three months, but soon found his entrepreneurial passion for coffee.\n\nBBC journalist Terel Edmunds goes through the options available if your GCSEs didn't go as planned.\n\nThe card was addressed to a Miss Lydia Davies, who lived at the address when it was sent in 1903.\n\nOne of the men wrongly accused of the murder says the real killer's parole hearing should be public.\n\nThose giving up zombie-style knives and machetes are entitled to £10 per weapon.\n\nJane Hutt says scrapping universal pensioner winter fuel payments risks pushing some into poverty.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Wales Politics",
        "link": "https://www.bbc.com/news/wales/wales_politics",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nResults are slightly below pre-Covid levels as GCSEs get back to normal.\n\nOur panel of experts are answering your questions after GCSE, BTec Tech Awards and other Level 2 results are released in England, Wales and NI.\n\nChanges at Pembroke Port are part of plans to attract energy firms and create up to 1,800 new jobs.\n\nKeir Starmer denies giving workers \"false hope\" before closure of last Port Talbot blast furnace.\n\nPolitical editor Gareth Lewis looks at the issues facing Eluned Morgan and Sir Keir Starmer.\n\nOur panel of experts are answering your questions after GCSE, BTec Tech Awards and other Level 2 results are released in England, Wales and NI.\n\nJane Hutt says scrapping universal pensioner winter fuel payments risks pushing some into poverty.\n\nA group representing care homes in Wales says more could shut after changes to immigration rules.\n\nChanges at Pembroke Port are part of plans to attract energy firms and create up to 1,800 new jobs.\n\nConservative big beasts compete with the more traditional animals at the Haverfordwest showground.\n\nAs protests against uncontrolled tourism hit Spain and Italy there are fears Wales could be at risk of \"over-tourism\".\n\nEluned Morgan says she wants to inspire women after becoming first female first minister of Wales.\n\nThe first female leader of Wales says she will \"go out and listen to what the people want\".\n\nVaughan Gething wanted to offer Welsh Labour a fresh start, but never even had a honeymoon period.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Africa",
        "link": "https://www.bbc.com/news/world/africa",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nWilliam Smith, hailed for being a maths and science education innovator, has died aged 85.\n\nA 2,492-carat stone has been unearthed, in the biggest find since the Cullinan diamond in 1905. \n\nHumans could be at risk following the discovery of contaminated maize batches, health minister says.\n\nNigerians say the timing is wrong considering the country is facing its worst economic crisis in decades.\n\nCharlie the elephant has been in captivity since 1984, when he was captured at two years old.\n\nA 2,492-carat stone has been unearthed, in the biggest find since the Cullinan diamond in 1905. \n\nWhile Lesotho sells water to South Africa some near a huge dam have to use an unreliable spring. \n\nAs a global emergency is declared over mpox, our health and science correspondent assesses the threat.\n\nHumans could be at risk following the discovery of contaminated maize batches, health minister says.\n\nThousands of Africans employed as domestic workers are fearing what could happen if war breaks out.\n\nMia Couto grew up in Mozambique during the colonial era, and joined its struggle for independence. \n\nLiya’u Sa’adu cannot afford to rent a shack, let alone a room - like some 500,000 others in Nigeria’s main city.\n\nNineteen years and 10 miles separated Zambia's football team from a lost, golden generation on a fateful night in Libreville.\n\nA selection of the week's best photos from across the African continent.\n\nMpox, which used to be called monkeypox, is declared a global public health emergency.\n\nLocal authorities are seeking to build a seawall to prevent further intrusion of the ocean to the village. \n\nKyiv's hand in aiding rebels in Mali against Russian mercenaries may scupper its Africa diplomacy.\n\nNigeria are narrowing down their options in the hunt for a new manager, with Herve Renard still a contender to replace Finidi George.\n\nHusnah Kukundakwe made history at the Tokyo Paralympic Games as the youngest competitor, age 14. Now the Ugandan Para-swimmer is aiming to become her nation's first female Paralympic medallist.\n\nMeet Sly, a young BMXer in Lagos who is looking to outride the boys and turn professional.\n\nFollowing a heated build-up to their fight at UFC 305, Israel Adesanya and Dricus du Plessis agree that Africa was the real winner of the night after the pair settled their differences.\n\nAfrica secured a total of 39 medals at the Paris 2024 Olympics, but which countries were winners and losers?\n\nAhead of the new Premier League season, Arsenal have released a new kit celebrating the club's connection to Africa.\n\nRwanda’s only official parkour athlete, Niyonzima Alfred, on the dedication it takes to reach the top of the sport.\n\nThree essential stories to round off your working day. Explaining the news from Africa.\n\nOne question to wake up to every weekday morning. One story from Africa, for Africa\n\nA 2,492-carat stone has been unearthed, in the biggest find since the Cullinan diamond in 1905. \n\nWilliam Smith, hailed for being a maths and science education innovator, has died aged 85.\n\nWhile Lesotho sells water to South Africa some near a huge dam have to use an unreliable spring. \n\nCharlie the elephant has been in captivity since 1984, when he was captured at two years old.\n\nHumans could be at risk following the discovery of contaminated maize batches, health minister says.\n\nEight officers have been suspended after the 33-year-old escaped by scaling a wall, police say.\n\nNigerians say the timing is wrong considering the country is facing its worst economic crisis in decades.\n\nThe interim president says he wants to \"immerse\" politicians in the realities of ordinary people.\n\nPeter Mutharika is picked to run in next year's presidential election by the main opposition DPP.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Asia",
        "link": "https://www.bbc.com/news/world/asia",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nThe country's leaders want to reverse a constitutional court decision to open up elections to their rivals.\n\nAuthorities had initially installed the barrier after growing tired of visitors' bad behaviour.\n\nThe pilgrims had been on their way to Iraq to commemorate Arbaeen, one of the biggest events in the Shia calendar.\n\nEllen Rachel Craig was sentenced to nine years for beating the toddler to death for failing to do her chores.\n\nShakib, considered one of his country's greatest sportsmen, was cleared to play against Pakistan.\n\nAuthorities had initially installed the barrier after growing tired of visitors' bad behaviour.\n\nDang Tien Lam was found by locals who heard a child's cries while they were farming near the forest.\n\nSoaring prices have been a major concern for the country as its currency comes under pressure.\n\nThe pilgrims had been on their way to Iraq to commemorate Arbaeen, one of the biggest events in the Shia calendar.\n\nFormer deputy PM Prawit Wongsuwon hit the female reporter on the head while surrounded by media.\n\nFormer mayor Alice Guo left the country undetected last month, invoking the fury of President Ferdinand Marcos Jr.\n\nOfficials at the National Assembly tell the BBC the rats have been terrifying new starters.\n\nHundreds gathered to protest against the alleged sexual assault of two children in Maharashtra .\n\nThirty six flights were cancelled and 201 delayed on the weekend at one of Japan's busiest airports.\n\nParents of the doctor, who was raped and murdered, talk about their caring and affectionate daughter.\n\nClimate change is melting glaciers at unprecedented rates - and putting thousands in Nepal at risk.\n\nThe firm is deciding whether to remain in Japanese ownership or return to its Northern American roots.\n\nStanford University is fighting to keep the diaries, in a case framed as a battle against China's censorship.\n\nThe BBC has spoken to survivors to piece together the attack on civilians earlier this month.\n\nThe country's leaders want to reverse a constitutional court decision to open up elections to their rivals.\n\nAuthorities had initially installed the barrier after growing tired of visitors' bad behaviour.\n\nDang Tien Lam was found by locals who heard a child's cries while they were farming near the forest.\n\nYuanjun Tang, now an American citizen, is alleged to have spied on US-based Chinese democracy activists.\n\n\nMany countries have lifted bans on blood donations by LGBT people, but India hasn't yet.\n\nShakib, considered one of his country's greatest sportsmen, was cleared to play against Pakistan.\n\nFormer deputy PM Prawit Wongsuwon hit the female reporter on the head while surrounded by media.\n\nParents of the doctor, who was raped and murdered, talk about their caring and affectionate daughter.\n\nFormer mayor Alice Guo left the country undetected last month, invoking the fury of President Ferdinand Marcos Jr.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "China",
        "link": "https://www.bbc.com/news/world/asia/china",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nStanford University is fighting to keep the diaries, in a case framed as a battle against China's censorship.\n\nSocial media is full of congratulatory messages and red heart emojis for the city's beloved Ying Ying.\n\nRepublicans claim the Democratic VP candidate is a friend of the Chinese government. The reality is very different.\n\nThe team's medals were received with doubts from their peers from other countries at Paris 2024.\n\nIt comes five months after two Chinese fishermen died following a sea chase by Taiwan's coast guard.\n\nSocial media is full of congratulatory messages and red heart emojis for the city's beloved Ying Ying.\n\nChina wants people to report Taiwanese \"separatists\", with the threat of death penalties for some.\n\nMany are calling for better protection for gig workers, while the police have urged the public to be kind.\n\nBeijing says  \"aggressive fan culture\" affects atheletes' performance and mars the country's reputation.\n\nRepublicans claim the Democratic VP candidate is a friend of the Chinese government. The reality is very different.\n\nShanghai has seen a boom in cafes, with the government claiming it now has more than any other place in the world.\n\nA property crisis, local government debt, weak demand and unemployment are hurting China's economy.\n\nThe electric vehicle giant has been rapidly expanding manufacturing capacity outside its home country.\n\nCon men threaten to extradite their victims to China if they don’t pay “bail”.\n\nThe two superpowers are talking more often to avoid conflict, the US ambassador to China tells the BBC.\n\nYuanjun Tang, now an American citizen, is alleged to have spied on US-based Chinese democracy activists.\n\n\nStanford University is fighting to keep the diaries, in a case framed as a battle against China's censorship.\n\nThe vote will have major global implications, meaning many nations have an incentive to interfere.\n\nSocial media is full of congratulatory messages and red heart emojis for the city's beloved Ying Ying.\n\nChina wants people to report Taiwanese \"separatists\", with the threat of death penalties for some.\n\nTwo China-based tour operators say tourists will soon be allowed to visit Samjiyon city in the north.\n\nMany are calling for better protection for gig workers, while the police have urged the public to be kind.\n\nZeekr says its new batteries can be charged from 10% to 80% in 10 and a half minutes using its chargers.\n\nSgt Korbein Schultz was allegedly paid $42,000 in exchange for dozens of sensitive security data.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "India",
        "link": "https://www.bbc.com/news/world/asia/india",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nModi is visiting Ukraine just weeks after his Russia trip. Is it a balancing act or is there something more?\n\nMany countries have lifted bans on blood donations by LGBT people, but India hasn't yet.\n\nThe brutal rape and murder of a trainee doctor has sparked outrage in India.\n\n\nThe proportion of Hindus migrating from India is low compared to their share in the country's population.\n\nThe polls, being held after a decade, are the first since the region’s special status was revoked in 2019.\n\nMany countries have lifted bans on blood donations by LGBT people, but India hasn't yet.\n\nParents of the doctor, who was raped and murdered, talk about their caring and affectionate daughter.\n\nHundreds gathered to protest against the alleged sexual assault of two children in Maharashtra .\n\nThe brutal rape and murder of a trainee doctor has sparked outrage in India.\n\n\nThe most notable rise in cycling in India has occurred among rural schoolgirls, a study finds.\n\nA protester from the midnight march in Kolkata city tells the BBC why she participated.\n\nThe bridge is part of an all-weather rail project aimed at connecting Kashmir valley with the rest of India.\n\nThe rape and murder of a female doctor in India highlight the violence against healthcare workers.\n\nAn activist-investor has accused Sebi's chief of having links with offshore funds used by Adani group firms.\n\nA young woman was among thousands who took part in a march in India's West Bengal. This is what she saw.\n\nWomen led a march in West Bengal state after a female doctor's brutal rape and murder last week.\n\nNo-one was injured in the incident, which took place due to heavy rainfall.\n\nMany flights have been grounded, with huge queues and delays at airports all over the world.\n\nThe noise around the lavish wedding has drawn public fascination - and ire.\n\nModi is visiting Ukraine just weeks after his Russia trip. Is it a balancing act or is there something more?\n\nMany countries have lifted bans on blood donations by LGBT people, but India hasn't yet.\n\nParents of the doctor, who was raped and murdered, talk about their caring and affectionate daughter.\n\nHundreds gathered to protest against the alleged sexual assault of two children in Maharashtra .\n\nThe brutal rape and murder of a trainee doctor has sparked outrage in India.\n\n\nThe proportion of Hindus migrating from India is low compared to their share in the country's population.\n\nThe most notable rise in cycling in India has occurred among rural schoolgirls, a study finds.\n\nNon-essential services were halted for 24 hours in an escalated protest demanding greater protections.\n\nThe polls, being held after a decade, are the first since the region’s special status was revoked in 2019.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Australia",
        "link": "https://www.bbc.com/news/world/australia",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nSphen and his partner Magic shot to global stardom in 2018 when they fell in love at a Sydney aquarium.\n\nEllen Rachel Craig was sentenced to nine years for beating the toddler to death for failing to do her chores.\n\nPatrick Delaney tried to explain the context of an old photo that showed him \"demonstrating\" the gesture.\n\nThe Australian hip-hop community has been shaken by the reaction to Raygun's efforts in Paris.\n\nHorseracing great Black Caviar, who won a record 25 consecutive races and was affectionately known as the 'Wonder from Down Under', dies at the age of 17.\n\nEllen Rachel Craig was sentenced to nine years for beating the toddler to death for failing to do her chores.\n\nAn innovative research method helps discover sea lion behaviours and chart ocean habitats.\n\nTrack cyclist Matt Richardson, who won three medals for Australia at the Paris Olympics, switches nationality and will now represent Great Britain. \n\nPatrick Delaney tried to explain the context of an old photo that showed him \"demonstrating\" the gesture.\n\nLolita was allegedly taken from her home by a group of Saudi men after fleeing an abusive marriage.\n\nEven those who knew him best had no clue crocodile expert Adam Britton was torturing dozens of dogs to death.\n\nMary is a frail pensioner who is living out of her car after losing her rental property.\n\nMichelle Heyman's comeback has been called one of the greatest in Australian sporting history.\n\nA whistleblower vet alleges some dogs are being over-raced and euthanised without cause.\n\nThe supermoon - also a blue moon - doesn't actually turn blue but it glowed red in some places due to wildfire smoke.\n\nABC News Breakfast's Nate Byrne speaks with the BBC about how he handled the on-air moment.\n\nThe Australian b-girl said she \"gave her best\" during her performance at the Paris Olympics\n\nMany flights have been grounded, with huge queues and delays at airports all over the world.\n\nWikileaks founder Julian Assange has walked free from a US court after pleading guilty in a deal to end a years long legal battle.\n\nSphen and his partner Magic shot to global stardom in 2018 when they fell in love at a Sydney aquarium.\n\nEllen Rachel Craig was sentenced to nine years for beating the toddler to death for failing to do her chores.\n\nPatrick Delaney tried to explain the context of an old photo that showed him \"demonstrating\" the gesture.\n\nThe Australian hip-hop community has been shaken by the reaction to Raygun's efforts in Paris.\n\nTottenham sign Australia international Clare Hunt from Paris St-Germain on a three-year deal. \n\nThe Australian b-girl said she \"gave her best\" during her performance at the Paris Olympics\n\nJayson Gillham premiered a piece that was dedicated to the journalists of Gaza.\n\nMore than 100 candidates cannot run in New South Wales after the Liberal party misses a nomination deadline.\n\nABC News Breakfast's Nate Byrne speaks with the BBC about how he handled the on-air moment.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Europe",
        "link": "https://www.bbc.com/news/world/europe",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nAlmost 2,000 people have been convicted of collaborating with Russia under a new Ukrainian law.\n\nThe search is resuming for one person who's still missing after a luxury yacht sank in a storm off the coast of Sicily on Monday.\n\nThousands of Ukrainian refugees could be forced on to the streets or back to Ukraine.\n\nMore than 500 firefighters have been tackling the giant blaze at a fuel depot sparked by a Ukrainian attack.\n\nThe gunman is said to have shot the employees and then himself at a school in Sanski Most, north-western Bosnia.\n\nThe search is resuming for one person who's still missing after a luxury yacht sank in a storm off the coast of Sicily on Monday.\n\nThe US pop star cancelled three concerts in Austria after an alleged suicide attack plot was uncovered.\n\nThe internet personality and his brother have been remanded in custody as part of a probe into new allegations.\n\nThousands of Ukrainian refugees could be forced on to the streets or back to Ukraine.\n\nThe search is resuming for one person who's still missing after a luxury yacht sank in a storm off the coast of Sicily on Monday.\n\nDivers trained to work in small spaces are flown in but strong winds are making conditions harder.\n\nUkrainian forces continue their incursion into Russia's Kursk region, claiming destruction of a second bridge.\n\nThe 19-year-old describes his arrest, surviving Russian jail and being part of the recent prisoner swap.\n\nThe boy was attacked on a football pitch by a masked person with a sharp object, Spanish media report.\n\nSix people are still missing after the British-flagged superyacht Bayesian sank during freak weather.\n\nTravellers will have to pay €7 for a visa waiver every three years or until their passport expires.\n\nThe BBC's Steve Rosenberg in Aleksin meets Russians wondering how Ukraine's incursion could have happened.\n\nUkrainians say the foray into Kursk brings tactical advantages - and opens the door to ending the war.\n\nAs Russian forces make slow progress in eastern Ukraine, Ukraine's military stages a surprise cross-border attack.\n\nUK ambassador to Italy Edward Llewellyn says survivors described 'distressing' situation\n\nA helicopter and divers were deployed at the scene where a yacht sank, as rescue operations continue.\n\nThe supermoon - also a blue moon - doesn't actually turn blue but it glowed red in some places due to wildfire smoke.\n\nHomes shook and ash covered the roads after an earthquake caused the Shiveluch volcano to erupt.\n\nThe BBC's Steve Rosenberg in Aleksin meets Russians wondering how Ukraine's incursion could have happened.\n\nAlmost 2,000 people have been convicted of collaborating with Russia under a new Ukrainian law.\n\nMore than 500 firefighters have been tackling the giant blaze at a fuel depot sparked by a Ukrainian attack.\n\nAlex Ryzhuk, who is 20 years old and from Dublin, is presumed dead.\n\nThe internet personality and his brother have been remanded in custody as part of a probe into new allegations.\n\nSix people are still missing after the British-flagged superyacht Bayesian sank during freak weather.\n\nThe grim discoveries come two days after the Bayesian sank in a freak storm off  Sicily.\n\nTravellers will have to pay €7 for a visa waiver every three years or until their passport expires.\n\nThousands of Ukrainian refugees could be forced on to the streets or back to Ukraine.\n\nSadik Duraku, 54, was arrested on 17 April while travelling to visit relatives in Kosovo. \n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Latin America",
        "link": "https://www.bbc.com/news/world/latin_america",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nAna Carolina Guaita is the latest person to be detained in a post-election crackdown by authorities. \n\nSome 50,000 barrels of oil have leaked since the ship overturned off the Caribbean nation's coast in February.\n\nOpposition leader María Corina Machado joined thousands of demonstrators in the capital Caracas.\n\nNew Zealand thrash Argentina 42-10 to avenge the defeat by the Pumas in their opening match of the 2024 Rugby Championship.\n\nThe social media platform says its legal representative was threatened by a supreme court judge. \n\nSome 50,000 barrels of oil have leaked since the ship overturned off the Caribbean nation's coast in February.\n\nA Brazilian police investigation into allegations of domestic abuse by Manchester United winger Antony is closed, though prosecutors could still look the claims.\n\nThe United States is paying for flights taking US-bound migrants back to South America.\n\nOpposition leader María Corina Machado joined thousands of demonstrators in the capital Caracas.\n\nJuly's presidential election lacked \"basic transparency and integrity\", a UN panel of experts finds.\n\nPressure groups say there is a new pattern of more targeted arrests following the disputed election.\n\nAn election dismissed by independent observers as \"undemocratic\" has thrown Venezuela into turmoil.\n\nHundreds of demonstrators have been detained following Venezuela's disputed presidential election.\n\nUnder pressure to back up claims he won the election, President Maduro turns to the country's top court. \n\nA British-Mexican man arrested in Qatar has given his first interview since returning home.\n\nThe couple's South America visit was an attempt to still show their influence on the world stage.\n\nStudies show the hearts and brains of Bolivia's indigenous Tsimane people are the healthiest on the planet.\n\nThe mass deportation of undocumented immigrants would face legal and practical challenges - and cost billions.\n\nCritics call the vice-president a \"failed border tsar\" - but supporters say that was not her mission. \n\nThe supermoon - also a blue moon - doesn't actually turn blue but it glowed red in some places due to wildfire smoke.\n\nPrince Harry and his wife Meghan have been taking part in a series of events in Colombia.\n\nAll 61 people on board were killed when a Voepass plane came down in São Paulo state.\n\nVideos show opposition protesters in multiple locations taking to the streets.\n\n\nAna Carolina Guaita is the latest person to be detained in a post-election crackdown by authorities. \n\nSome 50,000 barrels of oil have leaked since the ship overturned off the Caribbean nation's coast in February.\n\nThe couple's South America visit was an attempt to still show their influence on the world stage.\n\nPrince Harry and his wife Meghan have been taking part in a series of events in Colombia.\n\nOpposition leader María Corina Machado joined thousands of demonstrators in the capital Caracas.\n\nStudies show the hearts and brains of Bolivia's indigenous Tsimane people are the healthiest on the planet.\n\nThe social media platform says its legal representative was threatened by a supreme court judge. \n\nProvides an overview of Venezuela, including key dates and facts about this South American country.\n\nThe Duke and Duchess of Sussex are visiting Colombia following an invitation from the vice-president.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Middle East",
        "link": "https://www.bbc.com/news/world/middle_east",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nThe US president stresses to Israel's PM the importance of removing “any remaining obstacles”.\n\nFears are growing that the cross-border hostilities could escalate into an all-out war.\n\nInbal Peri tells the BBC her father might be alive if Israel's PM had agreed to a Gaza ceasefire.\n\nA senior US official says Benjamin Netanyahu's reported comments are “not constructive to getting a ceasefire deal\".\n\nThe pilgrims had been on their way to Iraq to commemorate Arbaeen, one of the biggest events in the Shia calendar.\n\nFears are growing that the cross-border hostilities could escalate into an all-out war.\n\nThe Greek-flagged Sounion was hit by gunfire from small boats and three unidentified projectiles.\n\nAshraf El Attar's wife and six children were killed when an air strike destroyed their home in Deir al-Balah.\n\nInbal Peri tells the BBC her father might be alive if Israel's PM had agreed to a Gaza ceasefire.\n\nIsrael's military says it targeted a Hamas command and control centre inside the Gaza City school.\n\nThousands of Africans employed as domestic workers are fearing what could happen if war breaks out.\n\nFederal agencies say Iran was trying \"to stoke discord and undermine confidence in our democratic institutions\".\n\nA British-Mexican man arrested in Qatar has given his first interview since returning home.\n\nIsraeli security forces said Sunday's blast killed the suspected attacker and injured a passer-by.\n\nThe Saudi royal, who vows to modernise his country, has faced accusations of human rights violations.\n\nThe US believes a deal could help calm the Middle East, but do Israel and Hamas's leader want one?\n\nLocals in the capital Beirut tell the BBC their fears of another war between Israel and Hezbollah.\n\nMore than 600 Palestinians and at least 17 Israelis have been killed in the West Bank since October.\n\nKhaled's equestrian centre was destroyed by Israel after being built without a permit.\n\nThe supermoon - also a blue moon - doesn't actually turn blue but it glowed red in some places due to wildfire smoke.\n\nThe Hamas leader was killed in Tehran, after attending the inauguration of President Masoud Pezeshkian.\n\nSmoke seen rising from above the Lebanese capital, as building is damaged and crowds of people gathered outside.\n\nThousands of displaced Gazans return to the ruins of the southern city, after a week-long Israeli operation ends.\n\nThe BBC's Paul Adams visits the site where 12 people, mostly children, were killed in the Israeli-occupied Golan Heights.\n\nFears are growing that the cross-border hostilities could escalate into an all-out war.\n\nAshraf El Attar's wife and six children were killed when an air strike destroyed their home in Deir al-Balah.\n\nInbal Peri tells the BBC her father might be alive if Israel's PM had agreed to a Gaza ceasefire.\n\nIsrael's military says it targeted a Hamas command and control centre inside the Gaza City school.\n\nFive of their deaths had already been confirmed by Israel, though it was thought one could still be alive. \n\nIt is thought 116 Israelis and foreigners remain unaccounted for after the 7 October attacks.\n\nIsraeli security forces said Sunday's blast killed the suspected attacker and injured a passer-by.\n\nThe US, Qatar and Egypt say talks will resume in Cairo next week with the aim of agreeing a deal.\n\nThe Israeli prime minister says he views the incident with “utmost severity”.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "In Pictures",
        "link": "https://www.bbc.com/news/in_pictures",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nA nature reserve's photography club is holding its annual display at the end of August.\n\nSmoke from wildfires in north America has brought a \"vivid\" hue to skies above Britain ahead of a rare lunar phenomenon.\n\nThe Mangrove Photography Awards entries capture unique ecosystems above and below the waterline.\n\nA selection of eye-catching moments from the opening ceremony for the 2024 Olympic Games in Paris.\n\nA selection of the week's best photos from across the African continent.\n\nSmoke from wildfires in north America has brought a \"vivid\" hue to skies above Britain ahead of a rare lunar phenomenon.\n\nA selection of photos of the spectacular event from around the world.\n\nA selection of the week's best photos from across the African continent.\n\nThe Mangrove Photography Awards entries capture unique ecosystems above and below the waterline.\n\nQueen by Magnus Hastings is a \"one of a kind\" drag photography exhibition.\n\nDonald Trump rushed off stage during a rally in Butler, Pennsylvania after loud bangs were heard\n\nTwo early photographers, who took images of street life and political upheaval, honoured in London.\n\nMohamed Zakaria made the dangerous journey to flee the besieged city of el-Fasher.\n\nWaterlooville artist Caroline West says she has featured locations like Stonehenge on her bags.\n\nA selection of striking news photographs taken around the world this week.\n\nA selection of striking news photographs taken around the world this week.\n\nA selection of striking news photographs taken around the world this week.\n\nA selection of striking news photographs taken around the world this week.\n\nA selection of striking news photographs taken around the world this week.\n\nA selection of your pictures on the theme of 'in the kitchen'.\n\nA  selection of your pictures on the theme of 'time'.\n\nEach week, we ask you to send in your pictures on a set theme and a selection of these are then published each Thursday on our In pictures page\n\nA  selection of your pictures on the theme of 'shadows'.\n\nA selection of the photographs on a given theme.\n\nJames Barnor, who has photographed the likes of Muhammad Ali, is being honoured in Accra.\n\nAndy Bailey has been photographing bins in his Cheshire town, giving them a rating out of 25.\n\nMore than 1,000 images of the national park are being made available for use free of charge.\n\nJohn Hayward's pictures feature in a new version of A Shropshire Lad by A. E. Housman.\n\nWith her eye in the sky, Joanna Steidle captures images of the elusive creatures.\n\nA selection of striking news photographs taken around the world this week.\n\nShowcasing the best images sent to us from around Hampshire & Isle of Wight.\n\nA selection of your pictures on the theme of 'in the kitchen'.\n\nA selection of striking news photographs taken around the world this week.\n\nA selection of striking news photographs taken around the world this week.\n\nA selection of striking news photographs taken around the world this week.\n\nShowcasing the best images sent to us from around Hampshire & Isle of Wight.\n\nShowcasing the best images sent to us from around Hampshire & Isle of Wight.\n\nShowcasing the best images sent to us from around Dorset.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "BBC Verify",
        "link": "https://www.bbc.com/news/reality_check",
        "date": "No Date",
        "full_content": "Title: NewsNews\nPublished on: No Date\n\nArticle Content:\nBBC Verify examined claims made by Harris, about her record and Trump's on the economy, abortion and immigration.\n\nIt's been a week since the start of the country's largest and most significant incursion into Russia since the war began.\n\n Walz's military record has been under scrutiny after a series of claims made by veterans and leading Republicans.\n\nCrisis is unfolding in northern Ethiopia - driven by drought, crop failure and insecurity following war.\n\nThe former president's speech contained plenty of claims which BBC Verify has been checking.  \n\n\nIt's been a week since the start of the country's largest and most significant incursion into Russia since the war began.\n\nIn a two-hour discussion, Trump made a number of questionable and false claims  which went largely unchallenged. \n\nThe Republican presidential candidate wrongly said AI was used on a photo showing thousands at a Harris rally in Detroit, BBC Verify reports. \n\n Walz's military record has been under scrutiny after a series of claims made by veterans and leading Republicans.\n\nIt's been a week since the start of the country's largest and most significant incursion into Russia since the war began.\n\nBBC Verify's Richard Irvine-Brown analyses the footage from Manchester Airport's Terminal 2.\n\nFrench rail company SNCF said its high-speed network had been targeted by \"malicious acts\" aimed at paralysing the rail network.\n\nRos Atkins examines the evidence about crucial warnings in the minutes before the attack on Donald Trump.\n\nWatch BBC Verify's visual analysis of the strike which killed two adults and injured 300.\n\nThe Irish government claims over 80% of asylum seekers have crossed the border from Northern Ireland.\n\nSimeon Boikov sparked a social media frenzy implicating an innocent 20-year-old in the shopping mall attack.\n\nBBC Verify examines the evidence on combatant deaths, as concern grows about the scale of civilian killing.\n\nPresident Putin has said Western military advisers are actively involved in Ukraine.\n\nRussia called footage of bodies in Bucha 'staged' but its evidence for this does not stack up.\n\nThe target, set out in the 2024 Labour manifesto, is for 1.5 million new homes over the next parliament.\n\nWarnings for rain have been issued in the UK today and the details are on our weather app. Here's a guide how to get the most from it.\n\nThe prime minister said five priorities should be used to hold his government to account.\n\nVladimir Putin visits Beijing this week, as it faces accusations of supporting Moscow's war in Ukraine.\n\nThe government's climate advisers warn the UK risks falling behind on efforts to reach net zero by 2050.\n\nThe government has awarded funding to projects across the country as part of its \"levelling up\" plan.\n\nOfficially, the highest tax rate is 45% - but some workers can end up paying higher effective rates.\n\nMore parents are losing child benefit because the threshold at which it starts being withdrawn has not changed in 10 years.\n\nNew data suggests that the cost of living has been rising faster than official inflation figures.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "‘I never worked for the Russians’ - punished by Kyiv for being a collaboratorAlmost 2,000 people have been convicted of collaborating with Russia under a new Ukrainian law.7 hrs agoEurope",
        "link": "https://www.bbc.com/news/articles/c0473y0p0ego",
        "date": "No Date",
        "full_content": "Title: ‘I never worked for the Russians’ - punished by Kyiv for being a collaborator\nPublished on: No Date\n\nArticle Content:\n“I don’t deserve to be here at all” is a protestation you would expect to hear from someone in prison. But, as she sits in her maroon overalls, Tetyana Potapenko is adamant that she is not who the Ukrainian state says she is.\n\nOne year into a five-year sentence, she is one of 62 convicted collaborators in this prison, held in isolation from other inmates.\n\nThe prison is near Dnipro, about 300km (186 miles) from Tetyana’s home town of Lyman. Close to the front lines of the Donbas, Lyman was occupied for six months by Russia and liberated in 2022. \n\nAs we sit in the pink-walled room where inmates can phone home, Tetyana explains that she had been a neighbourhood volunteer for 15 years, liaising with local officials  - but that carrying on those duties once the Russians arrived had cost her dearly.\n\nUkrainian prosecutors claimed she had illegally taken an official role with the occupiers, which included handing out relief supplies.\n\n“Winter was over, people were out of food, someone had to advocate,” she says. “I could not leave those old people. I grew up among them.”\n\nThe 54-year-old is one of almost 2,000 people convicted of collaborating with the Russians under legislation drafted nearly as quickly as Moscow’s advance in 2022.\n\nKyiv knew it had to deter people from both sympathising and co-operating with the invaders.\n\nAnd so, in a little over a week, MPs passed an amendment to the Criminal Code, making collaboration an offence - something they had failed to agree on since 2014, when Russia annexed Ukraine’s Crimean peninsula.\n\nBefore the full-scale invasion, Tetyana used to liaise with local officials to provide her neighbours with materials such as firewood.\n\nOnce the new Russian rulers were in place, she says she was convinced by a friend to also engage with them to secure much-needed medicines.\n\n“I didn’t co-operate with them voluntarily,” she says. “I explained disabled people couldn’t access the drugs they needed. Someone filmed me and posted it online, and Ukrainian prosecutors used it to claim I was working for them.”\n\nAfter Lyman was liberated, a court was shown documents she had signed that suggested she had taken an official role with the occupying authority.\n\nShe suddenly becomes animated.\n\n“What’s my crime? Fighting for my people?” she asks. “I never worked for the Russians. I survived and now find myself in prison.”\n\nThe 2022 collaboration law was drawn up to prevent people from helping the advancing Russian army, explains Onysiya Syniuk, a legal expert at the Zmina Human Rights Centre in Kyiv.\n\n“However, the legislation encompasses all kinds of activities, including those which don’t harm national security,” she says.\n\nCollaboration offences range from simply denying the illegality of Russia’s invasion, or supporting it in person or online, to playing a political or military role for the occupying powers.\n\nAccompanying punishments are tough too, with jail terms of up to 15 years.\n\nOut of almost 9,000 collaboration cases to date, Ms Syniuk and her team have analysed most of the convictions, including Tetyana’s, and say they are concerned the legislation is too broad.\n\n“Now people who are providing vital services in the occupied territories will also fall liable under this legislation,” says Ms Syniuk.\n\nShe thinks lawmakers should take into account the reality of living and working under occupation for more than two years.\n\nWe drive to Tetyana's home town to visit her frail husband and disabled son. As we near Lyman, the scars of war are clear.\n\nCivilian life drains away and vehicles gradually turn a military green. Droopy power lines hang from collapsed pylons and the main railway has been swallowed by overgrown grass.\n\nWhile the sunflower fields are unscathed, the town isn’t. It has been bludgeoned by airstrikes and fighting.\n\nThe Russians have now moved back to within nearly 10km (6 miles). We were told they usually start shelling at about 15:30, and the day we visited was no exception.\n\nTetyana's husband, Volodymyr Andreyev, 73, tells me he is “in a hole” - the household is falling apart without his wife, and he and his son only manage with the help of neighbours.\n\n“If I were weak, I would burst into tears,” he says.\n\nHe struggles to understand why his wife is not with him.\n\nTetyana might have received a shorter sentence had she admitted her guilt, but she refuses. “I will never admit that I am an enemy of state,” she says.\n\nBut there have been enemies of state - and their actions have had deadly consequences.\n\nLast autumn, we walked on the bloodstained soil of the liberated village Hroza in the Kharkiv region of eastern Ukraine. A Russian missile had hit a cafe where the funeral of a Ukrainian soldier was taking place - it had been impossible to hold the service while Hroza was under Russian occupation.\n\nFifty-nine people - almost a quarter of Hroza’s population - were killed. We knocked on doors to find children alone at home. Their parents weren’t coming back.\n\nThe security service later revealed that two local men, Volodymyr and Dmytro Mamon, had tipped off the Russians.\n\nThe brothers were former police officers who had allegedly begun working for the occupying force.\n\nWhen the village was liberated they fled across the border with Russian troops, but stayed in touch with their old neighbours - who unwittingly told them about the upcoming funeral.\n\nThe brothers have since been charged with high treason - but are unlikely to be jailed in Ukraine.\n\nThat is broadly the story of Kyiv's battle with collaborators. Those who commit more serious crimes - guiding attacks, leaking military information or organising sham referendums to legitimise occupying forces - are mostly tried in absentia.\n\nThose facing less serious charges are often the ones who end up in the dock.\n\nUnder the Geneva Convention, occupying Russian forces have to allow and provide the means for people to continue living their lives.\n\nJust as Tetyana Potapenko says she tried to do, when troops moved into Lyman in May 2022.\n\nHer case is one of several we have uncovered across eastern Ukraine.\n\nThey include a school principal jailed for accepting a Russian curriculum - his defence, his lawyer says, was that although he had accepted Russian materials, he didn’t use them. And in the Kharkiv region, we heard about a sports stadium manager facing 12 years in prison for continuing to host matches while under occupation. His lawyer says he had only organised two friendly matches between local teams.\n\nIn the eyes of the United Nations (UN), these collaboration convictions breach international humanitarian law. A third of those handed down in Ukraine from the start of the war in February 2022 until the end of 2023 lacked a legal basis, it says.\n\n“Crimes have been carried out on occupied territory, and people need to be held to account for the harm they’ve done to Ukraine - but we’ve also seen the law applied unfairly,” says Danielle Bell, the head of the UN's Human Rights Monitoring Mission in the country.\n\nMs Bell argues that the law doesn’t consider someone's motive, such as whether they are actively collaborating, or trying to earn an income, which they are legally allowed to do. She says everyone is criminalised under its vague wording.\n\n“There are countless examples where people have acted under duress and performed functions to simply survive,” she says.\n\nThis is exactly what happened to Dmytro Herasymenko, who is from Tetyana’s home town of Lyman.\n\nIn October 2022, he emerged from his basement after artillery and mortar fire had subsided. The front line had passed through Lyman, and it was under Russian occupation.\n\n“By that time people had been living without power for two months,” he recalls. Dmytro had worked as an electrician in the town for 10 years.\n\nThe occupying authorities asked for volunteers to help restore power, and he stuck up his hand. “People had to survive,” he says. “[The Russians] said I could work like this or not at all. I was afraid of turning them down and being hunted by them.”\n\nFor Dmytro and Tetyana, the relief of liberation was brief. After Ukraine took back control of the town, officers from the country’s security service - the SBU - brought them in for questioning.\n\nAfter admitting to having provided power to the Russian occupiers, Dmytro was swiftly handed a suspended sentence and banned from working as a state electrician for 12 years.\n\nWe found him at the garage where he now works as a mechanic. Shiny tools reflect his enforced career change. “I can’t be judged in the same way as collaborators who help guide missiles,” he says.\n\nHis protests echoed Tetyana’s. “What can you feel when a foreign army moves in?” she asked. “Fear of course.”\n\nSuch fear is justified. The UN has found evidence of Russian forces targeting and even torturing people supporting Ukraine.\n\n“We’ve had cases of individuals being detained, tortured, disappeared, simply for expressing pro-Ukrainian views,” says the UN’s Ms Bell.\n\nFrom the moment Moscow invaded Crimea in 2014, the definition of being “pro-Russian” changed in the eyes of Ukrainian lawmakers - from simply favouring closer national ties, to supporting a Russian invasion seen as genocidal.\n\nThat same year, Russian proxy forces - funded by the Kremlin - also occupied a third of the Donetsk and Luhansk regions.\n\nIt is often the elderly who choose to, or are forced to, live under occupation. Some may be too frail to leave.\n\nThere will also be those with Soviet nostalgia or sympathy with modern-day Russia.\n\nBut given how Ukraine might one day have to reunite, does the collaboration law come down too hard?\n\nThe message from one MP who helped draw it up is blunt: “You’re either with us, or against us.”\n\nAndriy Osadchuk is the deputy head of the parliamentary committee on law enforcement. He strongly disagrees that the legislation breaks the Geneva Convention, but accepts it needs improvement.\n\n“The consequences are extremely tough, but this isn’t a regular crime. We are talking about life and death,” he says defiantly.\n\nMr Osadchuk believes it is, in fact, international law which has to catch up with the war in Ukraine, not the other way round.\n\n“We need to build Ukraine on liberated territories, and not make someone happy from the outside world,” he says.\n\nThe UN monitoring mission admits there have been some improvements. Ukraine’s prosecutor general has recently instructed his offices to comply with international humanitarian law while investigating collaboration cases.\n\nUkraine’s parliament is also planning to add more amendments to the legislation in September. One suggested change would see some people issued with fines instead of prison sentences.\n\nFor now, Kyiv sees the likes of Tetyana and Dmytro as acceptable recipients of tough justice, if it means Ukraine can finally be free of Russia’s grasp.\n\nThe pair claim they only regret not escaping when the Russians moved in the first time.\n\nBut with the state breathing down their necks and Lyman at risk of falling once more, it’s not clear how candid they can be.\n\nAdditional reporting by Hanna Chornous, Aamir Peerzada and Hanna Tsyba.\n\nAll BBC images by Lee Durant.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Russian priests bless fire trucks as huge blaze continues after Ukraine attackMore than 500 firefighters have been tackling the giant blaze at a fuel depot sparked by a Ukrainian attack.14 hrs agoEurope",
        "link": "https://www.bbc.com/news/articles/c9qgyenzwzyo",
        "date": "No Date",
        "full_content": "Title: Russian priests bless fire trucks as huge blaze continues after Ukraine attack\nPublished on: No Date\n\nArticle Content:\nRussian Orthodox priests have visited the scene of a huge fire at a fuel depot, which continues to burn three days after being set alight in a Ukrainian drone attack.\n\nMore than 500 firefighters have been tackling the giant blaze at the Proletarsk oil storage facility in the southern Rostov region.\n\nAbout 20 of 74 storage tanks were on fire, local authorities told the RIA news agency.\n\nOn Wednesday, local Orthodox priests said prayers next to the fire engines and brought an icon to the scene in support of firefighters' efforts.\n\n\"The [priests] spoke with the firefighters and blessed all the fire equipment,\" the local Volgodonsk eparchy - the Russian Orthodox Church equivalent of a diocese - told Reuters news agency.\n\nThey brought with them a large icon of the Unburnt Bush, considered a talisman against fire.\n\nAccording to regional governor Vasily Golubev, air defences shot down the Ukrainian drone on 18 August, but its debris caused diesel fuel to ignite on the territory of the facility.\n\nThe authorities have declared a state of emergency, but the local city administration, quoted by Russian state media, said there was no threat of the fire spreading to residential areas and called on people \"not to give in to panic\".\n\nMr Golubev said 41 firefighters had received medical treatment for the effects of the blaze, including five who had been placed in emergency care.\n\nUkraine has not commented on the strike - but its forces have been targeting Russia's oil infrastructure as part of their efforts to counter Moscow's full-scale invasion, which began in February 2022.\n\nAlso on Wednesday, Ukrainian forces reported striking an S-300 air defence system near the Russian city of Novoshakhtinsk in Rostov region.\n\nThe strike was carried out by the Ukrainian Navy in co-operation with other units, the general staff of the Ukrainian armed forces said on Facebook.\n\n\"Ukraine's defence forces continue to weaken Russian invaders' air defence,\" it said.\n\n\"It is worth noting that Russian invaders also use S-300 systems for strikes on peaceful Ukrainian cities, destroying residential buildings and terrorising civilian population,\" it added.\n\nElsewhere on Russian soil, Moscow said its air defences had shot down 11 Ukrainian drones targeting the city overnight.\n\nThe city's mayor, Sergei Sobyanin, said it was one of the biggest attacks on the Russian capital since the conflict started, but there were no reports of damage or casualties.  \n\nAt the same time, Ukrainian defences reported stopping 50 Russian drones and missiles.\n\n\"The enemy continues to attack our region with strike drones. The air raid lasted all night and into the morning for more than nine hours,\" Kyiv's military administration said on Telegram.\n\nA private house was damaged by falling debris, while power lines were severed, it added.\n\nOn the ground, Ukraine is continuing to hold a swathe of territory in Russia's western Kursk region, following its cross-border incursion that began on 6 August.\n\nIt is the first time that Russian territory has been occupied by a foreign power since World War Two.\n\nIn his video address late on Wednesday, Ukrainian President Volodymyr Zelensky said \"our combat work continues\" in the Kursk region.\n\n\"We control the designated areas,\" he said without providing any details.\n\nIn Russia's adjacent Bryansk region, Governor Aleksandr Bogomaz said an incursion attempt by a Ukrainian reconnaissance group was repelled on Wednesday.\n\nThis comes as Russian forces are continuing to press hard towards the city of Pokrovsk in Ukraine's eastern Donetsk region.\n\nUkraine's officials said earlier this week the Russians were now about 10km (six miles) from the outskirts of Pokrovsk, a key logistics hub in the area.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Ukraine says it has destroyed second Russian bridgeUkrainian forces continue their incursion into Russia's Kursk region, claiming destruction of a second bridge.3 days agoEurope",
        "link": "https://www.bbc.com/news/articles/c5y36rdreq1o",
        "date": "No Date",
        "full_content": "Title: Ukraine says it has destroyed second Russian bridge\nPublished on: No Date\n\nArticle Content:\nUkraine says it has destroyed a second strategic bridge in a week as it continues its incursion into Russia's Kursk region. \n\nThe Ukrainian military on Sunday released aerial footage of the strike on the bridge - reported to be over the Seym River in Zvannoe.\n\nHours later, Ukrainian President Volodymyr Zelensky said for the first time that the aims of the military incursion into Kursk included the creation of a \"buffer zone\" to stop Russian attacks.\n\nUkraine is nearly two weeks into its biggest attack on Russian territory since Moscow launched its invasion of Ukraine in 2022. \n\n\"Minus one more bridge,\" Ukrainian Air Force commander Lt Gen Mykola Oleschuk posted on social media with footage of the strike. \n\nGen Oleschuk added: \"Ukrainian Air Force aviation continues to deprive the enemy of logistical capabilities with precision airstrikes, which significantly affects the course of hostilities.\"\n\nThe video shows a growing large cloud of smoke over the bridge and one of its sections appears to be destroyed. It is not clear when the strike took place. \n\nEarlier this week, Ukraine destroyed another bridge over the river Seym, near the town of Glushkovo. \n\nThat bridge was used by the Kremlin to supply its troops. \n\nEarlier, military analysts had identified three bridges in the area used by Russia to supply its forces, and they said two had either been destroyed or seriously damaged, Reuters news agency reported.\n\nAlmost two weeks after Ukrainian troops pushed across the border into Russia, it is becoming clear that they plan to stay.\n\nPresident Zelensky said on Saturday his troops were strengthening positions in Kursk and expanding further in Russia.\n\nOn Sunday in an evening address, he said: \"Our operation in the Kursk region is still inflicting losses on the Russian army and the Russian state, their defence industry and their economy.\"\n\nHe stated that \"this is more than just defence for Ukraine\" and said that the aim was to \"destroy as much Russian war potential as possible and conduct maximum counteroffensive actions\". \n\nThis would include \"creating a buffer zone on the aggressor’s territory\", he added, in an effort to prevent further Russian attacks into Ukraine.\n\nMykhaylo Podolyak, an adviser to President Zelensky, insisted Ukraine was not interested in occupying Russia but wanted to persuade Russia to enter negotiations.  \n\nMoscow has called the incursion a major provocation and vowed to retaliate with a \"worthy response\".\n\nAs Ukraine moves further into western Russian territory, Russian forces are equally making gains in Ukraine's east and have claimed a string of villages in recent weeks.\n\nIt comes as the head of the UN's nuclear watchdog warned the nuclear safety situation at the Zaporizhzhia power plant in Russian-occupied Ukraine was deteriorating, following a drone strike near the site's perimeter.\n\nRafael Grossi, head of the International Atomic Energy Agency (IAEA), said he remained \"extremely concerned\" and called for \"maximum restraint from all sides\" to protect the plant.\n\nThe agency said the impact of the strike was on a road just outside the facility - close to essential water sprinkler ponds and about 100m from the only remaining high-voltage line. \n\nThe plant was seized by Russia's forces early in the war and has come under repeated attacks which both sides have blamed the other for. \n\nLast week, Kyiv and Moscow traded blame after a fire broke out in one of the plant's cooling towers.\n\nThe IAEA did not say who carried out Saturday's strike, but its team stationed at Zaporizhzhia said the damage seemed to have been caused by a drone carrying an explosive.\n\n\"The team has heard frequent explosions, repetitive heavy machine gun and rifle fire and artillery at various distances from the plant,\" the agency said in a statement.\n\nThe plant has not produced power in more than two years and all six reactors have been in cold shutdown since April.\n\nRussia launched a full-scale invasion of its neighbour in February 2022 and has been making slow progress recently in seizing more territory in eastern Ukraine.\n\nHowever, it was shocked when Ukrainian troops penetrated into its Kursk region where they have been consolidating positions for nearly two weeks. \n\nThousands of Russians have been evacuated from the area.\n\nIt is the first time foreign troops have been on Russian soil since World War Two.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Ukraine strengthening positions in captured Russian territory - ZelenskyUkraine surprised many with its incursion which came as Russia was making progress in the east.5 days agoEurope",
        "link": "https://www.bbc.com/news/articles/c935y88vn7yo",
        "date": "No Date",
        "full_content": "Title: Ukraine strengthening positions in captured Russian territory - Zelensky \nPublished on: No Date\n\nArticle Content:\nUkrainian troops are \"strengthening\" positions in captured territory in Russia and expanding further, President Volodymyr Zelensky has said. \n\nUkrainian soldiers are two weeks into their incursion in Russia's Kursk region - their deepest since Moscow launched its full scale invasion more than two years ago. \n\nTroops are continuing to advance further into Kursk, the force said in its daily report. \n\nMoscow has called the incursion a major provocation and vowed to retaliate with a \"worthy response\". \n\nIn a statement on messaging app Telegram, President Zelensky said: \"Thank you to all the soldiers and commanders who are taking Russian military prisoners and bringing the release of our soldiers and civilians held by Russia closer. \n\n\"General Syrskyi also reported on strengthening our forces' positions in the Kursk region and expanding the stabilised territory.\"\n\nRussia said its forces had repelled the Ukrainians near three settlements in the Kursk region and were searching for \"mobile enemy groups\" trying to pierce deeper into the country. \n\nKyiv claims to have taken control of more than 80 settlements in the incursion. \n\nHis latest statement comes after Ukraine destroyed a strategically important bridge over the river Seym this week. \n\nThe bridge had been used by the Kremlin to supply its troops and its destruction could hamper those efforts. \n\nThe Russian foreign ministry said the bridge was \"completely destroyed\" and volunteers assisting the evacuated civilian population had been killed. \n\nHowever, as Ukraine moves further into western Russian territory, Russian forces are equally making gains in Ukraine's east and have claimed a string of villages in recent weeks. \n\nRussia attacked at least four Ukrainian regions on Saturday, according to Ukrainian officials, including the north-eastern region of Kharkiv.\n\nMr Zelensky said on Saturday there had been \"dozens of Russian assaults\" on Ukrainian positions near the cities of Toretsk and Pokrovsk. \n\nPokrovsk is a vital logistics hub that sits on a main road for supplies to Ukrainian troops along the eastern front.\n\n\"Our soldiers and units are doing everything to destroy the occupier and repel the attacks,\" the Ukrainian president said, stressing the situation was \"under control\".\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Hungary law could make Ukrainian refugees homelessThousands of Ukrainian refugees could be forced on to the streets or back to Ukraine.22 hrs agoEurope",
        "link": "https://www.bbc.com/news/articles/ckg2jxjd7r7o",
        "date": "No Date",
        "full_content": "Title: Hungary law could make Ukrainian refugees homeless\nPublished on: No Date\n\nArticle Content:\nA new law has come into force in Hungary which threatens to push thousands of Ukrainian refugees on to the streets or back to Ukraine.\n\nThe regulation restricts state support for Ukrainians to those who come from parts of Ukraine directly affected by the fighting caused by Russia's invasion. \n\nThirteen regions in Ukraine are on the list, which will be updated monthly by the Hungarian government. \n\nIt is not known how many of the 31,000 Ukrainians taking shelter in Hungary will be affected by the new law. \n\nHuman rights groups say the most vulnerable are those from the Roma ethnic minority from the westernmost Transcarpathian region, who are still living in shelters which will now close. \n\nTheir situation is complicated by the fact that many are dual Ukrainian-Hungarian citizens, who have been refused help elsewhere in the European Union on the grounds they are Hungarian citizens.\n\nThe UN refugee agency said the law change will mean an estimated 2,000-3,000 refugees will \"lose access to subsidised accommodation\".\n\n\"Many face significant barriers in securing alternative housing due to lack of financial means but also reluctance of owners to rent,\" the UNHCR said.\n\n\"For many, the change will result in job losses and impact school enrolment, jeopardizing the positive integration achievements obtained so far.\"\n\nUnder the new law, only Ukrainians whose last official address in Ukraine was in an area \"directly affected by military operations\" remain eligible for state support, which includes free housing and a basic monthly sum. \n\nGovernment decree 134 changes legislation dating back to 2022 and the start of the full-scale Russian invasion of Ukraine. \n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Russian priests bless fire trucks as huge blaze continues after Ukraine attackMore than 500 firefighters have been tackling the giant blaze at a fuel depot sparked by a Ukrainian attack.14 hrs agoEurope",
        "link": "https://www.bbc.com/news/articles/c9qgyenzwzyo",
        "date": "No Date",
        "full_content": "Title: Russian priests bless fire trucks as huge blaze continues after Ukraine attack\nPublished on: No Date\n\nArticle Content:\nRussian Orthodox priests have visited the scene of a huge fire at a fuel depot, which continues to burn three days after being set alight in a Ukrainian drone attack.\n\nMore than 500 firefighters have been tackling the giant blaze at the Proletarsk oil storage facility in the southern Rostov region.\n\nAbout 20 of 74 storage tanks were on fire, local authorities told the RIA news agency.\n\nOn Wednesday, local Orthodox priests said prayers next to the fire engines and brought an icon to the scene in support of firefighters' efforts.\n\n\"The [priests] spoke with the firefighters and blessed all the fire equipment,\" the local Volgodonsk eparchy - the Russian Orthodox Church equivalent of a diocese - told Reuters news agency.\n\nThey brought with them a large icon of the Unburnt Bush, considered a talisman against fire.\n\nAccording to regional governor Vasily Golubev, air defences shot down the Ukrainian drone on 18 August, but its debris caused diesel fuel to ignite on the territory of the facility.\n\nThe authorities have declared a state of emergency, but the local city administration, quoted by Russian state media, said there was no threat of the fire spreading to residential areas and called on people \"not to give in to panic\".\n\nMr Golubev said 41 firefighters had received medical treatment for the effects of the blaze, including five who had been placed in emergency care.\n\nUkraine has not commented on the strike - but its forces have been targeting Russia's oil infrastructure as part of their efforts to counter Moscow's full-scale invasion, which began in February 2022.\n\nAlso on Wednesday, Ukrainian forces reported striking an S-300 air defence system near the Russian city of Novoshakhtinsk in Rostov region.\n\nThe strike was carried out by the Ukrainian Navy in co-operation with other units, the general staff of the Ukrainian armed forces said on Facebook.\n\n\"Ukraine's defence forces continue to weaken Russian invaders' air defence,\" it said.\n\n\"It is worth noting that Russian invaders also use S-300 systems for strikes on peaceful Ukrainian cities, destroying residential buildings and terrorising civilian population,\" it added.\n\nElsewhere on Russian soil, Moscow said its air defences had shot down 11 Ukrainian drones targeting the city overnight.\n\nThe city's mayor, Sergei Sobyanin, said it was one of the biggest attacks on the Russian capital since the conflict started, but there were no reports of damage or casualties.  \n\nAt the same time, Ukrainian defences reported stopping 50 Russian drones and missiles.\n\n\"The enemy continues to attack our region with strike drones. The air raid lasted all night and into the morning for more than nine hours,\" Kyiv's military administration said on Telegram.\n\nA private house was damaged by falling debris, while power lines were severed, it added.\n\nOn the ground, Ukraine is continuing to hold a swathe of territory in Russia's western Kursk region, following its cross-border incursion that began on 6 August.\n\nIt is the first time that Russian territory has been occupied by a foreign power since World War Two.\n\nIn his video address late on Wednesday, Ukrainian President Volodymyr Zelensky said \"our combat work continues\" in the Kursk region.\n\n\"We control the designated areas,\" he said without providing any details.\n\nIn Russia's adjacent Bryansk region, Governor Aleksandr Bogomaz said an incursion attempt by a Ukrainian reconnaissance group was repelled on Wednesday.\n\nThis comes as Russian forces are continuing to press hard towards the city of Pokrovsk in Ukraine's eastern Donetsk region.\n\nUkraine's officials said earlier this week the Russians were now about 10km (six miles) from the outskirts of Pokrovsk, a key logistics hub in the area.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Russian forces claim another town captured in east UkraineUkraine does not confirm the loss of Niu-York, saying Russian forces are attacking near the town.2 days agoEurope",
        "link": "https://www.bbc.com/news/articles/c79wqpqp297o",
        "date": "No Date",
        "full_content": "Title: Russian forces claim another town captured in east Ukraine\nPublished on: No Date\n\nArticle Content:\nRussia's military says it has captured a small town in eastern Ukraine called Niu-York, as part of its push towards big population centres in the Donetsk region. \n\nUkraine's military has not confirmed the loss of Niu-York, saying only that Russian forces are attacking close to the town and other areas. The army was giving the attacks \"a worthy rebuff... and the fighting continues\", it said.\n\nAlthough only a small settlement, controlling Niu-York would represent another step towards the two Donetsk hubs of Toretsk and Pokrovsk.\n\nOne of the aims of Ukraine's seizure of territory in Russia's Kursk region is thought to be to force Russia to move some of its forces away from the eastern campaign. \n\nThere is no indication so far of that happening, despite Ukraine's commander-in-chief Oleksandr Syrskyi now claiming control of 93 Russian villages and towns.\n\nPresident Volodymyr Zelensky described the situation in the east as difficult, but said Ukrainian troops were doing all they could to destroy the Russian forces. The military chief told a briefing that Russia was sending additional troops to the front line in the east.\n\nA Russia defence ministry statement said active operations by units of its Centre forces group had defeated Ukrainian troops, referring to Niu-York as \"one of the largest settlements of the Toretsk agglomeration and a strategically important logistics hub\". It also called the town by the Russian name of Novgorodskoye.\n\nRussian military bloggers shared footage late on Monday of a Russian tricolor flag being posted on the roof of a school in Niu-York with the Ukrainian flag lying on the ground. \n\nHowever, the video first circulated two weeks ago and Ukrainian forces had since blown up the flag and damaged the roof with a drone on 8 August.\n\nNiu-York is just south of the mining town of Toretsk, and Russian forces on Monday said they had also captured Zalizne, to the south-east of Toretsk.\n\nUkrainian forces said they were still fighting back in Zalizne and local sources were quoted as saying they still had control of 20% of Niu-York too, although they had far fewer reserves than the Russians.\n\nOn Monday, Ukrainian authorities ordered the evacuation of Pokrovsk, as Russian forces continue to advance on the town.\n\nAccording to a military briefing on Tuesday, Russia had directed more than a third of its 87 attacks during the day on it push towards Pokrovsk. Local officials say Russia's military is now about 10km (6 miles) from the outskirts of the town.\n\nRegional head Vadym Filashkin has said 53,000 people still live in Pokrovsk, including almost 4,000 children.\n\nUkraine's commander in chief said the counter-offensive in Russia's Kursk region had now advanced 28-35km beyond the border, with 1,263 sq km under Ukrainian control and a total of 93 population centres.\n\nRussian Defence Minister Andrei Belousov said three new military groupings had been formed to counter the Ukrainian operation in three border regions, Kursk, Belgorod and Bryansk.\n\nTheir task would be to protect \"citizens and territories from attacks\" from drones and other and other assault means.\n\nRussian officials have played down the success of the Ukrainian operation in the Kursk region. \n\nMaj Gen Apti Alaudinov, commander of Chechnya’s Akhmat special forces unit, told Russian TV that Ukraine's military had sustained very serious losses.\n\nAsked to respond to reports that three bridges had been blown up over the River Seym, cutting off evacuation and supply routes, he said \"the fact that some bridge has been blown up doesn’t mean anything\".\n\nHowever, state news agency Tass says local police are now having to use privately owned boats to get civilians to safety because bridges are down.\n\nGerman photographer Nanna Heitmann said she had spoken to Russians in the region who were furious that state media were not giving the full picture: \"They're shocked, they are angry. A lot of people wait, thousands of people waiting in lines to find shelter, to find basic needs like blankets, pillows etc.\"\n\nRussia's Vladimir Putin, who has appeared wrong-footed by the Ukrainian offensive, compared it on Tuesday to a 2004 school massacre by Chechen militants in Beslan where more than 300 people were killed.\n\nOn a visit to the school and to mothers of the victims in North Ossetia, he said \"just as we fought with terrorists previously, now we fight with those who commit crimes in Kursk region, Donbas and Novorossiya\", using an old Russian imperial term for areas of occupied Ukraine.\n\nAdditional reporting by BBC Verify\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Ukraine orders evacuation of city as Russia gainsOfficials said families with children living in Pokrovsk and surrounding villages would be forced to leave.3 days agoEurope",
        "link": "https://www.bbc.com/news/articles/cr40wwzd4gyo",
        "date": "No Date",
        "full_content": "Title: Ukraine orders evacuation of city as Russia gains\nPublished on: No Date\n\nArticle Content:\nUkrainian authorities have ordered the evacuation of a key city in the Donbas region as Russian forces continue to make gains in the east of the country, despite Ukraine's ongoing offensive into Russia's Kursk region. \n\nOfficials said families with children living in Pokrovsk and surrounding villages would be forced to leave. \n\nThe head of the city's military government, Serhii Dobriak, said residents had at most two weeks to flee the Russian advance. \n\nThe strategically important city is one of Ukraine's main defensive strongholds and a key logistical hub for Kyiv's troops on the eastern front. \n\nDonetsk region head Vadym Filashkin said over 53,000 people, including almost 4,000 children, remained in the city. \n\nHe said authorities had taken the decision to forcibly evacuate children and their parents or guardians.\n\n\"When our cities are within range of virtually any enemy weapon, the decision to evacuate is necessary and inevitable.\"\n\nMr Dobriak said the rate of evacuations from the city had risen to about 500 to 600 people a day. He said that while basic services continued to operate, they would likely soon cease to function as the Russian army closes in. \n\nThe evacuation order came even as Ukrainian President Volodymyr Zelensky said his forces were continuing to make gains during their incursion of Russia's Kursk region. \n\nOn Monday, President Zelensky said Ukraine had gained control of over 1,250 sq km of Kursk’s territory and 92 settlements.\n\n\"The Russian border area opposite our Sumy region has been mostly cleared of Russian military presence,\" he said on X. \n\n\"A few months ago, many people around the world would have said this was impossible and crossed Russia’s strictest 'red line',\" he added.\n\nOne of the aims of the incursion is reportedly to divert Russia's troops away from the Donbas region, relieving pressure on beleaguered Ukrainian troops there. \n\nOn Monday, Russian military bloggers claimed Ukraine had blown up a third bridge over the River Seym in the Kursk region. Kyiv did not claim responsibility but the destruction of the bridge would likely further hinder Russian military logistics and help Ukraine consolidate its control over the territory it has seized from Moscow. \n\nBut BBC Verify has identified new pontoon bridges - temporary, floating crossings, quickly constructed and used in the absence of permanent structures - over the river, apparently constructed by Russian forces.\n\nIn these satellite images taken on Saturday, the two recently built crossings, near Glushkovo, can be seen.\n\nThe Institute for the Study of War (ISW) think tank said that while Russia appeared committed to a strategy of \"gradual creeping advances\" in the east, Ukraine's surprise advance into Kursk showed that seizing the initiative had allowed Kyiv to make significant gains rather than slowly losing a \"war of attrition\".\n\nThe ISW said it had assessed Ukraine to be present across 800 sq km of Russian territory, though it added that presence did not necessarily equate to control. By contrast, the think tank estimates that Russia gained about 1,175 sq km between January and July. \n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Ukraine says it has destroyed second Russian bridgeUkrainian forces continue their incursion into Russia's Kursk region, claiming destruction of a second bridge.3 days agoEurope",
        "link": "https://www.bbc.com/news/articles/c5y36rdreq1o",
        "date": "No Date",
        "full_content": "Title: Ukraine says it has destroyed second Russian bridge\nPublished on: No Date\n\nArticle Content:\nUkraine says it has destroyed a second strategic bridge in a week as it continues its incursion into Russia's Kursk region. \n\nThe Ukrainian military on Sunday released aerial footage of the strike on the bridge - reported to be over the Seym River in Zvannoe.\n\nHours later, Ukrainian President Volodymyr Zelensky said for the first time that the aims of the military incursion into Kursk included the creation of a \"buffer zone\" to stop Russian attacks.\n\nUkraine is nearly two weeks into its biggest attack on Russian territory since Moscow launched its invasion of Ukraine in 2022. \n\n\"Minus one more bridge,\" Ukrainian Air Force commander Lt Gen Mykola Oleschuk posted on social media with footage of the strike. \n\nGen Oleschuk added: \"Ukrainian Air Force aviation continues to deprive the enemy of logistical capabilities with precision airstrikes, which significantly affects the course of hostilities.\"\n\nThe video shows a growing large cloud of smoke over the bridge and one of its sections appears to be destroyed. It is not clear when the strike took place. \n\nEarlier this week, Ukraine destroyed another bridge over the river Seym, near the town of Glushkovo. \n\nThat bridge was used by the Kremlin to supply its troops. \n\nEarlier, military analysts had identified three bridges in the area used by Russia to supply its forces, and they said two had either been destroyed or seriously damaged, Reuters news agency reported.\n\nAlmost two weeks after Ukrainian troops pushed across the border into Russia, it is becoming clear that they plan to stay.\n\nPresident Zelensky said on Saturday his troops were strengthening positions in Kursk and expanding further in Russia.\n\nOn Sunday in an evening address, he said: \"Our operation in the Kursk region is still inflicting losses on the Russian army and the Russian state, their defence industry and their economy.\"\n\nHe stated that \"this is more than just defence for Ukraine\" and said that the aim was to \"destroy as much Russian war potential as possible and conduct maximum counteroffensive actions\". \n\nThis would include \"creating a buffer zone on the aggressor’s territory\", he added, in an effort to prevent further Russian attacks into Ukraine.\n\nMykhaylo Podolyak, an adviser to President Zelensky, insisted Ukraine was not interested in occupying Russia but wanted to persuade Russia to enter negotiations.  \n\nMoscow has called the incursion a major provocation and vowed to retaliate with a \"worthy response\".\n\nAs Ukraine moves further into western Russian territory, Russian forces are equally making gains in Ukraine's east and have claimed a string of villages in recent weeks.\n\nIt comes as the head of the UN's nuclear watchdog warned the nuclear safety situation at the Zaporizhzhia power plant in Russian-occupied Ukraine was deteriorating, following a drone strike near the site's perimeter.\n\nRafael Grossi, head of the International Atomic Energy Agency (IAEA), said he remained \"extremely concerned\" and called for \"maximum restraint from all sides\" to protect the plant.\n\nThe agency said the impact of the strike was on a road just outside the facility - close to essential water sprinkler ponds and about 100m from the only remaining high-voltage line. \n\nThe plant was seized by Russia's forces early in the war and has come under repeated attacks which both sides have blamed the other for. \n\nLast week, Kyiv and Moscow traded blame after a fire broke out in one of the plant's cooling towers.\n\nThe IAEA did not say who carried out Saturday's strike, but its team stationed at Zaporizhzhia said the damage seemed to have been caused by a drone carrying an explosive.\n\n\"The team has heard frequent explosions, repetitive heavy machine gun and rifle fire and artillery at various distances from the plant,\" the agency said in a statement.\n\nThe plant has not produced power in more than two years and all six reactors have been in cold shutdown since April.\n\nRussia launched a full-scale invasion of its neighbour in February 2022 and has been making slow progress recently in seizing more territory in eastern Ukraine.\n\nHowever, it was shocked when Ukrainian troops penetrated into its Kursk region where they have been consolidating positions for nearly two weeks. \n\nThousands of Russians have been evacuated from the area.\n\nIt is the first time foreign troops have been on Russian soil since World War Two.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "War in maps: Ukraine's counter-offensive into Russian territoryAs Russian forces make slow progress in eastern Ukraine, Ukraine's military stages a surprise cross-border attack.6 days agoEurope",
        "link": "https://www.bbc.com/news/world-europe-60506682",
        "date": "No Date",
        "full_content": "Title: Ukraine in maps: Tracking the war with Russia\nPublished on: No Date\n\nArticle Content:\nFighting has raged in Ukraine since Russia launched a full-scale invasion in February 2022. Russian forces have made small gains in recent months but now Ukrainian forces have staged a counter-offensive into Russia.\n\nHere is a recap of recent significant events and the situation in Ukraine. \n\nUkrainian troops launched a surprise attack across the border in early August, advancing up to 18 miles (30km) into the Russian region of Kursk.\n\nAlmost 200,000 people were evacuated from areas along the border by the Russian government and President Vladimir Putin condemned the Ukrainian offensive as a \"major provocation\".\n\nAfter a week, Ukraine's top commander claimed to control 1,000 sq km of Russian territory, although analysts suggested the true scale was smaller, and the regions of Kursk and Belgorod had both declared a state of emergency.\n\nThe counter-offensive is seen partly as an attempt to force Russia to redeploy units from east and relieve pressure on the beleaguered Ukrainian defences there, and partly as a bid to improve Ukraine's chances of a peace settlement.\n\nAt the beginning of May 2024, Russian forces crossed the international border to the north of Ukraine's second-biggest city, Kharkiv. Several villages were seized and thousands of civilians fled.\n\nRussia's main offensive has long focused on the eastern Donetsk region, but this was one of the most significant ground assaults since the start of the war and further stretched Ukraine's frontline defences.\n\nThe Russian push took place at the end of a four-month period when the US was not supplying weapons to Ukraine, due to a stalemate in the US Congress.  \n\nThe issue was finally resolved at the end of April, when the US passed a $61bn aid package to provide missiles, artillery and air-defence systems to the Ukrainian military.\n\nUkrainian forces eventually held firm and even though the city of Kharkiv has come under repeated attack from glide bombs fired by Russian warplanes, it remains beyond the range of Russian artillery.\n\nThe incursion north of Kharkiv was some distance from the main front line in the east where Russia has continued its offensive operations and been edging forwards since October 2023.\n\nEastern Ukraine has been contested territory since 2014, when Russian-backed fighters seized large swathes of the eastern Donetsk and Luhansk regions. \n\nRussia's biggest advantage is manpower and it has shown a willingness to throw soldiers at Ukrainian positions to gain a few metres at a time. \n\nAround 1,200 Russian soldiers were being killed or wounded every day in May and June, the highest rate since the beginning of the war, according to Western officials.\n\nIn recent days, Russian troops have made some significant gains to the north-west of Donetsk.\n\nIn response, Ukraine has ordered the evacuation of the city of Pokrovsk, with a local military official telling residents that Russian forces were \"rapidly approaching\". \n\nThe Russian advance towards Pokrovsk is the most notable change in control of the front line near Donetsk for several months. \n\nThe last major change came when Ukraine withdrew its troops from Avdiivka, just north of Donetsk, back in February after months of fighting. \n\nAlmost all of Avdiivka's pre-war population of more than 30,000 people have left and the town itself is almost completely destroyed.\n\nTo the north, areas around Bakhmut have remained a flashpoint and have endured some of the heaviest fighting of the war. \n\nAlthough Ukraine gained some ground around Chasiv Yar, which is situated on high ground some 10km west of Bakhmut, Russian forces have since made further advances in the area. \n\nRussia's invasion began with dozens of missile strikes on cities all over Ukraine before dawn on 24 February 2022.\n\nRussian ground troops moved in quickly and within a few weeks were in control of large areas of Ukraine and had advanced to the suburbs of Kyiv.\n\nRussian forces were bombarding Kharkiv, and they had taken territory in the east and south as far as Kherson, and surrounded the port city of Mariupol.\n\nBut they hit very strong Ukrainian resistance almost everywhere and faced serious logistical problems with poorly motivated Russian troops suffering shortages of food, water and ammunition.\n\nUkrainian forces were also quick to deploy Western supplied arms such as the Nlaw anti-tank system, which proved highly effective against the Russian advance.\n\nBy October 2022, the picture had changed dramatically and having failed to take Kyiv, Russia withdrew completely from the north. The following month, Ukrainian forces recaptured the southern city of Kherson.\n\nSince then, the battle has mostly been in the east of Ukraine with Russian forces slowly gaining ground over many months, while losing at least 50,000 troops - and probably many more.\n\nBy Dominic Bailey, Mike Hills, Paul Sargeant, Chris Clayton, Kady Wardell, Mark Bryson, Sana Dionysiou, Gerry Fletcher, Kate Gaynor and Erwan Rivault\n\nTo indicate which parts of Ukraine are under control by Russian troops we are using daily assessments published by the Institute for the Study of War with the American Enterprise Institute's Critical Threats Project. \n\nThe situation in Ukraine is often fast moving and it is likely there will be times when there have been changes not reflected in the maps.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Ukraine hopes its incursion into Russia changes outcome of warUkrainians say the foray into Kursk brings tactical advantages - and opens the door to ending the war.5 days agoEurope",
        "link": "https://www.bbc.com/news/articles/cn8lzyjprymo",
        "date": "No Date",
        "full_content": "Title: Ukraine hopes its incursion into Russia changes outcome of war\nPublished on: No Date\n\nArticle Content:\n“All wars end with negotiations. It’s not the soldiers in the trenches who decide when.”\n\nArni joined the Ukrainian army in 2022 to fight for his country’s survival. When we bump into him 30 months later, he describes a new motivation. “Peace.”\n\n“No-one likes war, we want to finish it,” he says while leaning against his camouflaged pick-up truck.\n\nFor the troops we encounter close to Russia’s border, there’s a desire to end Russia’s invasion on acceptable terms.\n\nThat is not to say survival isn’t a core driver - it is - but they seem to be striving for a finish line.\n\n“For Ukraine, our people, we’ll stand until the end,” adds Arni.\n\nUntil 6 August, Ukraine’s sole objective was one of liberation. The complete repelling of Russian forces to its borders from before Russia first invaded in 2014.\n\nAlbeit at a grinding pace, the reverse has been happening for the past year-and-a-half with Moscow eroding Ukrainian territory.\n\nThen came the “all in” poker play which surprised everyone apart from the battle-hardened Ukrainian soldiers who carried it out: a counter-offensive into Russia’s Kursk region.\n\n“It was undeniably successful and daring,” observes Serhii Kuzan, chairman of the Ukrainian Security and Co-operation Centre, a think tank.\n\nNow, Kyiv can’t reference its offensive often enough, with countless pictures of troops giving out aid as they tear down Russian flags.\n\n“It also changes the narrative,” says Alina Frolova, security expert and former deputy defence minister of Ukraine. “A situation where we’re losing territory step by step is not a good one.\n\n“Ukraine’s strategic position has changed.”\n\nDespite parallels with Russia’s initial invasion, Kyiv claims its goal is not to occupy.\n\nSo what is the aim? Well, there’s more than one.\n\n“This attack was partly carried out so the city of Sumy was better protected,” explains Serhii Kuzan, who thinks it is often forgotten that the border is still a front line.\n\nSince the start of this summer, President Volodymyr Zelensky says there were more than 2,000 strikes on the Sumy region from the Kursk region alone, including 250 glide bombs.\n\nFor months it was feared Russian troops were preparing for a cross-border attack of their own, and by pushing them back, Serhii believes defending Ukraine in general will be easier.\n\n“The [now captured] Russian city of Sudzha is on a commanding height. The Russians are already in a less advantageous position because we control the approach routes.”\n\nWhile Russia has had to react to Ukraine on the battlefield, it has also had its supply lines targeted. Key roads have been seized and a strategically important bridge destroyed.\n\nWhich leads us to:\n\n“The main purpose of this offensive into Kursk is to divert Russia’s attention from its occupied territories in Ukraine,” says Ivan Stupak, who worked for Ukraine’s security service (SBU) between 2004-2015.\n\nThe good news for Ukraine is that is what appears to be happening. The bad news is that Russian advances, notably towards the town of Pokrovsk, are not slowing.\n\n“The Russian army has been redeploying some troops from different directions - the Kherson, Kharkiv and Donetsk regions, for example,” Ivan says. He believes around 10,000 personnel are being diverted, mostly from other parts of Russia.\n\nIt is how President Zelensky describes Ukraine’s collection of captured Russian soldiers.\n\nHistorically, when Ukraine has momentum, it captures more and consequentially negotiates the release of their own more easily.\n\nThe Kursk offensive has been no exception. Kyiv says hundreds of Russian troops were taken prisoner. Several could be seen surrendering in drone footage and being taken back to Ukraine with tape blindfolds.\n\n“Moscow is actually offering to start negotiations to exchange prisoners of war,” says Serhii Kuzan.\n\n“It is no longer us, enlisting the support of Qatar and the United Arab Emirates to ask Russia to hand over our prisoners of war.”\n\nThis is a huge part of it for Kyiv.\n\nOn a civilian level, you had the horror and anger felt in the Kursk region in response to the blistering Ukrainian assault on their homes.\n\nThere were mass evacuations, pleas for help and criticisms of some authorities for not preventing the attack.\n\nOn a political level, you had Russian President Vladimir Putin publicly processing events in Moscow while being briefed by his security chiefs.\n\nAnd of course there is the military level.\n\n“The influence of this Ukrainian incursion could be quite substantial,” concludes Alina Frolova. “That’s why using highly professional troops was specifically the right decision.”\n\nIf Ukraine does not plan to keep hold of its captured Russian territory in the long term, but can hang on long enough, it hopes to leverage it for the release of its own land.\n\nBut it’s a big “if”.\n\nWhen fighting slows, that has always suited Russia with its superior size. Misdirection and surprise has often worked for Ukraine.\n\n“In a symmetric war, we have no chances with Russia,” points out Alina Frovola. “We need to make asymmetrical actions”.\n\nSlowing advances in the Kursk region may leave Kyiv with difficult decisions.\n\nBut there are benefits for as long as  there is movement, Serhii Kuzan argues.\n\n“An advance rate of 1-3km a day is normal for swapping forward units with reserves,” he says. “In Ukraine’s Donbas region, the average advance rate for the Russians is 400m.\n\n“Our pace in the Kursk region is five times faster than a 100,000-strong army!”\n\nBut the problem for Kyiv, is that Russians are still going forward in Ukraine.\n\nHowever, don’t expect Ukraine to withdraw from its Russian attack anytime soon.\n\nIt is committed now.\n\nRussia’s president initially labelled the offensive as a “terrorist attack” and “provocation”, but in the days since he has barely referenced it publicly.\n\nThat’s despite it fitting into his narrative that Russia’s invasion is a defensive war to protect his people.\n\nPerhaps he doesn’t want the alarm felt by many in the Kursk region to spread, or for it to appear like his military doesn’t have control of the situation.\n\nAlso, as with the Kursk submarine disaster and failed coup of last year, Vladimir Putin doesn’t always act quickly to regain the initiative.\n\nUkraine will be hoping he’s not this time because he can’t.\n\nAdditional reporting by Hanna Chornous, Sophie Williams and Hanna Tsyba\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Ukraine's surprise advance into Russia a dilemma for BidenThe way US weapons are used in the war keeps changing - US officials are assessing how Putin might react.7 days agoWorld",
        "link": "https://www.bbc.com/news/articles/cql365ld002o",
        "date": "No Date",
        "full_content": "Title: Ukraine's surprise advance into Russia a dilemma for Biden\nPublished on: No Date\n\nArticle Content:\nWashington is absorbing the impact of Ukraine’s lightning assault into Russia’s Kursk region as the scale of President Zelensky’s bold gamble emerges.\n\nUS officials are assessing how the incursion might reshape the political and military dynamics of the war, as well as the implications for Washington’s long-shifting stance on how Ukraine can use American-supplied arms.\n\nThe stunning raid, catching both Russian and apparently Western leaders by surprise, highlights one of the riskiest dilemmas for the Western-backed defence of Ukraine: President Biden has consistently tried to empower Kyiv to push back Russia’s invasion without risking an American escalation with Moscow. \n\nAs President Putin has always tried to portray the conflict as a war between Russia and the West, Mr Biden has sought to put clear limits on US policy to deflate that narrative and prevent a conflagration.\n\nBut Ukraine’s Kursk assault - the largest incursion into Russia by a foreign military since World War Two, according to military analysts - has raised a series of urgent questions for the White House. \n\nDoes it rapidly expand the boundaries of Washington’s set limits for how Ukraine can use American and Nato weapons systems? \n\nDoes it risk crossing Russia’s red lines over Western involvement in the war? If not, has President Zelensky showed Washington he can call Mr Putin’s bluff?\n\nDespite the risks and the uncertainty, there is a sense of surprised admiration among some in Washington at Mr Zelensky's move. Piecing together comments from US officials over the last week reveals something of the emerging position. \n\nThe administration insists Ukraine gave it no advance warning of the assault. White House spokeswoman Karine Jean-Pierre has said Washington had \"nothing to do\" with it.\n\nAs for the use of US weapons, the White House, Pentagon and State Department won't officially confirm whether they are being used, but it seems overwhelmingly clear that they are, given Ukraine’s reliance on US and Nato weapons systems. \n\nVladislav Seleznyov, a former spokesman for the Ukrainian armed forces' general staff, told Voice of America that US-provided HIMAR rocket launchers had been critical to the advance. \n\nUS approval for the use of its weapons by Ukraine in the Kursk incursion is certainly being implicitly given. Pentagon spokesman Patrick Ryder said this week: \"We assess that they're within the policy boundaries that we've set. Those policies haven't changed as it relates to in particular to use of US weapons.\" \n\nOfficials say the assault is \"consistent\" with their policy \"from the very beginning\" for Ukraine to be able to defend itself against attacks coming across the border.\n\nBut Pentagon spokeswoman Sabrina Singh added: \"Again, we don't support long range attacks into Russia. These are more for crossfire. I'm not going to put a specific range on it.\"\n\nThe US is the single biggest arms supplier to Ukraine - making the relationship the most consequential for Ukraine’s prospects. Just last week the Pentagon authorised its 63rd tranche of equipment in three years, including Stinger missiles and artillery shells. \n\nBut since the start of the Russian invasion President Biden's approach has been characterised by at first a refusal to send more even advanced weapons - including, consecutively, HIMARS rockets, Patriot missile defence systems and F-16 fighter jets - before later changing his mind.\n\nThe same goes for White House policy on Ukrainian attacks into Russian territory. For many months President Zelensky pleaded for permission to strike at military targets in Russia that facilitated attacks into Ukraine. \n\nIn May, Mr Biden finally authorised the use of US weapons to strike across the border into Russia but only in a limited range from the Kharkiv region - which was under Russian assault. The White House described Ukraine’s permitted actions as \"counter-strike\" measures.\n\n\"They're authorised to be used in proximity to the border when [Russian military sites] are being used on the other side of the border to attack specific targets in Ukraine,\" said Mr Biden in June. \"We're not authorising strikes 200 miles into Russia and we're not authorising strikes on Moscow, on the Kremlin.\"\n\nA few weeks later, that same permission was extended to any point along the border where Russian forces were preparing to attack Ukraine.\n\nSince then, Mr Zelensky, along with some European allies and some Democrats in Washington, have urged the US to further \"untie\" Ukraine’s hands. \n\nSpecifically, the Ukrainian leader wants to be able to use American-provided ATACMS or long range missiles to fire deep into Russia to take out drone or missile launch sites. Washington has refused.\n\nHovering ominously over all of such decisions are the warnings of President Putin, who has previously threatened to use \"all available means\" if Russia’s territorial integrity is threatened. This in addition to his nuclear sabre rattling if he deems the West as posing an intolerable threat to Russia via the Ukraine war.\n\nUltimately, President Biden's stance could be summed up as this: Ukraine can decide how best to defend itself using American weapons, including strikes across the border, but within very clear limits - including not using long-range missiles. \n\nThe words he used in June suggested that Ukraine’s limits were \"in proximity to the border\".\n\nThe Kursk offensive takes America’s dilemma into unexpected territory - literally and figuratively. Ukraine’s incursion is a cross-border ground assault, reportedly involving anywhere between 5,000 to 12,000 troops. \n\nSome unconfirmed Russian reports have suggested its forces could have advanced up to 30km into Russia. \n\nBy the middle of this week Kyiv said its forces were in control of 1,000 sq km of Russian territory, including more than 70 villages and towns, and had captured hundreds of prisoners of war. Russian officials said around 132,000 people had been evacuated from their homes.\n\nWith US officials still reluctant to talk about it publicly in any detail, my sense is that they are still working out what it means for the state of the battlefield, the future of the war and how this is affecting Putin’s calculations. \n\nIf Mr Zelensky was frustrated at what he perceived as too much caution or slow decision making from President Biden over arms authorisations, he may be trying to show him he can force both his - and Vladimir Putin's - hand. It is a daring gamble.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Phone taps, sabotage and an assassination plot: Is Germany in Cold War 2.0?As a hot war rages between Russia and Ukraine, there are fears Europe has slipped into a new Cold War.4 days agoEurope",
        "link": "https://www.bbc.com/news/articles/clyn8vk4g42o",
        "date": "No Date",
        "full_content": "Title: Phone taps, sabotage and an assassination plot: Is Germany in Cold War 2.0?\nPublished on: No Date\n\nArticle Content:\nHoles mysteriously found cut in army base fences.\n\nAn alleged plot to assassinate Germany’s top weapons manufacturer.\n\nPhone taps on a high-level Luftwaffe call.\n\nThese aren’t storylines lifted from a 1960s spy novel but real-life events in Germany, this year.\n\nNot all of these events can definitively be blamed on Moscow, but Germany is on heightened alert for possible acts of Russian sabotage, because of Berlin’s continued military support for Kyiv.\n\nAs a hot war rages between Russia and Ukraine, there are fears that Europe has slipped into a new Cold War.\n\n“When we think of the Cold War, we have a tendency to think of the 1970s by which point the rules of the game had become established and accepted,” says Mark Galeotti, a senior fellow at the Royal United Services Institute (Rusi) and director of Mayak Intelligence.\n\n“In some way, we’re in the early Cold War – the Fifties and Sixties, so a much rawer time.”\n\nBut what does a rekindled Cold War look like for Europe’s biggest economy and a country that was once itself cut in half by the Iron Curtain?\n\nThe biggest bombshell dropped just last month when CNN reported that US officials had told Berlin of an alleged Russian plot to kill the chief executive of Germany’s biggest arms company Rheinmetall.\n\nThe Kremlin denied the report but German Foreign Minister Annalena Baerbock, who strikes a hawkish figure next to the more hesitant Chancellor Olaf Scholz, hit out at Russia for “waging a hybrid war of aggression\".\n\nI met Rheinmetall’s CEO, Armin Papperger, at a ground-breaking ceremony for a new ammunition factory in February.\n\nThe 61-year-old is, to use a crude term, a real “somebody”, particularly in a world where Nato countries are spending billions to re-supply Ukraine and boost their own security.\n\nHis prominent position was clear as he stood alongside Chancellor Scholz, Defence Minister Boris Pistorius and Danish Prime Minister Mette Frederiksen as they plunged spades into the earth in Lower Saxony.\n\nHad a plot to kill him been successful, it would have sent shockwaves through the West.\n\nA security blunder not long afterwards allowed spies to eavesdrop on a highly sensitive conversation between senior German air force officials, later broadcast on Russian TV.\n\nIt was a cause of acute embarrassment for Berlin given that a brigadier general in the Luftwaffe appeared to allow spies into the secure call by dialling in on an insecure line.\n\nThe mega-blip, however isolated, fuelled accusations that Germany has long been a “weak link” within the European counter-intelligence due to a fragmented, federalised system that’s underpinned by a strong emphasis on individuals’ privacy.\n\nWeeks later, two German-Russian nationals were arrested on suspicion of planning to sabotage US military facilities in Bavaria. Annalena Baerbock summoned the Russian ambassador to complain and announced: “We will not allow Putin to bring his terror to Germany.”\n\nOnly last week, holes were found cut into the fences of water facilities supplying two military bases in North Rhine-Westphalia, with concerns that someone has been seeking to contaminate supplies.\n\n\n\nGermany is not the only European country being targeted by apparent acts of sabotage, but it has a lot of US military bases that were established in the wake of World War Two.\n\nMark Galeotti believes Moscow views Germany as a large but “flabby” power, making it the ideal pressure point.\n\nBy anyone’s measure, the greatest act of known sabotage to affect Germany in recent years was when the Nord Stream gas pipelines, running under the Baltic Sea from Russia, were blown up in 2022.\n\nSpeculation over who ordered the attack has been rife ever since, but in a dramatic development Germany has now issued an arrest warrant for a Ukrainian diving instructor.\n\nLast week the Wall Street Journal reported that the “shoestring” operation had been privately funded but overseen from Ukraine.\n\nKyiv rejected the report as nonsense, and while there was always scepticism that President Putin would order the destruction of his own pipeline, it does show that the murky world of espionage can be full of twists and turns.\n\nEach incident of apparent sabotage cannot, by any means, be immediately and certainly attributed to Russia.\n\nIn France it was far-left activists, not Russian agents, who were accused of targeting the country’s high-speed rail network on the eve of the Olympics.\n\nAnd Germany has had its own, extensive, history of far-left militant attacks.\n\nThe fact that Ukrainian figures are now under the spotlight for the Nord Stream blasts has fuelled fresh criticism from familiar political wings, within Germany, about the government’s support for Kyiv.\n\nCo-leader of the far-right Alternative for Deutschland, Alice Weidel, has called for “aid payments” to Kyiv to be halted and the damage to Nord Stream “billed” to Ukraine.\n\nThe AfD enjoys much of its support in the former communist east, where beyond Berlin you’re more likely to find lingering affection for Russia and dissatisfaction with the main parties that have, since reunification, dominated national politics.\n\nSo as Cold War comparisons hover over European security, the politics of that period has also renewed itself in Germany in a stark and unexpected way.\n\nIn a bid to bolster security, the German government is working on a new law aimed at boosting resilience of critical infrastructure.\n\nGerman Interior Minister Nancy Faeser says there must be “maximum protective measures in all areas”.\n\nOperators in critical sectors such as energy, transport and water will have to follow minimum security standards, under the Kritis Umbrella Act.\n\nIt’s the first federal law of its kind in Germany but yet to gain final approval despite heightened tensions surrounding the war.\n\nGerman-made armoured Marder vehicles are reportedly being used in Ukraine’s surprise operation inside Russian territory.\n\nThat would mark yet another German foreign policy taboo being broken since Russia’s full-scale invasion of Ukraine.\n\nAdd to that contentious plans for the US to station long-range missiles in Germany from 2026.\n\nWhen Russia’s full-scale invasion of Ukraine began, Chancellor Sholz promised a “Zeitenwende”, or turning point in national defence and security policy.\n\nBut supporters and critics of the government alike acknowledge that reversing years of underinvestment in defence will take time – as will adjusting a mentality so influenced by Germany’s dark past.\n\nGiven recent developments, there’s a question mark over how long Berlin has.\n\nMark Galeotti says it is not just rebuilding defence but upgrading cyber-security and improving counter-intelligence.\n\n“Security planning doesn’t happen over weeks or months but years.”\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Rosenberg: Ukraine's advance undermines Putin's image as 'Mr Security'Ukraine's incursion into Kursk raises questions about Mr Putin's ability to keep Russia safe.8 days agoEurope",
        "link": "https://www.bbc.com/news/articles/credw5q0705o",
        "date": "No Date",
        "full_content": "Title: Rosenberg: Ukraine's advance undermines Putin's image as 'Mr Security'\nPublished on: No Date\n\nArticle Content:\nKursk.\n\nIt is one of the first words I wrote and spoke as a BBC correspondent.\n\nIn 2000, I reported on the sinking of the Kursk submarine in the icy waters of the Barents Sea. One hundred and eighteen submariners were killed.\n\nVladimir Putin had been president for less than half a year. I can still remember Russian TV channels slamming him over his handling of the disaster.\n\nThis week marked 24 years since K-141 Kursk sank. And, once again, the word Kursk is filling my despatches from Russia. This time Kursk Region, where Ukrainian troops launched their surprise incursion and where they have been seizing territory for nine days now.\n\nSame word.\n\nBut Russia 2024 is very different from Russia 2000.\n\nThis time on Russian TV there is no hint of criticism of President Putin; no casting doubt on his decision-making; no suggestion that it is his invasion of Ukraine that has led to this dramatic moment. Then again, the Kremlin has had a quarter of a century to establish tight control over the Russian media and the messaging.\n\nEven so, will these events damage Vladimir Putin?\n\nIt’s a question I’ve been asked many times over the last two-and-a-half years:\n\nPresident Putin got through all of that, apparently unscathed. He will be confident he can overcome this latest challenge.\n\nBut here’s the thing. The Wagner mutiny was over in a day. \n\nUkraine’s offensive inside Russia has been going on for more than a week. The longer it continues, the greater the pressure will be on the Russian leadership and, potentially, the greater the damage to President Putin’s authority.\n\nThrough his two and a half decades in power, Mr Putin has cultivated the image of \"Mr Security\", the only man in this vast country capable of keeping Russians safe and secure. \n\nHis so-called \"special military operation\" (the full-scale invasion of Ukraine) was presented to the Russian people as a way of boosting Russia’s national security.\n\nTwo and a half years into this war there isn’t much sign here of \"safe and secure\". \n\nThere is more Nato on Russia’s borders, with Sweden and Finland having joined the Nato Alliance; Russian towns are coming under regular Ukrainian drone attack; now Ukrainian soldiers are seizing Russian territory.\n\nThrough his choice of language, Vladimir Putin is trying to show the Russian public that there is no need to panic. \n\nWhen referring to the Ukrainian incursion he has avoided using the word \"invasion\". Instead, he has spoken of “the situation in the border area” or “the events that are taking place”. The Kremlin leader has also called the Ukrainian offensive “a provocation”.\n\nWhat will the Russian president do next?\n\nDon’t expect him to pick up the phone and call Kyiv. Russian officials have made it clear that, following the Ukrainian attack, they’re putting the very idea of peace talks on hold. \n\nNot that any large-scale negotiation had been scheduled to take place.\n\nIn fact, this week Vladimir Putin announced exactly what his intention is: “…to force the enemy from Russian territory.”\n\nIt’s one thing saying it. It’s another thing doing it. Despite deploying reinforcements to the Kursk region, the Russian military has yet to regain control in this part of Russia.\n\nAs I was walking past the Kremlin on Thursday morning, I stopped in my tracks.\n\nAs workers were setting up seating and screens for an event, Edith Piaf’s classic Non, je ne regrette rien (No, I regret nothing) was playing on a large video screen and echoing across Red Square.\n\nIt was a very surreal moment.\n\nVladimir Putin has shown no sign of regret for having launched a full-scale invasion of Ukraine.\n\nNo regret for the decisions he has taken since.\n\nIf his public statements reflect his current state of mind, he still believes there is only one possible outcome of this war: Russia’s victory.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "This is Ukraine's boldest and riskiest move this year, where does it go next?Kyiv needs to decide whether to keep its forces in Russia to exert maximum pressure on Moscow or withdraw now.13 Aug 2024Europe",
        "link": "https://www.bbc.com/news/articles/cgrjn828rq2o",
        "date": "No Date",
        "full_content": "Title: This is Ukraine's boldest and riskiest move this year, where does it go next?\nPublished on: No Date\n\nArticle Content:\nUkraine’s Foreign Ministry has announced it has no intention of permanently holding on to the small pocket of Russian territory it has seized over the last week. \n\nBut it still faces a stark choice today - whether to keep its forces there to exert maximum pressure on Moscow or to withdraw now.\n\nBattered daily by Russia’s drones, missiles and glide bombs, its exhausted front-line forces falling slowly back in the Donbas, Ukraine was in dire need of some good news this summer. \n\nWith this extraordinarily bold and well-executed incursion into Russia’s Kursk oblast, it got it.\n\n\"The most striking thing about this incursion,\" said a senior British military source who asked not to be named, \"is how well the Ukrainians mastered combined arms warfare, deploying everything from air defence to electronic warfare as well as armour and infantry. It’s impressive.\"\n\nThe Ukrainians also appear to have used some of the modern Western-supplied weaponry - like the German Marder and other armoured vehicles - rather more effectively than they did in last year’s failed summer offensive to push the Russian army out of Ukraine’s south-eastern provinces.\n\nSo where does Ukraine’s foray into Russia go from here?\n\nThere will be those on the more cautious end of the spectrum who will argue that Ukraine has already made its point, that Putin’s war of choice must now bring some pain to Russians, that despite recent setbacks on the battlefield in the Donbas, Ukraine has shown itself capable of mounting a sophisticated, combined arms assault using all the elements of modern warfare.\n\nIn other words, withdraw now with honour, having given the Kremlin a bloody nose, before Russia brings in enough forces to kill or capture the invading Ukrainians.\n\nBut withdrawal would negate two of the apparent objectives of Ukraine’s incursion, namely to put enough pressure on Russia that it is forced to divert some of its own troops in the Donbas and secondly to hold enough Russian territory to use as a bargaining chip in any future peace negotiations.\n\n\"If Kyiv holds Russian territory,\" says Exeter University’s Dr David Blagden, \"it can bargain for the return of its own territory from a position of greater strength. Kyiv will have also sought to damage the impression of the all-powerful Putin regime among Russians and to encourage the Kremlin to seek a settlement lest they jeopardise their hold on power.\"\n\nOne thing is clear. The presence on Russian soil of foreign forces from Ukraine - a country that President Putin does not even think should exist as an independent nation - is intolerable. \n\nHe will throw everything he can at this problem while simultaneously keeping up the pressure on Ukraine in the Donbas and punishing its people with yet more drone and missile strikes. \n\nHis irritation was plain to see in Russian TV footage of him chairing an emergency meeting in Moscow yesterday.\n\nSo has Ukraine’s gamble paid off?\n\nIt is still too early to say. If its forces stay in place inside Russia’s borders they can expect to come under an ever-increasing ferocity of attacks as Moscow’s reaction creaks into gear. \n\nDr Blagden warns that \"the personnel, equipment and logistics demands of attempting to sustain the incursion then hold the taken territory will be significant, especially as supply lines lengthen.\"\n\nThis has undoubtedly been Ukraine’s boldest move this year. It has also been its riskiest.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Russians tell BBC they are worried and angry at Ukraine incursionThe BBC's Steve Rosenberg in Aleksin meets Russians wondering how Ukraine's incursion could have happened.4 days agoEurope",
        "link": "https://www.bbc.com/news/videos/cgedgzx7xqno",
        "date": "No Date",
        "full_content": "Article content not found"
    },
    {
        "title": "We entered easily, say Ukrainian troops involved in Russia incursionUkrainian troops who entered Russia's Kursk this past week say they took the Russians by surprise.13 Aug 2024Europe",
        "link": "https://www.bbc.com/news/articles/cze5pkg5jwlo",
        "date": "No Date",
        "full_content": "Title: We entered easily, say Ukrainian troops involved in Russia incursion\nPublished on: No Date\n\nArticle Content:\nWhile “Z” might be Russia’s symbol of its invasion, a triangle represents Ukraine’s most audacious attempt to repel it.\n\nThey are taped or painted on the sides of every supply truck, tank, or personnel carrier that heads towards the Russian border in the Sumy region.\n\nIt's an offensive that has seized hundreds of square kilometres of Russian territory and palpably restored momentum and morale to Ukraine’s war effort.\n\nThe Russian official in charge of the border region of Kursk has spoken of 28 settlements under Ukrainian control and almost 200,000 Russians have fled their homes.\n\nTomash has just returned from Ukraine’s cross-border mission along with his comrade “Accord”, who nonchalantly says it was “cool”.\n\nTheir drone unit had spent two days paving the way for the cross border incursion.\n\n“We had orders to come here, but we didn’t know what that meant,” Tomash admits as he pauses for a coffee at a petrol station.\n\n“We suppressed the enemy’s means of communication and surveillance in advance to clear the way.” \n\nExactly how much Russian territory has been seized is uncertain, although there is scepticism over Commander-in-Chief Oleksandr Syrskyi’s claim that 1,000 sq km is under Ukrainian control.\n\nRussia’s defence ministry insisted on Tuesday that Ukrainian attempts to push deeper had been thwarted but they have been proved wrong before.\n\nWhatever the reality, it appears Kyiv is committed to this military gamble.\n\nThe level of activity in the neighbouring Sumy region is something I haven’t seen since the liberations of 2022, when there was a feeling of wind in Ukrainian sails.\n\nIt’s undoubtedly a welcome departure from the grinding war of attrition of the last 18 months, but to label it a success or failure would be premature.\n\nThe goal of this offensive is unclear, although President Volodymyr Zelensky has spoken of targeting sites from which Russia can launch attacks on Ukraine and bringing “a just peace” closer.\n\nBut it is evident Kyiv is deploying some of its best troops.\n\nFit-looking soldiers gather around vehicles that match their muscularity. Most politely decline to talk. Some look exhausted.\n\nOver the Telegram messaging app, a soldier still in Russia tells us months of planning went into forcing Moscow to move troops from other parts of the front line in Ukraine.\n\n“The element of surprise worked,” he says. “We entered easily with little resistance. On 6 August, the first groups crossed at night in several directions.”\n\n“Almost immediately they reached the western outskirts of the city of Sudzha,” he adds.\n\nWith operations like this, secrecy suits the soldiers carrying them out. The same cannot be said for civilians.\n\nOn both sides of the border, tens of thousands are being evacuated after an increase in air strikes and fighting.\n\n“The Russian civilians we encounter don’t resist,” explains the soldier. “We don’t touch them, but they either treat us sharply, negatively, or not at all.”\n\n“They also deceive us about the positions of Russian troops,” he adds.\n\nThe soldiers we speak to confirm that Russian forces have indeed been redeployed from the eastern front line, including the Kharkiv, Pokrovsk and Toretsk directions.\n\nBut none of them are reporting a slowing of Russian advances, yet.\n\nVladimir Putin has promised a “worthy response” to the first capture of Russian territory since World War Two.\n\nBut any fear he intended to spread has not reached the dusty border settlements habitually bombed by his forces.\n\nMisha and his friend Valera pass us in their orange Lada in the village of Stetskivka.\n\n“I want them to take it [Kursk region] and do this!” says Misha, making a twisting gesture with his hands.\n\n“They should take everything, even Moscow!”\n\nIt’s an anger anchored in being on the receiving end of Russia’s relentless full-scale invasion which began in February 2022.\n\n“Russia attacked first, not us,” chimes in Valera with his window down. “Now our guys have responded and shown what we’re capable of. We’d have captured it earlier if we’d had permission.”\n\nUkraine, it seems, finally has the Western green light it had been yearning for to strike across the border.\n\nThe stakes are still dauntingly high, as illustrated by new defences being built on the outskirts of Sumy city.\n\nUntil last week, the area had been fearing a Russian offensive in Ukraine’s north. If Ukraine’s incursion fails, those worries could be realised quickly.\n\nUkrainian forces were, and still are, outnumbered by the Russian aggressors.\n\n“For us to keep hold of this Russian territory we need two things,” writes our Ukrainian soldier on enemy soil.\n\n“More towns like Sudzha under our control, and reserves,” he says.\n\n“Our front line is already bursting at the seams, and it’s not clear where we will get them.”\n\nFor Kyiv, the logic or hope is that Russia is forced to switch focus from fighting on Ukrainian soil to its own.\n\nSome in Ukraine believe this counter-offensive could even boost its position in any future peace negotiations.\n\nIt could equally push talks even further away.\n\nAdditional reporting by Hanna Chornous, Sophie Williams and Anastasiia Levchenko.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Ukrainian artist refuses to let war destroy legacyValerii Kaluiev's son says the new exhibition is a thank you to the people of Bury St Edmunds.2 Aug 2024",
        "link": "https://www.bbc.com/news/articles/c0dme34w792o",
        "date": "No Date",
        "full_content": "Title: Ukrainian artist refuses to let war destroy legacy\nPublished on: No Date\n\nArticle Content:\nA renowned sculptor who fled to Suffolk as bombs dropped on war-torn Ukraine has unveiled a new exhibition as he \"refuses\" to see his life's work reduced to rubble.  \n\nValerii Kaluiev is responsible for helping create some of the most iconic monuments in his homeland, including the 100m (328ft) tall Mother Ukraine statue.\n\nMr Kaluiev, 80, found refuge with his wife at his son Tamik’s home in Bury St Edmunds after fleeing Kyiv in February 2022 when Russia invaded Ukraine.\n\nHe has now unveiled an exhibition at the town's Apex art gallery as a thank you to his new home.\n\nThe artworks on display include a large series of sketches and paintings inspired by Ukraine’s plight, Great Britain, and Bury St Edmunds and its community.\n\nMr Kaluiev is said to have been inspired by St Edmund and has even created a model for a proposed statue of the patron saint which is on display at Moyse’s Hall Museum.\n\nTamik, 40, said his retired dad was inspired to pick up the paintbrush after realising his works could be decimated and erased from the landscapes of his homeland.\n\n“While travelling on the train from Kyiv, my father realised, as a result [of the war], there would be no creativity legacy left,” he said.\n\n“All he created through his life for people to enjoy could be destroyed but he refused to accept there will be nothing left and nobody will know his art anymore.\n\n“And then he started to paint and I could start to see there were quite a few paintings so I asked him what he wanted to do with them.\n\n“He said he’d love to share them with the people of Bury St Edmunds because everyone had been so welcoming and supportive of them.”\n\nThe exhibition, entitled 'My World – Uncompromised: From Ukraine to UK, Through The Eyes Of An Artist', has been brought to life with the help of Bury St Edmunds Town Council, West Suffolk Council’s Heritage Service and The Apex.\n\nThe Friends of Moyse’s Hall Museum group has also played its part, as well as Mayor Diane Hind and Ian Shipp, West Suffolk Council’s cabinet member for leisure.\n\nMr Shipp said: “The war in Ukraine and the circumstances that have led to people having to flee their homes and their country is tragic.\n\n“Valerii and his family have been so welcomed with kindness and support here in west Suffolk that he wanted to give something back to the community.\n\n“I’m delighted that through this partnership we have been able to support him in putting on this free exhibition. I’d urge everyone to come along and experience it.”\n\nThe free display will be available to view at The Apex, in Charter Square, Bury St Edmunds, until 18 August.\n\nFollow Suffolk news on BBC Sounds, Facebook, Instagram and X.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Vehicles to be scrapped under Ulez head to UkraineVehicles donated through London's Ulez scrappage scheme are making the four-day journey to Ukraine.26 Jul 2024England",
        "link": "https://www.bbc.com/news/articles/cd16pej1n2go",
        "date": "No Date",
        "full_content": "Title: Vehicles to be scrapped under Ulez head to Ukraine\nPublished on: No Date\n\nArticle Content:\nA convoy of more than 50 vehicles, many of which were donated through London's Ultra Low Emission Zone (Ulez) scrappage scheme, has set off to deliver aid to Ukraine.\n\nThe fleet, which also included a red London bus, left the Ukrainian Embassy in the capital on Thursday.\n\nIt is expected to take four days to reach Kharkiv in Ukraine's war-torn east.\n\nThe convoy has been loaded with supplies from aid groups based in Berkshire, Oxfordshire and Wiltshire.\n\nThe Ulez scrappage scheme enables  Londoners to claim up to £2,000 for scrapping non-compliant cars.\n\nA partnership between Transport for London (TfL) and the British-Ukrainian Aid charity saw some of the scrapped vehicles donated to the humanitarian cause.\n\nA London bus also joined the convoy, used to transport aid including food, clothing and stretchers.\n\nOnce in Kharkiv, the vehicles will all be distributed to local charities.\n\nThe red bus will be donated to charity Peaceful Heaven of Kharkiv and used to evacuate civilians from hot spots in and around the city.\n\nSteph Wilson from the Help Ukraine Group Support (HUGS), based in Hungerford, Berkshire, said this meant the fleet would be a \"double gift\" to the Ukrainian city.\n\n\"The benefit is the vehicles actually stay out there. It's the gift of the vehicle plus all the humanitarian aid with which they're filled,\" she said.\n\nHUGS, along with a group based in Abingdon, Oxfordshire and the Swindon Humanitarian Aid Partnership (SHAP), has donated some of the supplies being taken to the front line.\n\nMike Bowden, chair and founder of SHAP, said: \"Our laser focus is to maximise the number of vehicles for humanitarian use in Ukraine.\n\n\"Whether evacuating the injured, the elderly or children or delivering food or medical aid, each vehicle will make a real difference to the lives of ordinary Ukrainians and save lives,” he added.\n\nFollow BBC South on Facebook, X (Twitter), or Instagram. Send your story ideas to south.newsonline@bbc.co.uk or via WhatsApp on 0808 100 2240.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "Aid worker marks 500 days in UkraineMichael Betoin from Sheffield says he felt a \"calling\" to help those affected by the conflict.17 Jul 2024South Yorkshire",
        "link": "https://www.bbc.com/news/articles/crgmx42xkrko",
        "date": "No Date",
        "full_content": "Title: Aid worker marks 500 days in Ukraine\nPublished on: No Date\n\nArticle Content:\nA charity worker from Sheffield has said he felt a \"calling\" to help people affected by the war in Ukraine, as he marked his 500th day in the country.\n\nMichael Betoin, from Ecclesall, first took an aid van to Ukraine in 2022, and returned after realising his \"job wasn't done\".\n\nMr Betoin has been living in the north-eastern city of Kharkiv, taking aid south to remote villages near the front line of the conflict with Russia.\n\nThe “exhausted” humanitarian aid worker said he would return to Ukraine to help prepare for the winter after a six-week break.\n\nMr Betoin initially travelled to Kyiv, where he worked with war crimes investigators to clear bomb-damaged apartments.\n\nHe admitted: \"I really just headed off blind, I didn’t know anything about the culture or the country.\"\n\nHe moved on to the city of Kharkiv, 20 miles from the Russian border, working with Ukrainian charity Turbota, which provides aid to people cut off by the war.\n\nHe said: \"I thought I can do something,\" adding it felt like \"a calling to do it and make a difference\".\n\nHe helps carry items including baby and medical supplies, personal hygiene goods and winter clothing.\n\nHaving got \"stuck in and getting to know people\" he soon felt like he was supposed to be there.\n\nMr Betoin said he had heard \"well over 500 explosions\" in Kharkiv and directly witnessed 10.\n\nHe said: \"In Kharkiv it’s gone eerily quiet. For six months we got battered.\"\n\nMr Betoin said it became \"normal for us\" to hear the sound of shelling in the distance, with Ukrainians left with no choice but to \"get on with daily business as usual\".\n\nWhile Mr Betoin said he was \"mentally exhausted\", he was thinking about the “devastating events of no energy and heating” in the winter.\n\nHe described those he was helping as “family”, and said walking away would feel like a \"betrayal\".\n\nBut he insisted he would return to the region after a break.\n\nThe volunteer, who was awarded two medals in the country for \"services to Ukraine\", said he wanted to mark the 500-day milestone by reminding people that the war was still raging.\n\nHe said: \"We fly the flag for Britain, the United States and all the people of the free world and we send the message that we care and we always will.\"\n\nFollow BBC Yorkshire on Facebook, X (formerly Twitter) and Instagram. Send your story ideas to yorkslincs.news@bbc.co.uk.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "7 hrs ago‘I never worked for the Russians’ - punished by Kyiv for being a collaboratorAlmost 2,000 people have been convicted of collaborating with Russia under a new Ukrainian law.7 hrs agoEurope",
        "link": "https://www.bbc.com/news/articles/c0473y0p0ego",
        "date": "No Date",
        "full_content": "Title: ‘I never worked for the Russians’ - punished by Kyiv for being a collaborator\nPublished on: No Date\n\nArticle Content:\n“I don’t deserve to be here at all” is a protestation you would expect to hear from someone in prison. But, as she sits in her maroon overalls, Tetyana Potapenko is adamant that she is not who the Ukrainian state says she is.\n\nOne year into a five-year sentence, she is one of 62 convicted collaborators in this prison, held in isolation from other inmates.\n\nThe prison is near Dnipro, about 300km (186 miles) from Tetyana’s home town of Lyman. Close to the front lines of the Donbas, Lyman was occupied for six months by Russia and liberated in 2022. \n\nAs we sit in the pink-walled room where inmates can phone home, Tetyana explains that she had been a neighbourhood volunteer for 15 years, liaising with local officials  - but that carrying on those duties once the Russians arrived had cost her dearly.\n\nUkrainian prosecutors claimed she had illegally taken an official role with the occupiers, which included handing out relief supplies.\n\n“Winter was over, people were out of food, someone had to advocate,” she says. “I could not leave those old people. I grew up among them.”\n\nThe 54-year-old is one of almost 2,000 people convicted of collaborating with the Russians under legislation drafted nearly as quickly as Moscow’s advance in 2022.\n\nKyiv knew it had to deter people from both sympathising and co-operating with the invaders.\n\nAnd so, in a little over a week, MPs passed an amendment to the Criminal Code, making collaboration an offence - something they had failed to agree on since 2014, when Russia annexed Ukraine’s Crimean peninsula.\n\nBefore the full-scale invasion, Tetyana used to liaise with local officials to provide her neighbours with materials such as firewood.\n\nOnce the new Russian rulers were in place, she says she was convinced by a friend to also engage with them to secure much-needed medicines.\n\n“I didn’t co-operate with them voluntarily,” she says. “I explained disabled people couldn’t access the drugs they needed. Someone filmed me and posted it online, and Ukrainian prosecutors used it to claim I was working for them.”\n\nAfter Lyman was liberated, a court was shown documents she had signed that suggested she had taken an official role with the occupying authority.\n\nShe suddenly becomes animated.\n\n“What’s my crime? Fighting for my people?” she asks. “I never worked for the Russians. I survived and now find myself in prison.”\n\nThe 2022 collaboration law was drawn up to prevent people from helping the advancing Russian army, explains Onysiya Syniuk, a legal expert at the Zmina Human Rights Centre in Kyiv.\n\n“However, the legislation encompasses all kinds of activities, including those which don’t harm national security,” she says.\n\nCollaboration offences range from simply denying the illegality of Russia’s invasion, or supporting it in person or online, to playing a political or military role for the occupying powers.\n\nAccompanying punishments are tough too, with jail terms of up to 15 years.\n\nOut of almost 9,000 collaboration cases to date, Ms Syniuk and her team have analysed most of the convictions, including Tetyana’s, and say they are concerned the legislation is too broad.\n\n“Now people who are providing vital services in the occupied territories will also fall liable under this legislation,” says Ms Syniuk.\n\nShe thinks lawmakers should take into account the reality of living and working under occupation for more than two years.\n\nWe drive to Tetyana's home town to visit her frail husband and disabled son. As we near Lyman, the scars of war are clear.\n\nCivilian life drains away and vehicles gradually turn a military green. Droopy power lines hang from collapsed pylons and the main railway has been swallowed by overgrown grass.\n\nWhile the sunflower fields are unscathed, the town isn’t. It has been bludgeoned by airstrikes and fighting.\n\nThe Russians have now moved back to within nearly 10km (6 miles). We were told they usually start shelling at about 15:30, and the day we visited was no exception.\n\nTetyana's husband, Volodymyr Andreyev, 73, tells me he is “in a hole” - the household is falling apart without his wife, and he and his son only manage with the help of neighbours.\n\n“If I were weak, I would burst into tears,” he says.\n\nHe struggles to understand why his wife is not with him.\n\nTetyana might have received a shorter sentence had she admitted her guilt, but she refuses. “I will never admit that I am an enemy of state,” she says.\n\nBut there have been enemies of state - and their actions have had deadly consequences.\n\nLast autumn, we walked on the bloodstained soil of the liberated village Hroza in the Kharkiv region of eastern Ukraine. A Russian missile had hit a cafe where the funeral of a Ukrainian soldier was taking place - it had been impossible to hold the service while Hroza was under Russian occupation.\n\nFifty-nine people - almost a quarter of Hroza’s population - were killed. We knocked on doors to find children alone at home. Their parents weren’t coming back.\n\nThe security service later revealed that two local men, Volodymyr and Dmytro Mamon, had tipped off the Russians.\n\nThe brothers were former police officers who had allegedly begun working for the occupying force.\n\nWhen the village was liberated they fled across the border with Russian troops, but stayed in touch with their old neighbours - who unwittingly told them about the upcoming funeral.\n\nThe brothers have since been charged with high treason - but are unlikely to be jailed in Ukraine.\n\nThat is broadly the story of Kyiv's battle with collaborators. Those who commit more serious crimes - guiding attacks, leaking military information or organising sham referendums to legitimise occupying forces - are mostly tried in absentia.\n\nThose facing less serious charges are often the ones who end up in the dock.\n\nUnder the Geneva Convention, occupying Russian forces have to allow and provide the means for people to continue living their lives.\n\nJust as Tetyana Potapenko says she tried to do, when troops moved into Lyman in May 2022.\n\nHer case is one of several we have uncovered across eastern Ukraine.\n\nThey include a school principal jailed for accepting a Russian curriculum - his defence, his lawyer says, was that although he had accepted Russian materials, he didn’t use them. And in the Kharkiv region, we heard about a sports stadium manager facing 12 years in prison for continuing to host matches while under occupation. His lawyer says he had only organised two friendly matches between local teams.\n\nIn the eyes of the United Nations (UN), these collaboration convictions breach international humanitarian law. A third of those handed down in Ukraine from the start of the war in February 2022 until the end of 2023 lacked a legal basis, it says.\n\n“Crimes have been carried out on occupied territory, and people need to be held to account for the harm they’ve done to Ukraine - but we’ve also seen the law applied unfairly,” says Danielle Bell, the head of the UN's Human Rights Monitoring Mission in the country.\n\nMs Bell argues that the law doesn’t consider someone's motive, such as whether they are actively collaborating, or trying to earn an income, which they are legally allowed to do. She says everyone is criminalised under its vague wording.\n\n“There are countless examples where people have acted under duress and performed functions to simply survive,” she says.\n\nThis is exactly what happened to Dmytro Herasymenko, who is from Tetyana’s home town of Lyman.\n\nIn October 2022, he emerged from his basement after artillery and mortar fire had subsided. The front line had passed through Lyman, and it was under Russian occupation.\n\n“By that time people had been living without power for two months,” he recalls. Dmytro had worked as an electrician in the town for 10 years.\n\nThe occupying authorities asked for volunteers to help restore power, and he stuck up his hand. “People had to survive,” he says. “[The Russians] said I could work like this or not at all. I was afraid of turning them down and being hunted by them.”\n\nFor Dmytro and Tetyana, the relief of liberation was brief. After Ukraine took back control of the town, officers from the country’s security service - the SBU - brought them in for questioning.\n\nAfter admitting to having provided power to the Russian occupiers, Dmytro was swiftly handed a suspended sentence and banned from working as a state electrician for 12 years.\n\nWe found him at the garage where he now works as a mechanic. Shiny tools reflect his enforced career change. “I can’t be judged in the same way as collaborators who help guide missiles,” he says.\n\nHis protests echoed Tetyana’s. “What can you feel when a foreign army moves in?” she asked. “Fear of course.”\n\nSuch fear is justified. The UN has found evidence of Russian forces targeting and even torturing people supporting Ukraine.\n\n“We’ve had cases of individuals being detained, tortured, disappeared, simply for expressing pro-Ukrainian views,” says the UN’s Ms Bell.\n\nFrom the moment Moscow invaded Crimea in 2014, the definition of being “pro-Russian” changed in the eyes of Ukrainian lawmakers - from simply favouring closer national ties, to supporting a Russian invasion seen as genocidal.\n\nThat same year, Russian proxy forces - funded by the Kremlin - also occupied a third of the Donetsk and Luhansk regions.\n\nIt is often the elderly who choose to, or are forced to, live under occupation. Some may be too frail to leave.\n\nThere will also be those with Soviet nostalgia or sympathy with modern-day Russia.\n\nBut given how Ukraine might one day have to reunite, does the collaboration law come down too hard?\n\nThe message from one MP who helped draw it up is blunt: “You’re either with us, or against us.”\n\nAndriy Osadchuk is the deputy head of the parliamentary committee on law enforcement. He strongly disagrees that the legislation breaks the Geneva Convention, but accepts it needs improvement.\n\n“The consequences are extremely tough, but this isn’t a regular crime. We are talking about life and death,” he says defiantly.\n\nMr Osadchuk believes it is, in fact, international law which has to catch up with the war in Ukraine, not the other way round.\n\n“We need to build Ukraine on liberated territories, and not make someone happy from the outside world,” he says.\n\nThe UN monitoring mission admits there have been some improvements. Ukraine’s prosecutor general has recently instructed his offices to comply with international humanitarian law while investigating collaboration cases.\n\nUkraine’s parliament is also planning to add more amendments to the legislation in September. One suggested change would see some people issued with fines instead of prison sentences.\n\nFor now, Kyiv sees the likes of Tetyana and Dmytro as acceptable recipients of tough justice, if it means Ukraine can finally be free of Russia’s grasp.\n\nThe pair claim they only regret not escaping when the Russians moved in the first time.\n\nBut with the state breathing down their necks and Lyman at risk of falling once more, it’s not clear how candid they can be.\n\nAdditional reporting by Hanna Chornous, Aamir Peerzada and Hanna Tsyba.\n\nAll BBC images by Lee Durant.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "14 hrs agoRussian priests bless fire trucks as huge blaze continues after Ukraine attackMore than 500 firefighters have been tackling the giant blaze at a fuel depot sparked by a Ukrainian attack.14 hrs agoEurope",
        "link": "https://www.bbc.com/news/articles/c9qgyenzwzyo",
        "date": "No Date",
        "full_content": "Title: Russian priests bless fire trucks as huge blaze continues after Ukraine attack\nPublished on: No Date\n\nArticle Content:\nRussian Orthodox priests have visited the scene of a huge fire at a fuel depot, which continues to burn three days after being set alight in a Ukrainian drone attack.\n\nMore than 500 firefighters have been tackling the giant blaze at the Proletarsk oil storage facility in the southern Rostov region.\n\nAbout 20 of 74 storage tanks were on fire, local authorities told the RIA news agency.\n\nOn Wednesday, local Orthodox priests said prayers next to the fire engines and brought an icon to the scene in support of firefighters' efforts.\n\n\"The [priests] spoke with the firefighters and blessed all the fire equipment,\" the local Volgodonsk eparchy - the Russian Orthodox Church equivalent of a diocese - told Reuters news agency.\n\nThey brought with them a large icon of the Unburnt Bush, considered a talisman against fire.\n\nAccording to regional governor Vasily Golubev, air defences shot down the Ukrainian drone on 18 August, but its debris caused diesel fuel to ignite on the territory of the facility.\n\nThe authorities have declared a state of emergency, but the local city administration, quoted by Russian state media, said there was no threat of the fire spreading to residential areas and called on people \"not to give in to panic\".\n\nMr Golubev said 41 firefighters had received medical treatment for the effects of the blaze, including five who had been placed in emergency care.\n\nUkraine has not commented on the strike - but its forces have been targeting Russia's oil infrastructure as part of their efforts to counter Moscow's full-scale invasion, which began in February 2022.\n\nAlso on Wednesday, Ukrainian forces reported striking an S-300 air defence system near the Russian city of Novoshakhtinsk in Rostov region.\n\nThe strike was carried out by the Ukrainian Navy in co-operation with other units, the general staff of the Ukrainian armed forces said on Facebook.\n\n\"Ukraine's defence forces continue to weaken Russian invaders' air defence,\" it said.\n\n\"It is worth noting that Russian invaders also use S-300 systems for strikes on peaceful Ukrainian cities, destroying residential buildings and terrorising civilian population,\" it added.\n\nElsewhere on Russian soil, Moscow said its air defences had shot down 11 Ukrainian drones targeting the city overnight.\n\nThe city's mayor, Sergei Sobyanin, said it was one of the biggest attacks on the Russian capital since the conflict started, but there were no reports of damage or casualties.  \n\nAt the same time, Ukrainian defences reported stopping 50 Russian drones and missiles.\n\n\"The enemy continues to attack our region with strike drones. The air raid lasted all night and into the morning for more than nine hours,\" Kyiv's military administration said on Telegram.\n\nA private house was damaged by falling debris, while power lines were severed, it added.\n\nOn the ground, Ukraine is continuing to hold a swathe of territory in Russia's western Kursk region, following its cross-border incursion that began on 6 August.\n\nIt is the first time that Russian territory has been occupied by a foreign power since World War Two.\n\nIn his video address late on Wednesday, Ukrainian President Volodymyr Zelensky said \"our combat work continues\" in the Kursk region.\n\n\"We control the designated areas,\" he said without providing any details.\n\nIn Russia's adjacent Bryansk region, Governor Aleksandr Bogomaz said an incursion attempt by a Ukrainian reconnaissance group was repelled on Wednesday.\n\nThis comes as Russian forces are continuing to press hard towards the city of Pokrovsk in Ukraine's eastern Donetsk region.\n\nUkraine's officials said earlier this week the Russians were now about 10km (six miles) from the outskirts of Pokrovsk, a key logistics hub in the area.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "14 hrs agoIrish man fighting in Ukraine is reported missingAlex Ryzhuk, who is 20 years old and from Dublin, is presumed dead.14 hrs agoEurope",
        "link": "https://www.bbc.com/news/articles/cwyxp6z22xro",
        "date": "No Date",
        "full_content": "Title: Irish man fighting in Ukraine is reported missing\nPublished on: No Date\n\nArticle Content:\nA man from the Republic of Ireland, who has been fighting in Ukraine against Russian forces, is missing and presumed dead.\n\nAlex Ryzhuk, a 20-year-old Irish citizen born to Ukrainian parents, travelled to Ukraine after turning 18, according to the Irish Times.\n\nMr Ryzhuk, from Dublin, had been serving alongside military forces in east Ukraine as a volunteer, but it is understood he was reported missing in recent weeks.\n\nThe Department of Foreign Affairs said it was aware of the case and was providing consular assistance.\n\n“As with all consular cases, the department does not comment on the details of individual cases,” the department said.\n\nIn an interview with The Irish Times in May, Mr Ryzhuk said that after training in Kyiv he joined the 3rd Separate Assault Brigade, operating as a drone pilot, and was deployed to Bakhmut, Avdiivka and Kharkiv.\n\nIn a recent RTÉ' Prime Time interview, Mr Ryzhuk said he intended to return to Ireland to join the Defence Forces after the war in Ukraine concluded.\n\n\"War is not a joke, death in war is a very high probability,\" he told the programme. \"It is something that constantly happens, even if it's not to you, it's to someone else, or to someone you know.\"\n\nIf confirmed dead, Mr Ryzhuk would be the fourth Irish man to die fighting in the war in Ukraine.\n\nGraham Dale, aged 45, from Raheny in Dublin was killed in December 2023. \n\nFinbar Cafferkey, who was also in his 40s and from Achill Island in County Mayo, died fighting in April 2023.\n\nRory Mason, 23, from Dunboyne in County Meath, died while fighting for Ukraine's International Legion near the Russian border in October 2022.\n\nBBC News NI has asked the International Legion for the Defence of Ukraine for comment.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "22 hrs agoHungary law could make Ukrainian refugees homelessThousands of Ukrainian refugees could be forced on to the streets or back to Ukraine.22 hrs agoEurope",
        "link": "https://www.bbc.com/news/articles/ckg2jxjd7r7o",
        "date": "No Date",
        "full_content": "Title: Hungary law could make Ukrainian refugees homeless\nPublished on: No Date\n\nArticle Content:\nA new law has come into force in Hungary which threatens to push thousands of Ukrainian refugees on to the streets or back to Ukraine.\n\nThe regulation restricts state support for Ukrainians to those who come from parts of Ukraine directly affected by the fighting caused by Russia's invasion. \n\nThirteen regions in Ukraine are on the list, which will be updated monthly by the Hungarian government. \n\nIt is not known how many of the 31,000 Ukrainians taking shelter in Hungary will be affected by the new law. \n\nHuman rights groups say the most vulnerable are those from the Roma ethnic minority from the westernmost Transcarpathian region, who are still living in shelters which will now close. \n\nTheir situation is complicated by the fact that many are dual Ukrainian-Hungarian citizens, who have been refused help elsewhere in the European Union on the grounds they are Hungarian citizens.\n\nThe UN refugee agency said the law change will mean an estimated 2,000-3,000 refugees will \"lose access to subsidised accommodation\".\n\n\"Many face significant barriers in securing alternative housing due to lack of financial means but also reluctance of owners to rent,\" the UNHCR said.\n\n\"For many, the change will result in job losses and impact school enrolment, jeopardizing the positive integration achievements obtained so far.\"\n\nUnder the new law, only Ukrainians whose last official address in Ukraine was in an area \"directly affected by military operations\" remain eligible for state support, which includes free housing and a basic monthly sum. \n\nGovernment decree 134 changes legislation dating back to 2022 and the start of the full-scale Russian invasion of Ukraine. \n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "1 day agoRefugee barber changes lives with mobile haircutsUkrainian Mike Vorobets runs a mobile barber business, offering haircuts and a listening ear.1 day agoNorth Yorkshire",
        "link": "https://www.bbc.com/news/articles/cwyw7nzdygwo",
        "date": "No Date",
        "full_content": "Title: Refugee barber changes lives with mobile haircuts\nPublished on: No Date\n\nArticle Content:\nA barber who fled the war in Ukraine has helped to change lives by running a mobile hairdressing service and offering a listening ear.\n\nMike Vorobets fitted out his van as a travelling salon and gives free cuts to those in need, as well as visiting areas of Scarborough where people might struggle to get to a barber's.\n\nHe has become popular with his customers for supporting them with their mental health challenges.\n\nMr Vorobets said: \"Lots of people around the world have helped Ukrainians and I think if I can help with good haircuts, I feel very good.\" \n\nBack in Ukraine, Mr Vorobets ran a successful barbering business but was forced to move, along with his four children, to Scarborough when war broke out. \n\nHe wanted to use his skills to start a new life for himself and help his community, so kitted the van out with a TV and games console to entertain children.\n\n\"I know kids often don't like the barbers with the seats and the noise so I thought I want to make something special where they can sit and play, meaning the children are happy, parents are happy and I'm happy,\" he said. \n\nAs well as his usual rounds, Mr Vorobets regularly calls at The Rainbow Centre in Scarborough, which works with vulnerable people, including those with additional needs.\n\n\"If I can help these people who have complicated lives, by cutting the price and making their lives easier with a new style, it feels nice. \n\n\"Money is not everything in this life and when you help people, you feel like you can do everything in this world, the feeling is amazing,\" he added. \n\nRegular customer John Edward said he enjoyed having a \"good chat\" with the barber when he was feeling lonely.\n\n\"I suffer from anxiety and don't get out much to integrate with people, but it's nice when Mike comes to see me,\" he said. \n\n\"It's hard for some people to go to a barber shop in town - people with disabilities and children and with anxiety issues like me but this is an incredible idea where he can come to the home.\"\n\nMr Vorobets said he hoped to open a training school for barbers by the end of the year and set up 10 more mobile salons in other areas of Yorkshire.\n\n\"I like being able to make people change in front of my eyes, making them stronger, more beautiful and happier,\" he said. \n\nListen to highlights from North Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here.\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "2 days agoRussian forces claim another town captured in east UkraineUkraine does not confirm the loss of Niu-York, saying Russian forces are attacking near the town.2 days agoEurope",
        "link": "https://www.bbc.com/news/articles/c79wqpqp297o",
        "date": "No Date",
        "full_content": "Title: Russian forces claim another town captured in east Ukraine\nPublished on: No Date\n\nArticle Content:\nRussia's military says it has captured a small town in eastern Ukraine called Niu-York, as part of its push towards big population centres in the Donetsk region. \n\nUkraine's military has not confirmed the loss of Niu-York, saying only that Russian forces are attacking close to the town and other areas. The army was giving the attacks \"a worthy rebuff... and the fighting continues\", it said.\n\nAlthough only a small settlement, controlling Niu-York would represent another step towards the two Donetsk hubs of Toretsk and Pokrovsk.\n\nOne of the aims of Ukraine's seizure of territory in Russia's Kursk region is thought to be to force Russia to move some of its forces away from the eastern campaign. \n\nThere is no indication so far of that happening, despite Ukraine's commander-in-chief Oleksandr Syrskyi now claiming control of 93 Russian villages and towns.\n\nPresident Volodymyr Zelensky described the situation in the east as difficult, but said Ukrainian troops were doing all they could to destroy the Russian forces. The military chief told a briefing that Russia was sending additional troops to the front line in the east.\n\nA Russia defence ministry statement said active operations by units of its Centre forces group had defeated Ukrainian troops, referring to Niu-York as \"one of the largest settlements of the Toretsk agglomeration and a strategically important logistics hub\". It also called the town by the Russian name of Novgorodskoye.\n\nRussian military bloggers shared footage late on Monday of a Russian tricolor flag being posted on the roof of a school in Niu-York with the Ukrainian flag lying on the ground. \n\nHowever, the video first circulated two weeks ago and Ukrainian forces had since blown up the flag and damaged the roof with a drone on 8 August.\n\nNiu-York is just south of the mining town of Toretsk, and Russian forces on Monday said they had also captured Zalizne, to the south-east of Toretsk.\n\nUkrainian forces said they were still fighting back in Zalizne and local sources were quoted as saying they still had control of 20% of Niu-York too, although they had far fewer reserves than the Russians.\n\nOn Monday, Ukrainian authorities ordered the evacuation of Pokrovsk, as Russian forces continue to advance on the town.\n\nAccording to a military briefing on Tuesday, Russia had directed more than a third of its 87 attacks during the day on it push towards Pokrovsk. Local officials say Russia's military is now about 10km (6 miles) from the outskirts of the town.\n\nRegional head Vadym Filashkin has said 53,000 people still live in Pokrovsk, including almost 4,000 children.\n\nUkraine's commander in chief said the counter-offensive in Russia's Kursk region had now advanced 28-35km beyond the border, with 1,263 sq km under Ukrainian control and a total of 93 population centres.\n\nRussian Defence Minister Andrei Belousov said three new military groupings had been formed to counter the Ukrainian operation in three border regions, Kursk, Belgorod and Bryansk.\n\nTheir task would be to protect \"citizens and territories from attacks\" from drones and other and other assault means.\n\nRussian officials have played down the success of the Ukrainian operation in the Kursk region. \n\nMaj Gen Apti Alaudinov, commander of Chechnya’s Akhmat special forces unit, told Russian TV that Ukraine's military had sustained very serious losses.\n\nAsked to respond to reports that three bridges had been blown up over the River Seym, cutting off evacuation and supply routes, he said \"the fact that some bridge has been blown up doesn’t mean anything\".\n\nHowever, state news agency Tass says local police are now having to use privately owned boats to get civilians to safety because bridges are down.\n\nGerman photographer Nanna Heitmann said she had spoken to Russians in the region who were furious that state media were not giving the full picture: \"They're shocked, they are angry. A lot of people wait, thousands of people waiting in lines to find shelter, to find basic needs like blankets, pillows etc.\"\n\nRussia's Vladimir Putin, who has appeared wrong-footed by the Ukrainian offensive, compared it on Tuesday to a 2004 school massacre by Chechen militants in Beslan where more than 300 people were killed.\n\nOn a visit to the school and to mothers of the victims in North Ossetia, he said \"just as we fought with terrorists previously, now we fight with those who commit crimes in Kursk region, Donbas and Novorossiya\", using an old Russian imperial term for areas of occupied Ukraine.\n\nAdditional reporting by BBC Verify\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "3 days agoUkraine orders evacuation of city as Russia gainsOfficials said families with children living in Pokrovsk and surrounding villages would be forced to leave.3 days agoEurope",
        "link": "https://www.bbc.com/news/articles/cr40wwzd4gyo",
        "date": "No Date",
        "full_content": "Title: Ukraine orders evacuation of city as Russia gains\nPublished on: No Date\n\nArticle Content:\nUkrainian authorities have ordered the evacuation of a key city in the Donbas region as Russian forces continue to make gains in the east of the country, despite Ukraine's ongoing offensive into Russia's Kursk region. \n\nOfficials said families with children living in Pokrovsk and surrounding villages would be forced to leave. \n\nThe head of the city's military government, Serhii Dobriak, said residents had at most two weeks to flee the Russian advance. \n\nThe strategically important city is one of Ukraine's main defensive strongholds and a key logistical hub for Kyiv's troops on the eastern front. \n\nDonetsk region head Vadym Filashkin said over 53,000 people, including almost 4,000 children, remained in the city. \n\nHe said authorities had taken the decision to forcibly evacuate children and their parents or guardians.\n\n\"When our cities are within range of virtually any enemy weapon, the decision to evacuate is necessary and inevitable.\"\n\nMr Dobriak said the rate of evacuations from the city had risen to about 500 to 600 people a day. He said that while basic services continued to operate, they would likely soon cease to function as the Russian army closes in. \n\nThe evacuation order came even as Ukrainian President Volodymyr Zelensky said his forces were continuing to make gains during their incursion of Russia's Kursk region. \n\nOn Monday, President Zelensky said Ukraine had gained control of over 1,250 sq km of Kursk’s territory and 92 settlements.\n\n\"The Russian border area opposite our Sumy region has been mostly cleared of Russian military presence,\" he said on X. \n\n\"A few months ago, many people around the world would have said this was impossible and crossed Russia’s strictest 'red line',\" he added.\n\nOne of the aims of the incursion is reportedly to divert Russia's troops away from the Donbas region, relieving pressure on beleaguered Ukrainian troops there. \n\nOn Monday, Russian military bloggers claimed Ukraine had blown up a third bridge over the River Seym in the Kursk region. Kyiv did not claim responsibility but the destruction of the bridge would likely further hinder Russian military logistics and help Ukraine consolidate its control over the territory it has seized from Moscow. \n\nBut BBC Verify has identified new pontoon bridges - temporary, floating crossings, quickly constructed and used in the absence of permanent structures - over the river, apparently constructed by Russian forces.\n\nIn these satellite images taken on Saturday, the two recently built crossings, near Glushkovo, can be seen.\n\nThe Institute for the Study of War (ISW) think tank said that while Russia appeared committed to a strategy of \"gradual creeping advances\" in the east, Ukraine's surprise advance into Kursk showed that seizing the initiative had allowed Kyiv to make significant gains rather than slowly losing a \"war of attrition\".\n\nThe ISW said it had assessed Ukraine to be present across 800 sq km of Russian territory, though it added that presence did not necessarily equate to control. By contrast, the think tank estimates that Russia gained about 1,175 sq km between January and July. \n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "3 days agoUK insists support for Ukraine is 'unwavering'Volodymyr Zelensky says UK support has \"slowed down\" as he repeats plea for long-range missile capability.3 days agoEurope",
        "link": "https://www.bbc.com/news/articles/c6248gpjpz7o",
        "date": "No Date",
        "full_content": "Title: UK insists support for Ukraine is 'unwavering'\nPublished on: No Date\n\nArticle Content:\nThe government’s support for Ukraine is \"unwavering\", Downing Street has insisted after Ukrainian President Volodymyr Zelensky suggested UK backing had \"slowed down\".\n\nOver the weekend, Mr Zelensky said Ukraine needed partners \"who can truly help to step up\". \n\nHe also repeated his call for Ukraine to be allowed to use long-range missiles, donated by Western allies, against targets inside Russia. \n\nNo 10 said the prime minister was \"resolute\" in his support for Ukraine, adding that the UK had committed £3bn a year to help its ally. \n\nA spokeswoman said there had been \"no change\" in the UK's position on how Ukraine could use long-range missiles but added there was \"ongoing dialogue\".\n\nDowning Street's comments come almost two weeks after Ukraine launched a shock incursion into Russia's western border territories, advancing 18 miles into the Kursk region.\n\nIn a message posted to social media on Saturday, Mr Zelensky said the \"bravery\" and \"resilience\" of his soldiers \"compensate for the lack of essential decisions from our partners\". \n\nThe Ukrainian president has previously urged the British government to let him use long-range Storm Shadow missiles, provided by the UK, against targets inside Russia. \n\nOn Saturday he reiterated this call saying: \"It is crucial that our partners remove barriers that hinder us from weakening Russian positions in the way this war demands.\n\n\"Long-range capabilities are the answer to the most critical strategic questions of this war.\"\n\nHe added that throughout the war, which started in 2022, the UK had \"demonstrated leadership\" in its support for Ukraine.\n\nHowever, he added: \"Unfortunately, the situation has slowed down recently. We will discuss how to fix this because long-range capabilities are vital for us.\"\n\nSince Russia's invasion of Ukraine, the UK has been one of the country's leading donors, pledging £12.5bn, including £7.6bn for military assistance.  \n\nThe UK has previously said Ukraine has a \"clear right\" to use UK-provided weapons for \"self defence\" and that \"does not preclude operations inside Russia\".\n\nThe stance means anti-tank missiles, artillery and armoured vehicles can be used as part of Ukraine's offensive in Russia. \n\nHowever, there is still an exception for the use of Storm Shadow missiles, which were supplied on the understanding they would not be used for targets inside Russia. \n\nStorm Shadow missiles have a range of more than 150 miles meaning Ukrainian pilots can use them while staying away from the front line of the conflict.\n\nSo far, Ukraine's other Western allies have also avoided giving Kyiv the green light to use their long-range missiles to strike targets inside Russia.\n\n\n\nAsked about Mr Zelensky's comments, No 10 said: \"The prime minister remains absolutely resolute in his support for Ukraine.\n\n\"On the latest situation, including in Kursk, the prime minister wants to set out his full admiration for the bravery shown by Ukrainian soldiers who have once again proved their spirit and determination in the face of continued Russian aggression.\n\n\"It is a reminder that Ukraine has consistently exceeded expectations of what is possible and Russia continues to fail.\n\n\"But in terms of our support, again, it is unwavering. That's why we committed to £3bn a year in support for Ukraine to do that for as long as it (the war) lasts.\"\n\nPressed on whether the government would lift restrictions on how Ukraine can use the UK-donated Storm Shadow missiles, No 10 said there had been \"no change in the UK's position on that specifically\".\n\nThe spokeswoman added that the UK has \"an ongoing dialogue with our allies about a co-ordinated effort between us all to do the same thing and be united in our support for Ukraine\".\n\nImage URL: /bbcx/grey-placeholder.png"
    },
    {
        "title": "3 days agoUkraine says it has destroyed second Russian bridgeUkrainian forces continue their incursion into Russia's Kursk region, claiming destruction of a second bridge.3 days agoEurope",
        "link": "https://www.bbc.com/news/articles/c5y36rdreq1o",
        "date": "No Date",
        "full_content": "Title: Ukraine says it has destroyed second Russian bridge\nPublished on: No Date\n\nArticle Content:\nUkraine says it has destroyed a second strategic bridge in a week as it continues its incursion into Russia's Kursk region. \n\nThe Ukrainian military on Sunday released aerial footage of the strike on the bridge - reported to be over the Seym River in Zvannoe.\n\nHours later, Ukrainian President Volodymyr Zelensky said for the first time that the aims of the military incursion into Kursk included the creation of a \"buffer zone\" to stop Russian attacks.\n\nUkraine is nearly two weeks into its biggest attack on Russian territory since Moscow launched its invasion of Ukraine in 2022. \n\n\"Minus one more bridge,\" Ukrainian Air Force commander Lt Gen Mykola Oleschuk posted on social media with footage of the strike. \n\nGen Oleschuk added: \"Ukrainian Air Force aviation continues to deprive the enemy of logistical capabilities with precision airstrikes, which significantly affects the course of hostilities.\"\n\nThe video shows a growing large cloud of smoke over the bridge and one of its sections appears to be destroyed. It is not clear when the strike took place. \n\nEarlier this week, Ukraine destroyed another bridge over the river Seym, near the town of Glushkovo. \n\nThat bridge was used by the Kremlin to supply its troops. \n\nEarlier, military analysts had identified three bridges in the area used by Russia to supply its forces, and they said two had either been destroyed or seriously damaged, Reuters news agency reported.\n\nAlmost two weeks after Ukrainian troops pushed across the border into Russia, it is becoming clear that they plan to stay.\n\nPresident Zelensky said on Saturday his troops were strengthening positions in Kursk and expanding further in Russia.\n\nOn Sunday in an evening address, he said: \"Our operation in the Kursk region is still inflicting losses on the Russian army and the Russian state, their defence industry and their economy.\"\n\nHe stated that \"this is more than just defence for Ukraine\" and said that the aim was to \"destroy as much Russian war potential as possible and conduct maximum counteroffensive actions\". \n\nThis would include \"creating a buffer zone on the aggressor’s territory\", he added, in an effort to prevent further Russian attacks into Ukraine.\n\nMykhaylo Podolyak, an adviser to President Zelensky, insisted Ukraine was not interested in occupying Russia but wanted to persuade Russia to enter negotiations.  \n\nMoscow has called the incursion a major provocation and vowed to retaliate with a \"worthy response\".\n\nAs Ukraine moves further into western Russian territory, Russian forces are equally making gains in Ukraine's east and have claimed a string of villages in recent weeks.\n\nIt comes as the head of the UN's nuclear watchdog warned the nuclear safety situation at the Zaporizhzhia power plant in Russian-occupied Ukraine was deteriorating, following a drone strike near the site's perimeter.\n\nRafael Grossi, head of the International Atomic Energy Agency (IAEA), said he remained \"extremely concerned\" and called for \"maximum restraint from all sides\" to protect the plant.\n\nThe agency said the impact of the strike was on a road just outside the facility - close to essential water sprinkler ponds and about 100m from the only remaining high-voltage line. \n\nThe plant was seized by Russia's forces early in the war and has come under repeated attacks which both sides have blamed the other for. \n\nLast week, Kyiv and Moscow traded blame after a fire broke out in one of the plant's cooling towers.\n\nThe IAEA did not say who carried out Saturday's strike, but its team stationed at Zaporizhzhia said the damage seemed to have been caused by a drone carrying an explosive.\n\n\"The team has heard frequent explosions, repetitive heavy machine gun and rifle fire and artillery at various distances from the plant,\" the agency said in a statement.\n\nThe plant has not produced power in more than two years and all six reactors have been in cold shutdown since April.\n\nRussia launched a full-scale invasion of its neighbour in February 2022 and has been making slow progress recently in seizing more territory in eastern Ukraine.\n\nHowever, it was shocked when Ukrainian troops penetrated into its Kursk region where they have been consolidating positions for nearly two weeks. \n\nThousands of Russians have been evacuated from the area.\n\nIt is the first time foreign troops have been on Russian soil since World War Two.\n\nImage URL: /bbcx/grey-placeholder.png"
    }
]