[
    {
        "title": "Air defense activated near Kyiv amid air raid alert",
        "link": "https://www.ukrinform.net/rubric-ato/3897156-air-defense-activated-near-kyiv-amid-air-raid-alert.html",
        "date": "2024-08-21T06:20:00",
        "image_url": "https://static.ukrinform.com/photos/2024_03/thumb_files/360_240_1711100483-822.jpg",
        "summary": "Air defense units are engaging incoming targets on the approaches to the Ukrainian capital.\n",
        "full_content": "Title: No Title\nPublished on: 21.08.2024 06:20\n\nArticle Content:\nThat’s according to the municipal military administration, Ukrinform reports.\n\n\"The air raid alert remains in place! In the region, on the approaches to Kyiv, air defense is active,\" wrote the head of the administration, Serhiy Popko.\n\nIn most regions, including Kyiv, an air alert has been declared after a barrage of Russian attack drones was spotted in the Ukrainian airspace.\n\nAs reported, earlier this night, air defense forces were engaging enemy drones over Kyiv region.\n\nIllustrative photo: 126th Separate Territorial Defense Brigade\n\nImage URL: https://static.ukrinform.com/photos/2024_03/thumb_files/630_360_1711100483-822.jpg"
    },
    {
        "title": "Russian serviceman blows up headquarter with Stormtrooper officers and defects to Ukraine - DIU",
        "link": "https://www.ukrinform.net/rubric-ato/3897023-russian-serviceman-blows-up-headquarter-with-stormtrooper-officers-and-defects-to-ukraine-diu.html",
        "date": "2024-08-21T04:26:00",
        "image_url": "https://static.ukrinform.com/photos/2024_08/thumb_files/360_240_1724158272-890.jpeg",
        "summary": "As a result of a special operation by the I Want to Live project and the \"Freedom of Russia\" Legion, a Russian serviceman blew up the headquarters of the \"Storm Zet\" battalion officers and defected to Ukraine.\n",
        "full_content": "Title: No Title\nPublished on: 21.08.2024 04:26\n\nArticle Content:\nThis was reported by the Defence Intelligence of Ukraine, Ukrinform reports.\n\n\n\n\n\nThe special operation was called \"Ocheret\".\n\n\n\n\n\nThis winter, a Russian FPV pilot with the call sign \"Silver\" reportedly contacted the \"Freedom of Russia\" Legion. The Russian explained his decision to cooperate with Ukraine by the systematic war crimes and other crimes committed by his command, including extrajudicial executions, beatings and extortion in the invading unit.\n\n\n\n\n\nAs part of its cooperation with the Russian serviceman, Ukraine was able to obtain valuable intelligence on the location, number and intentions of the enemy in a particular area of the frontline.\n\n\n\n\n\nAt a convenient moment, \"Silver\" threw a grenade into the ventilation hole in the basement of the \"Storm Zet\" unit's headquarters, where his commander and other Russian officers were sleeping. In total, there were about 15 people in the basement.\n\n\n\n\n\n\"In this room, there was a pipe right above the bed where the commander was sleeping. It went out into the street next to the entrance, and we decided to throw a grenade or two into this pipe so that they would explode next to them,\" Silver said.\n\n\n\n\n\nAfter the case was completed, the Russian fled via a pre-arranged route and crossed into Ukrainian-controlled territory. Later, he became a recruit of the \"Freedom of Russia\" Legion.\n\n\n\n\n\nAs reported, I Want to Live is a state programme of the Coordination Headquarters for the Treatment of Prisoners of War. It has been operating since August 2022. The aim of this project is to help Russian servicemen voluntarily surrender. Any Russian military can take part.\n\n\n\n\n\nAs of June this year, more than 300 Russian servicemen have surrendered thanks to the I Want to Live project.\n\nImage URL: https://static.ukrinform.com/photos/2024_08/thumb_files/630_360_1724158272-890.jpeg"
    },
    {
        "title": "Russian drone kills man in Kherson region's Zmiivka",
        "link": "https://www.ukrinform.net/rubric-ato/3897131-russian-drone-kills-man-in-kherson-regions-zmiivka.html",
        "date": "2024-08-20T23:37:00",
        "image_url": "https://static.ukrinform.com/photos/2024_05/thumb_files/360_240_1716792679-602.jpg",
        "summary": "Russian forces have attacked the village of Zmiivka in the Kherson region with a drone, killing a local man.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 23:37\n\nArticle Content:\nOleksandr Prokudin, head of the region's military administration, said this in a post on the Telegram messaging app, Ukrinform reports.\n\nThe regional governor said the invaders were shelling Kherson and the region from morning to night, attacking civilians with drones.\n\n\"Today alone, there are nine victims, three of them are children. The situation in river areas is the most critical,\" he said.\n\nImage URL: https://static.ukrinform.com/photos/2024_05/thumb_files/630_360_1716792679-602.jpg"
    },
    {
        "title": "Four injured as Russian drone attacks Antonivka in Kherson region",
        "link": "https://www.ukrinform.net/rubric-ato/3897129-found-injured-as-russian-drone-attacks-antonivka-in-kherson-region.html",
        "date": "2024-08-20T23:13:00",
        "image_url": "https://static.ukrinform.com/photos/2023_08/thumb_files/360_240_1691501539-292.jpg",
        "summary": "Russian troops have struck the village of Antonivka in Ukraine's southern Kherson region with a drone, injuring four civilians.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 23:13\n\nArticle Content:\nThe Kherson Regional Prosecutor's Office announced this on Facebook, Ukrinform reports.\n\nAccording to the investigation, the enemy attack occurred at around 17:40 on Tuesday. The Russians dropped explosives from a drone near a store.\n\nThe explosion injured four locals, and three of them were hospitalized. One victim was treated at the scene.\n\nLaw enforcement officers have opened criminal proceedings over the violation of the laws and customs of war (Part 1 of Article 438 of the Criminal Code of Ukraine). An investigation is underway.\n\nImage URL: https://static.ukrinform.com/photos/2023_08/thumb_files/630_360_1691501539-292.jpg"
    },
    {
        "title": "Fragments of drone found in Romania near border with Ukraine",
        "link": "https://www.ukrinform.net/rubric-ato/3897133-fragments-of-drone-found-in-romania-near-border-with-ukraine.html",
        "date": "2024-08-20T22:58:00",
        "image_url": "https://static.ukrinform.com/photos/2022_09/thumb_files/360_240_1663950257-687.jpg",
        "summary": "The Romanian Defense Ministry announced on Tuesday that fragments of a drone had been found near the border with Ukraine.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 22:58\n\nArticle Content:\nThe ministry said this in a statement, Ukrinform reports, citing Radio Free Europe/Radio Liberty.\n\nAccording to the statement, experts carried out investigations on Tuesday, August 20, in an area near the town of Periprava, Tulcea county. The investigation team picked up the evidence from the scene, for their expertise.\n\nThe Romanian Defense Ministry said it informed NATO structures in real time about the situations caused by the attacks, remaining in permanent contact with them.\n\n\"We also reiterate our strong condemnation of the attacks carried out by the Russian Federation on some targets and elements of the Ukrainian civil infrastructure, which are unjustified and in serious contradiction with the norms of international law,\" the Romanian Defense Ministry said.\n\nIllustration photo: mil.gov.ua\n\nImage URL: https://static.ukrinform.com/photos/2022_09/thumb_files/630_360_1663950257-687.jpg"
    },
    {
        "title": "Boy wounded in Russian shelling of cafe in Zaporizhzhia region dies",
        "link": "https://www.ukrinform.net/rubric-ato/3897126-boy-wounded-in-russian-shelling-of-cafe-in-zaporizhzhia-region-dies.html",
        "date": "2024-08-20T22:45:00",
        "image_url": "https://static.ukrinform.com/photos/2024_08/thumb_files/360_240_1724176824-480.jpg",
        "summary": "A 15-year-old boy who was wounded in a Russian attack on a children's cafe in the village of Malokaterynivka, Zaporizhzhia region, on August 20 has died during resuscitation.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 22:45\n\nArticle Content:\nThe Prosecutor General's Office announced this on Facebook, Ukrinform reports.\n\nAccording to the investigation, on August 20, at around 17:40, Russian troops shelled the suburbs of Zaporizhzhia.\n\nAn 18-year-old girl and four children aged 11, 14, 15 and 17 were wounded after an enemy projectile hit a recreation facility located near the playground of the village of Malokaterynivka, Zaporizhzhia district.\n\n\n\n\n\nAccording to prosecutors, a 15-year-old boy died during resuscitation.\n\n\"This is yet another inhumane Russian crime. We will not stop until the perpetrators of this criminal aggression are brought to justice,\" Prosecutor General Andriy Kostin said.\n\nAccording to the report, the Zaporizhzhia Regional Prosecutor's Office has launched a pre-trial investigation over the violation of the laws and customs of war (Part 2 of Article 438 of the Criminal Code of Ukraine).\n\nImage URL: https://static.ukrinform.com/photos/2024_08/thumb_files/630_360_1724176824-480.jpg"
    },
    {
        "title": "14-year-old boy wounded in enemy shelling of Kherson",
        "link": "https://www.ukrinform.net/rubric-ato/3897123-14yearold-boy-wounded-in-enemy-shelling-of-kherson.html",
        "date": "2024-08-20T22:22:00",
        "image_url": "https://static.ukrinform.com/photos/2022_06/thumb_files/360_240_1654768443-794.jpg",
        "summary": "Russian forces have shelled the Dniprovskyi district of Kherson, wounding a 14-year-old boy.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 22:22\n\nArticle Content:\nThe Kherson Regional Military Administration said this in a post on Telegram, Ukrinform reports.\n\n\"A 14-year-old boy suffered a blast injury and injuries to his torso and legs. He was hospitalized,\" the post said.\n\nAccording to the military administration, doctors are providing him with all the necessary assistance.\n\nImage URL: https://static.ukrinform.com/photos/2022_06/thumb_files/630_360_1654768443-794.jpg"
    },
    {
        "title": "Ukrainian president visits wounded soldiers in Kropyvnytskyi",
        "link": "https://www.ukrinform.net/rubric-ato/3897113-ukrainian-president-visits-wounded-soldiers-in-kropyvnytskyi.html",
        "date": "2024-08-20T22:00:00",
        "image_url": "https://static.ukrinform.com/photos/2024_08/thumb_files/360_240_1724166074-9764.jpeg",
        "summary": "Ukrainian President Volodymyr Zelensky visited wounded defenders in Kropyvnytskyi and presented them with state awards.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 22:00\n\nArticle Content:\nThe head of state announced this on his Facebook page, Ukrinform reports.\n\n\"It is always a special honor for me to speak with our warriors. Today, I visited one of the hospitals in Kropyvnytskyi where our defenders are recovering from their injuries and presented them with state awards,\" Zelensky said.\n\n\n\n\n\nVideo: Office of the President of Ukraine\n\nHe thanked the warriors for defending Ukraine, its freedom and independence.\n\n\"We are all immensely proud of you,\" Zelensky said.\n\n\n\n\n\nAccording to the presidential website, Zelensky visited a hospital in Kropyvnytskyi that provides medical, psychological and rehabilitation assistance to military personnel, their families and internally displaced persons.\n\nThe head of state inspected the renovated surgical unit, the reconstruction of which was completed last month, adding nine operating rooms.\n\nImage URL: https://static.ukrinform.com/photos/2024_08/thumb_files/630_360_1724166074-9764.jpeg"
    },
    {
        "title": "Ukraine Latest: Weekly Digest for August 12-18",
        "link": "https://www.ukrinform.net/rubric-ato/3897122-ukraine-latest-weekly-digest-for-august-1218.html",
        "date": "2024-08-20T21:38:04",
        "image_url": "https://static.ukrinform.com/photos/2020_05/thumb_files/360_240_1590651594-565.jpg",
        "summary": "Ukrainian military mounted a massive long-range drone attack on four different military airfields in Russia\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 21:38\n\nArticle Content:\nVIDEO\n\nAugust 12/ Dutchak: The Kursk region is historically Ukrainian land, but Ukraine never claims what doesn’t belong to it\n\nAugust 12/ Lyashko: New competition for a contract to restore Okhmatdyt: when?\n\nAugust 13/ Hetman: Russia was certain we were preparing for a defensive in Sumy Oblast\n\nAugust 14/ Dutchak: Defense of Ukraine is in good hands - Azov Battalion has compiled an updated curriculum for high school students\n\nAugust 14/ Seleznyov: The Kursk operation will secure Sumy Oblast and residents\n\nAugust 15/ Pekhno: A total of around two thousand Russian soldiers have surrendered since the start of Kursk incursion\n\nAugust 16/ Consolidated by war: Krasnenkova: Ukrainians in Ireland are waiting for the end of hostilities to get back home\n\nAugust 16/ Bratchuk: The adversary isn’t seen redeploying any of its combat units from Donbas front towards Kursk\n\nPHOTO\n\nAugust 12/ Front-line town of Kramatorsk\n\nAugust 12/ Ukrainian soldiers farewelling their loved ones at Kramatorsk central station as they depart on deployment\n\nAugust 13/ Gunners from the Prince Kostyantyn Ostrozky 30th OMBr at combat work  \n\nAugust 14/Ukrainian soldier from the 24th Separate Motorized Brigade loading his mortar on Chasiv Yar front line\n\nAugust 14/ Preliminary clean-up operation at the site of apartment blocks destroyed by a Russia airstrike, Dnipro City\n\nAugust 14/Kamyanka village, the Kharkiv region\n\nAugust 15/ Construction site of an underground school, the Zaporizhzhia region\n\nAugust 15/ A stabilization point, Donetsk front line\n\nAugust 15/ Soldiers from motorized rifle battalion, 93rd Brigade, Armed Forces of Ukraine in combat position\n\nAugust 15/ The aftermath of a Russian missile strike on a supermarket in Kostyantynivka, Donetsk Oblast\n\nAugust 16/ The town of Sudzha, Kursk Oblast\n\nAugust 16/ Stela at the entrance to the front-line Orihiv District\n\nAugust 17/ Inauguration ceremony for the photo display titled \"Don't be Silent\", Vinnytsia City\n\n\n\nHOSTILITIES\n\nThe General Staff has reported 972 frontline engagements over the week from August 12 through 18.\n\nThe Security Service of Ukraine, supported by the Defense Forces (Special Operations Forces, the Armed Forces’ Center for Unmanned Systems, the Main Intelligence Directorate at the Ministry of Defense (GUR) and other military branches) mounted most massive attacks with long-range drones on several military airfields in Russia since the inception of the all-out war in February 2022. The attacks targeted four different military air bases, namely Khalino, Savasleyka, Borisoglebsk, and Baltimore, located, respectively, in the Russian regions of Voronezh, Kursk, and Nizhny Novgorod overnight on August 14. The aftermath of the attack is being verified.\n\nThe Ukrainian flag flies over the currently Russian held Kinburn Spit, planted by GUR soldiers at the end of a special operation on August 9.\n\nGUR units destroyed or damaged a total of 18 Russian Navy watercraft in the Black Sea using Ukrainian-made MAGURA V5 marine drones over the past 18 months.\n\nRussia’s Kasta radar station deployed in the Zaporizhzhia region was destroyed in a joint operation by the SBU Counter-Intelligence and the Defense Forces.\n\n***\n\nKursk Incursion\n\nAugust 12\n\nUkrainian Armed Forces Chief Commander, Oleksandr Syrsky reported that the Ukrainian army had held around 1,000 square kilometers in Russia’s Kursk region under its control as of August 12.\n\nChina is closely monitoring the situation in Russia’s Kursk region and urges both parties to de-escalate.\n\nU.S. Republican Senator Lindsey Graham called Ukraine's shock cross-border operation into Russia's Kursk region \"brilliant\", “beautiful”, and \"bold\" in a visit to Kyiv on Monday, and he urged the Biden administration to provide Ukraine with the weapons it needs.\n\nAleksey Smirnov, the interim governor of Russia’s Kursk region, bordering Ukraine to the south, said at a meeting with Putin that 28 villages and towns in the region had been under Ukrainian military control as of August 12.\n\nAugust 13\n\nThe Ukrainian military holds control of a total of 74 communities in the Kursk region. \n\nJohn Kirby, White House National Security Communications Advisor, has said that Vladimir Putin could pull his troops out of Ukraine and end the war if he is really concerned about the situation in Kursk Oblast.\n\nHeorhiy Tyhiy, the spokesman for the Ministry of Foreign Affairs, speaking at a news briefing, said that Ukraine’s military incursion into the Kursk region is not aimed to capture foreign territories, but to preserve the lives of our people and to secure Ukrainian territory from Russian attacks. “These actions by Ukraine are fully legitimate, and the Ukrainian army does not violate international humanitarian law”, he said.\n\nUkraine has been able to capture as much of the adversary’s territory in just 10 days as the Russian army has occupied in Ukraine since early 2024.\n\nPolish Prime Minister Donald Tusk called Ukraine’s Kursk incursion “a defensive action”.\n\nAugust 14\n\nUkraine’s military incursion into Russia has \"created a real dilemma\" for Russian President Vladimir Putin, President Joe Biden said on Tuesday, adding that U.S. officials are in constant touch with the Ukrainians about the move.\n\nCommander-in-Chief of Ukraine’s Armed Forces, Oleksandr Syrsky reported that the Armed Forces had advanced \"from one to two kilometers into different parts of the Kursk region and captured over a hundred Russian soldiers since the start of the day\".\n\nRussia has pulled part of its troops out of Ukraine to defend Russian territory against the cross-border assault.\n\nUkrainian President Zelensky hosted a meeting addressing the possibility for representatives of the International Committee of the Red Cross, the UN and other impartial international organizations to enter the \"buffer (sanitary) zone\" the Ukrainian army has created in the parts of the Kursk region it controls.\n\nThe Verkhovna Rada Commissioner for Human Rights, Dmytro Lubinets had a talk (requested by the Russian side – ed.) with his Russian counterpart, Tatiana Moskalkova to discuss potential exchanges of war prisoners as the Ukrainian military continues with its offensive operation into the Kursk region.\n\nAugust 15\n\nSince the start of the day, Ukrainian troops had advanced from 500 meters to 1.5 kilometers deep into the Kursk region, repelled three counterattacks and continued advancing further.\n\nThe Armed Forces have had 82 communities in Russia’s Kursk region under their control: Syrsky.\n\nAt a meeting at the Supreme Commander-in-Chief Headquarters, General Syrsky reported that a military commander’s office has been set up in the Ukraine captured part of the Kursk region, with Major General Moskalyov appointed as the commandant. The mission assigned to the new office is to maintain law and order and provide for the essential needs of communities under Ukrainian military control.\n\nCivilians willing to evacuate from the Kursk region can do so using a humanitarian corridor to Sumy City.\n\nAugust 16\n\nRussia has begun withdrawing some troops from Ukraine in an effort to repel Ukraine’s offensive into the Russian territory and prevent further advances.\n\nThe Ukrainian military have destroyed a bridge over the Seim River located in the village of Hlushkovo, Kursk Oblast.\n\nAugust 17\n\nAt a meeting with President Zelensky, the Armed Forces Chief Commander, Oleksandr Syrsky reported that invading Ukrainian forces have been gaining ground in the Kursk region and expending the area of stabilized territory.\n\nAugust 18\n\nAnother one of the bridges over the Siem River in Russia’s Kursk region was destroyed by a Ukrainian airstrike.\n\nSoldiers from the Halych 80th Separate Ground Assault Brigade seized Russia’s newest T-90M Proryv (“breakthrough\") MBT in a raid into Kursk.\n\nFrontline situation by days of the week and sectors of the front line\n\nAugust 12\n\nKharkiv Sector: the enemy mounted three assaults targeting the approaches to Tykhe and Vovchansk neighborhoods.\n\nLyman Sector: the adversary mounted 17 assaults on Ukraine’s defending positions located in the areas of Makiivka, Nevske, Terny, and Torske, which all ended without success.\n\nSiversk Sector: The day saw three combat encounters, with the invading forces vainly seeking to advance closer towards Verkhnyokamyanske and Spirne communities.\n\nToretsk Sector: The enemy intensified the number of attacks to reach eight per that day, continued advancing towards Zalizne and Toretsk communities.\n\nPokrovsk Sector: the Russian invading forces were assaulting towards Kalynove, Sukha Balka, Elizavetivka, Zelene Pole, Novooleksandrivka, Hrodivka, Mykolaivka, Zhelanne, and Skuchne communities.\n\nAugust 13\n\nRussia’s fighter bombers dropped multiple guided aerial bombs targeting Ukrainian defenses in Pokrovsk and Toretsk sectors of the front line.\n\nPokrovsk Sector: the invading forces were attacking towards Sukha Balka, Vozdvyzhenka, Novooleksandrivka, Elizavetivka, Zelene Pole, Malynivka, Hrodivka, Zhelanne, and Skuchne communities. Ukrainian defenders were able to contain the enemy’s offensive, having fended off 22 attacks.\n\nKharkiv Sector: the adversary mounted 12 offensive attacks targeting Lyptsi, Hlyboke, Tykhe, and Vovchansk neighborhoods.\n\nSiversk Sector saw five combat encounters over the day. The adversary was struggling to advance towards Spirne and Verkhnyokamyanske neighborhoods, but failed to succeed.\n\nLyman Sector: The invading forces mounted six assaults on Ukrainian defensive lines located near the neighborhoods of Makiivka, Nevske, and Terny, as well as Serebryansky Forest.\n\nAugust 14\n\nKharkiv Sector: Russian invaders launched three assaults targeting Ukrainian entrenchments defending the approaches to Vovchansk town, pounded Kozacha Lopan and Lyptsi neighborhoods with glide bombs.\n\nLyman Sector: The enemy was attacking towards the neighborhoods of Makiivka, Nevske, and Terny, with nine combat encounters reported to have occurred over that day.\n\nSiversk Sector: The adversary continued with attempts to break through Ukrainian defenses, but failed to succeed; mounted 17 assaults aimed to force Ukrainian troops out of their defending positions located near the neighborhoods of Bilohorivka, Verkhnyokamyanske, Spirne, and Vyimka.\n\nToretsk Sector: The adversary intensified the number of attacks to fourteen per that day; using air fire support, was assaulting towards New York community, with three assaults successfully repelled, as well as towards Zalizne, Pivnichne, and Toretsk communities, with nine assaults repelled.\n\nPokrovsk Sector: The invading forces escalated the number of attacks to 37 per that day, assaulting towards the neighborhoods of Vozdvyzhenka, Hrodivka, Zhelanne, Zelene Pole, Vodyane, Skuchne, Karlivka, and Ptyche.\n\nAugust 15\n\nThe adversary increased the intensity of its assaults on the surrounding of Krynky, a key village in the heavily-contested Dnipro bridgehead in the Russian-occupied part of the Kherson region.\n\nKharkiv Sector saw five combat engagements waged near Lyptsi, Starytsia, and Vovchansk communities.\n\nKupyansk Sector: the invaders mounted five assaultive attacks targeting the approaches to Hlushkivka, Andriivka, Kruhlyakivka, Stelmakhivka, and Berestove communities.\n\nLyman Sector: Russian military launched four attacks targeting Ukrainian entrenchments located near the villages of Makiivka and Nevske. All the four had been repelled.\n\nKramatorsk Sector: two combat encounters occurred near Chasiv Yar, both resulted in enemy retreat.\n\nToretsk Sector: The occupying forces escalated the number of attacks to ten per that day; were advancing towards Zalizne, New York, and Toretsk communities; failed eight attacks.\n\nPokrovsk Sector: the invaders mounted 23 assaultive attacks aimed to advance towards the neighborhoods of Panteleimonivka, Vozdvyzhenka, Kalynove, Zelene Pole, Novotoretske, Mykolaivka, Novohrodivka, and Skuchne.\n\nAugust 16\n\nKharkiv Sector saw the ongoing of three combat engagements waged near Vovchansk and Lyptsi neighborhoods; the enemy undertook a force regrouping.\n\nKupyansk Sector: The Russians seven times attacked Ukrainian defending positions; the defense forces effectively repelled the attacks and were able to maintain control over Hlushkivka, Kruhlyakivka, and Andriivka villages.\n\nSiversk Sector: The adversary seven times assaulted Ukrainian entrenchments defending the approaches to the neighborhoods of Verkhnyokamyanske, Spirne, and Pereizne. All the assaults had failed.\n\nPokrovsk Sector: The enemy had staged 23 attacks since the start of the day, targeting Ukrainian defense lines near the villages of Vozdvyzhenka, Vodyane, Novohrodivka, Hrodivka, Zhelanne, Kalynivka, Ptyche; was assaulting towards Zelene Pole.\n\nAugust 17\n\nKharkiv Sector: the occupying forces four times stormed Ukrainian defending positions near Vovchansk and Lyptsi neighborhoods.\n\nToretsk Sector remains to be one of the hottest and the enemy’s most prioritized spots of the front line, with the enemy’s attacks focused on the approaches towards Pivnichne, Toretsk, and Zalizne neighborhoods.\n\nPokrovsk Sector: the occupying forces staged 25 attempted attacks to knock defending Ukrainian units out of their entrenchments located near the neighborhoods of Vozdvyzhenka, Myrolyubivka, Novotroitske, Novohrodivka, Hrodivka, Mykolaivka, Zhelanne, and Zavitne, and were also assaulting towards Zelene Pole village.\n\nAugust 18\n\nKharkiv Sector: the adversary had downgraded the intensity of its offensive on individual stretches of the front line.\n\nIn the morning hours, Russian units mounted a massive assault towards Pivnichne and Zalizne communities in the Donetsk region; supported by a 12-vehicle armored group, they attempted to breach out through Ukrainian defenses and advance towards Toretsk. Ukrainian soldiers were able to keep their defenses and repel the attackers.\n\nKramatorsk Sector: the occupying forces were advancing towards the neighborhoods of Hryhorivka, Kalynivka, Chasiv Yar, Klishchiivka, and Predtechne.\n\nToretsk Sector: Russian troops mounted 15 assaultive attacks towards Zalizne, Toretsk, Dilyivka, and Nelipivka communities.\n\nPokrovsk Sector: the Russian army staged 24 assaultive attacks targeting the approaches to Vozdvyzhenka, Kalynove, Zelene Pole, Myrolyubivka, Hrodivka, Mykolaivka, Ptyche, Novohrodivka, Zavitne and Mykhailivka neighborhoods.\n\nOn August 12, the operational force grouping Tavria reported that the Russian army had been noticed redeploying troops, in particular, from the Pre-Dnieper sector, towards other areas of the fighting, including Kursk.\n\nWAR: LOSSES AND AFTERMATH\n\nENEMY LOSSES\n\nRussia’s war toll in personnel and equipment over the week from August 12 through 18, 2024 had totaled:\n\n8,430 personnel\n\n61 tanks\n\n117 armored combat vehicles\n\n393 artillery gun systems\n\n18 MLRS launchers\n\n5 air defense missile launchers and radars\n\n1 warplane\n\n353 tactical-operational UAVs\n\n6 cruise missiles\n\n468 automobiles and fuel tanks\n\n46 units of special-purpose equipment.\n\nA military training ground located outside of currently Russian-held Mariupol city came under a drone attack that injured a dozen and a half Russian soldiers.\n\nA hacker team affiliated with the Main Intelligence Directorate at the Ministry of Defense (GUR) launched a cyber attack targeting a Russian company involved in the development of nuclear munitions. The attack resulted in a large amount of classified data hacked and the company’s operations disrupted.\n\nOvernight on August 18, the Defense Forces of Ukraine attacked the Kavkaz plant in Russia’s Rostov region, which stored oil and petroleum products and supplied them to the Russian army. The attack, which was carried out using Ukrainian-made suicide drones, resulted in at least two fires at the site.\n\nUKRAINE: LOSSES AND AFTERMATH\n\nRussian drone, missile, and shelling attacks on the Ukrainian regions of Donetsk, Kherson, Zaporizhzhya, Odesa, Mykolaiv, Sumy, Dnipropetrovsk, and Kharkiv regions left 16 people dead and 84 others injured over the week under review.\n\nThe Russian military launched over 40 missiles and 200 strike drones, dropped 750 guided aerial bombs on Ukraine over the week from August 12 through 18.\n\nThe recent fire at the Zaporizhzhia Nuclear Power Plant (NP) in southern Ukraine has been extinguished, with no reported impact on nuclear safety. The incident, which occurred on Sunday, involved a cooling tower and other equipment at the plant. \n\nThe International Atomic Energy Agency (IAEA), which maintains a presence at the Zaporizhzhia NPP, confirmed that the fire had no impact on nuclear safety. IAEA Director General Rafael Mariano Grossi stated that the team witnessed thick dark smoke coming from the northwestern area of the plant after hearing multiple explosions. The team was informed about an alleged drone attack on one of the plant’s cooling towers, which was confirmed to have been extinguished. Grossi emphasized that any military action against the plant violates the five concrete principles for protecting the facility, established by the United Nations Security Council in May 2023. One of the cooling towers at the Zaporizhzhia NPP was damaged in the incident, but the IAEA confirmed that there was no risk of elevated radiation levels as there is no radioactive material in the vicinity of the alleged attack area. Despite the recent fire at the Zaporizhzhia NPP, nuclear safety has not been compromised, according to the IAEA.\n\nRussia detains in captivity 1,917 employees of Ukraine’s Ministry of Internal Affairs.\n\nA total of 1,646 health care establishments in Ukraine sustained damage and 215 others have been destroyed beyond repair by Russian attacks over the time since the all-our war broke out in February 2022. \n\nAugust 13 missile and drone attacks on Ukraine\n\nRussia attacked Ukraine with two Iskander-M/KN-23 ballistic missiles launched from the Voronezh region and 38 Shakhed strike UAVs launched from Primorsko-Akhtarsk and Kursk. Thirty out of the 38 drones had been shot down by Ukrainian air defenses.\n\nThe enemy pounded Chernihiv Oblast; infrastructure facilities sustained damage, but no casualties were reported resulting from the attack.\n\nAugust 14 attack with Shakhed drones\n\nUkrainian Defense Forces downed 17 out of 23 Shakhed drones Russia launched against Ukraine overnight on August 14.\n\nThe Russians hit and damaged a power transmission grid in southern Ukraine.\n\nAn infrastructure facility located in the Zhytomyr region came under a Russian drone attack.\n\nA Russian drone hit an infrastructure facility located in the town of Nizhyn outside of Chernihiv city.\n\nAugust 18 missile and drone attack\n\nUkrainian Defense Forces shot down all of the eight assault drones Shakhed and five out of eight missiles Russia launched against Ukraine in the early morning hours of the day.  The other three missiles failed to reach their targets.\n\nThe falling debris from downed Russian missiles damaged or destroyed 18 private households, power transmission lines, and vehicles in the Kyiv region.\n\nA 35-year old medic, Oleksandra “Mike” Mulkevych, of the Hospitallers volunteer paramedic organization, was killed in a drone attack on August 14. Mulkevych’s vehicle was targeted with an enemy First Person View or FPV-drone near the village of Bilyi Kolodyaz in the Kharkiv region. She and her passenger were killed instantly. Drone debris also hit a passing car, injuring its three occupants.\n\nWAR: POLITICAL DECISIONS, TECHNOLOGICAL BREAKTHROUGHS, ARMAMENTS, ALLIED AID\n\nUkrainian home front\n\nPresident of Ukraine Volodymyr Zelensky:\n\nAugust 12: chaired a meeting at the Supreme Commander-in-Chief Headquarters, during which he spoke with the Armed Forces Chief Commander Oleksandr Syrsky about the progress of Ukraine’s offensive into the Russian region of Kursk.\n\nAugust 15: chaired a meeting at the Supreme Commander-in-Chief Headquarters addressing the exchange of war prisoners among other issues.  The meeting also discussed a strategy for the return of Ukrainians from Russian captivity.\n\nAugust 15: submitted to parliament a bill on the ratification of the Rome Statute of the International Criminal Court (ICC) with amendments. Ukraine signed the statute in January 2000, but has not ratified it, even though ratification is a condition for the country's 2014 Association Agreement with the European Union. The ratification will \"increase the effectiveness of the International Criminal Court's work in relation to Ukraine, will help prosecute the crimes committed by Russian citizens on the territory of Ukraine,\" Iryna Mudra, a deputy head of Zelensky’s administration said.\n\nAugust 13: met with the Minister of National Defense of Lithuania Laurynas Kasčiūnas to discuss issues relating to Ukraine’s arms manufacturing capability development and essential defense needs of Ukraine;\n\nstated that every Ukrainian service man and woman performing combat tasks on the territory of the aggressor state must be provided, in a guaranteed and timely manner, with all the payments and bonuses they are eligible for.\n\nAugust 15: requested the Verkhovna Rada to urgently consider a defense-related legislative package, particularly a bill amending the procedures for payments to military personnel participating in the Kursk operation.\n\nAugust 16: appointed Vladyslav Vlasyuk as Presidential Adviser and Envoy for the enforcement of sanctions policy.\n\nAugust 17: unveiled new Ukrainian-made weapon products that are already used against the enemy.\n\nAugust 17: hosted a meeting with representatives of the nation-wide Ukrainian Council of Churches and Religious Organizations and thanked them for the support they have been giving to legislative initiatives aimed to ban the activities of the Ukrainian Orthodox Church of the Moscow Patriarchate (UOC MP) on the territory of Ukraine.\n\nDuring the Ukrainian Youth Forum \"Free to Dream\":\n\nunveiled three updated government programs on support for the younger generation, which are set to be launched this fall;\n\nthanked the young for countering Russian propaganda and communicating to the world about developments in Ukraine and the suffering Russia’s invasion has brought along.\n\nVisits to Ukraine\n\nU.S. Republican Senator Lindsey Graham and Democratic Senator Richard Blumenthal:\n\nmet with Prime Minister Denys Shmyhal to discuss Ukraine’s needs for air defense capability enhancements;\n\nheld a meeting with President Volodymyr Zelensky where the President expressed his gratitude to the U.S. for the support it is giving to Ukraine to help it resist Russian invasion;\n\nVerkhovna Rada Speaker Ruslan Stefanchuk, at a meeting with the US Senators, urged lifting of all restrictions on Ukraine’s use of US-provided weaponry against military targets in Russia so that to enable Ukraine to effectively defend itself.\n\nSenators Richard Blumenthal (D-CT) and Lindsey Graham (R-SC) are advocating for the removal of all restrictions on Ukraine's use of US-supplied weaponry for strikes on military targets inside Russia.\n\n***\n\nSabine Lackner, head of the German Technical Assistance Agency, visited Kyiv on August 14 to discuss humanitarian aid for the the cold season. THW has already provided €120 million worth of assistance to Ukraine and plans to continue its support.\n\nThe Ministry of Defense of Ukraine has announced the development of new flight procedures for tactical aircraft, including Western-made brands. The procedures are based on NATO standards and have been drawn up in a collaboration with the State Aviation Administration of Ukraine. The new guidelines aim to enhance the safe operation of domestic and Western tactical aircraft. A dedicated working group within the Air Force of the Armed Forces of Ukraine is already implementing these procedures, and plans are underway to develop additional sets for other types of aircraft, including unmanned aerial vehicles. The move is part of Ukraine’s effort to strengthen the capabilities of its Armed Forces and achieve the edge on the battlefield.\n\nHeorhiy Tykhy, the spokesman for the Ministry of Foreign Affairs of Ukraine, denied Russian allegations that Ukraine was purportedly planning to use \"dirty bombs\" or mount an attack on the Zaporizhzhia nuclear power plant.\n\nThe Ministry of Health of Ukraine has endorsed updated recommendations for coronavirus vaccination. For most people, one vaccination is enough, and revaccination is recommended after 6-12 months, not for everyone, but for people at risk.\n\nUkraine has received €4.2 billion worth of macro-financial aid from the European Union under the €50 billion Ukraine Facility for 2024-20274. The funds will be used for priority social and humanitarian expenditures of the State Budget.\n\nThe Ministry of Defense of Ukraine is working on the integration of ground and air robotic and unmanned systems into a centralized command and control infrastructure for all drones on the battlefield.\n\nCabinet of Ministers:\n\nendorsed three options for ground shelters for schools, which will allow around a thousand schools to start offline education as early as this year;\n\naccepted a proposal from the Energy Ministry to hold a competition for contracts to build new power generating capacities;\n\nendorsed the National Renewable Energy Action Plan to boost the proportion of \"green\" energy in gross final consumption of renewable energy sources to 27% by 2030;\n\nsigned a document that bans the issuance of online ordered driver’s licenses to male Ukrainians aged 18-60 who are staying abroad and failed to provide Ukrainian military draft authorities with updated personal data in due time.\n\nDuring the second quarter of 2024, Ukraine’s State and State-guaranteed debt grew by UAH 243.7 billion (USD 1.1 billion). At the same time, the cost of the State debt servicing has declined by more than 10 percent in 2024 so far.\n\nUkraine exported 64.4 million tons of products through the Black Sea corridor over the time from August 16, 2023 to August 16, 2024, of which 43.5 million tons were accounted for by agricultural produce.\n\nA solar power plant KP Vodokanal built in the western town of Dolyna began selling electricity to Ukraine’s domestic market on July 1.\n\nTernopil Oblast hosted a meeting of the Congress of local and regional authorities under the aegis of the President of Ukraine, focused on preparations for the upcoming school year and the heating season.\n\nVolodymyr Zhovnir, CEO at the National Specialized Children's Hospital Okhmatdyt has been suspended of his duties pending completion of investigative measures being carried out by the National Police of Ukraine, other law enforcement agencies, as well as the investigative team of the Ministry of Health.\n\nOn August 12, the High Anti-Corruption Court chose a pre-trial restriction measure for deputy energy minister Oleksandr Kheilo, a suspect in a briary case, in the form of detention with the possibility of UAH 25mn bail, and ordered the suspect to remain in custody until October 8, 2024.\n\nInvestigators from the National Anti-Corruption Bureau (NABU) discovered that the deputy minister, Oleksandr Kheilo proposed the transfer of equipment from  a state coal mining company in the east of Ukraine to a state coal mine in the west.\n\nThe deputy minister asked for a USD 500,000 bribe in exchange. The official was caught when he was receiving one of the five USD 100,000 instalments.\n\nUkraine’s Cabinet of Ministers later said that Deputy Energy Minister Oleksandr Kheilo had been dismissed from his post.\n\nThe Energy Ministry assisted the Security Service of Ukraine (SBU) and the National Anti-Corruption Bureau (NABU) in the investigation.\n\n\n\nAllies and partners\n\nThe European Union announced the allocation of EUR 2 million to finance a new humanitarian mine action mission in Ukraine, to be carried out by female instructors assisted by mine-detecting dogs.\n\nEstonia has permitted Ukraine to use its supplied weaponry for strikes on military targets inside Russia.\n\nThe weapons provided by Germany to the Ukrainian side, from the moment of their transfer, become the property of Ukraine and can be used as Kyiv deems necessary and appropriate, Germany’s defense ministry said in a statement August 12.\n\n British weapons can be used by Ukrainian forces in operations on Russian territory, Britain's Ministry of Defence said on Thursday, but restrictions on the use of long-range Storm Shadow missiles remain in effect.\n\nSetting out the use of weapons deliveries in some of the most explicit terms to date, a spokesperson for Britain's Ministry of Defence said that Ukraine had a \"clear right of self-defence against Russia's illegal attacks\" and \"that does not preclude operations inside Russia\".\n\nUkraine can use Canadian tanks and armored vehicles in its ongoing special military operation on Russian soil, Ottawa said.\n\nUkraine can defend itself on the territory of the aggressor country, and that would not be a violation of international law, the Minister of Foreign Affairs of the Czech Republic, Jan Lipavsky said in a statement.\n\nThe President of Finland, Alexander Stubb, stated that Ukraine has the right to defend itself and can use the weapons provided by Finland on the territory of the Russian Federation.\n\nUS Defense Minister Lloyd Austin, during a phone conversation with his Ukrainian counterpart Rustem Umyerov, discussed security aid priorities among other issues.\n\nThe Swiss State Secretariat for Economic Affairs (SECO) announced that it had blocked 1.3 billion Swiss francs, equivalent to €1.4 Billion, potentially connected to Suleiman Kerimov, a high-profile member of the Russian Federation Council.\n\nThis development is part of an ongoing investigation being led by the Swiss Federal Prosecutor’s Office, which is probing allegations of money laundering and violations of sanctions against four individuals associated with Kerimov.\n\nVice-presidential candidates JD Vance, Donald Trump's running mate, and Tim Walz, Kamala Harris's running mate have agreed to a debate on 1 October.\n\n\n\nGermany is investigating possible Russian sabotage at two military bases where attempts were apparently made to contaminate drinking water, according to a senior lawmaker in Berlin.\n\nAustria has decided to implement a new law to grant internally displaced Ukrainians unrestricted access to the Austrian job market.\n\n\n\nThe Austrian Federal Council has approved a bill revising the existing regulations on foreign employment.\n\nFollowing the new law, Ukrainians can obtain a “Red-White-Red Plus Card” (RWR+), allowing them to live and work in Austria as self-employed or employed individuals.\n\nThe RWR+ offers several significant rights and benefits for Ukrainian refugees in Austria,\n\nSweden has reported a case of a more severe strain of mpox, claiming it is the first clade I variant to be detected outside of an ongoing outbreak in African countries.\n\nIt was diagnosed in a person who sought care in Stockholm after being infected in an area of Africa where this strain of the virus is spreading, according to the country's public health agency.\n\n PUBLICATIONS AND INTERVIEWS\n\nAugust 12/A veteran’s path: from the front line to military recruitment agency\n\nAugust 12/ Ukrainian strongmen: how sports help bring the wounded back to life\n\nAugust 12/ Decentralization of the energy system is a recipe for salvation in wartime and beyond\n\nAugust 13/ Into the battle even on a prosthesis: how soldiers from the Chimera Battalion are fighting in Kherson sector of the front line\n\nAugust 13/ Turmoil surrounding the National Military Memorial Cemetery construction: is there a Russian hand?\n\nAugust 13/ Maksym Skrypchenko, political scientist: Outcome of US presidential elections is hard to predict, everything can change in just five minutes\n\nAugust 15/ The success of Ukrainian offensive into Russia triggered the outcry over fakes about \"huge losses\" purportedly being suffered by our army in Kursk\n\nAugust 15/ Nelly Yarovenko, volunteer, adviser to the patronage service within the Mykolayiv regional military administration: Veteran's assistant’s job should be taught as a university course\n\nAugust 16/ Kursk Incursion: what the goal is and what caused Russian defenses to fail\n\nAugust 16/ Volodymyr Ohryzko, former Minister of Foreign Affairs of Ukraine (2007-2009): We don't need a peace plan, but a victory plan\n\nAugust 16/ \"I want to get back on my feet.\" Since the beginning of the war, more than a hundred Ukrainian soldiers have underwent rehabilitation treatment at the Dolyna Hospital in the Carparthian region\n\nAugust 16/ Sudzha: a comeback story?\n\nCompiled by Maryna Dmytriv, Kyiv\n\nImage URL: https://static.ukrinform.com/photos/2020_05/thumb_files/630_360_1590651594-565.jpg"
    },
    {
        "title": "Ukraine controls 93 settlements in Kursk region – CinC Syrskyi",
        "link": "https://www.ukrinform.net/rubric-ato/3897103-ukraine-controls-93-settlements-in-kursk-region-cinc-syrskyi.html",
        "date": "2024-08-20T21:18:00",
        "image_url": "https://static.ukrinform.com/photos/2024_07/thumb_files/360_240_1722175943-780.jpg",
        "summary": "The Ukrainian Armed Forces currently control over 1,260 square kilometers of territory and 93 settlements in Russia's Kursk region.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 21:18\n\nArticle Content:\nCommander-in-Chief of the Ukrainian Armed Forces Oleksandr Syrskyi said this at a meeting of the Congress of Local and Regional Authorities under the President of Ukraine, an Ukrinform correspondent reports.\n\n\"A grouping of the Defense Forces is conducting an offensive defense on the Kursk axis in order to create a security zone and stop attacks from Russian territory, as well as to overtake the enemy. Since the offensive began in the Kursk region, the Ukrainian Armed Forces have advanced from 28 to 35 kilometers deep into enemy defenses, captured 1,263 square kilometers of territory and gained control of 93 settlements,\" he said.\n\nSyrskyi stressed that the enemy was conducting a maneuverable defense, trying to prevent the further advance of units of the Ukrainian Defense Forces deep into Russian territory, building up groups of troops and moving forces from other directions.\n\nHe noted that \"further actions of our troops on this axis will depend on the development of the operational situation.\"\n\nUkraine's offensive operation in Russia's Kursk region began on August 6, 2024.\n\nOn August 15, Ukraine announced the creation of a military commandant's office in Ukrainian-controlled territories in the Kursk region, and Major General Eduard Moskaliov was appointed its head.\n\nPresident Volodymyr Zelensky said that Ukraine's operation in the Kursk region contributed to the destruction of the logistics of the Russian army and the depletion of their reserves.\n\nPhoto: Kharkiv Media Hub\n\nImage URL: https://static.ukrinform.com/photos/2024_07/thumb_files/630_360_1722175943-780.jpg"
    },
    {
        "title": "Russia clearly can’t defeat Ukraine on battlefield - Hodges",
        "link": "https://www.ukrinform.net/rubric-ato/3897056-russia-clearly-cant-defeat-ukraine-on-battlefield-hodges.html",
        "date": "2024-08-20T19:40:00",
        "image_url": "https://static.ukrinform.com/photos/2024_08/thumb_files/360_240_1724169896-117.png",
        "summary": "Russia’s invasion forces are unable to “knock Ukraine out” as long as the West keep providing assistance to Kyiv.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 19:40\n\nArticle Content:\nThat’s according to the former U.S. EUCOM commander, Lieutenant General (retired) Ben Hodges, who spoke in a comment to CBC News, as seen by Ukrinform.\n\n\"I think that it's been clear for some time that Russia does not have the ability to knock Ukraine out of the war as long as the West continues to provide even the modest amounts that we are providing now.\"\n\nAccording to the expert, the successful raid of the Armed Forces of Ukraine in Kursk region exposed significant weaknesses in Russia’s defense and industrial complex and their military.\n\n\"We should hopefully be figuring out — I have no doubt that there are plenty of intelligence assets focused on this — what are Russia's real capabilities? What is their ability to sustain operations?\" said Hodges.\n\nIn his opinion, the Russian industry is unable to cover the current needs of the military so Moscow is forced to rely on materiel from China, Iran and North Korea. \"It doesn't feel like a sustainable level,\" Hodges concluded.\n\nAs Ukrinform reported earlier, on August 6, Ukraine launched a surprise offensive into Russia’s Kursk region.\n\nPresident Volodymyr Zelensky of Ukraine said the raid contributed to undermining Russia’s military supply routes and depleting their manpower and equipment reserves.\n\nImage URL: https://static.ukrinform.com/photos/2024_08/thumb_files/630_360_1724169896-117.png"
    },
    {
        "title": "Since war-start, nearly 9,600 Russian missiles, almost 14,000 drones launched at Ukraine - CinC",
        "link": "https://www.ukrinform.net/rubric-ato/3897040-since-warstart-nearly-9600-russian-missiles-almost-14000-drones-launched-at-ukraine-cinc.html",
        "date": "2024-08-20T18:40:00",
        "image_url": "https://static.ukrinform.com/photos/2023_05/thumb_files/360_240_1685215442-290.jpg",
        "summary": "Since the outset of the full-scale invasion, the Russian military has already used more than 9,600 missiles and almost 14,000 attack drones against Ukraine.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 18:40\n\nArticle Content:\nThis was announced at the Congress of local and regional authorities under the President of Ukraine by Commander-in-Chief of Ukraine’s Armed Forces Oleksandr Syrskyi, an Ukrinform correspondent reports.\n\n\"Since the large-scale aggression, the enemy has used more than 9,600 missiles and almost 14,000 attack drones. More than 2,400 missiles and 9,200 UAVs have been intercepted,\" CinC said.\n\nAccording to Syrskyi, on a daily average, the enemy fires off up to 45,000 munition rounds on the positions of Ukraine’s defense forces in the country’s east and south.\n\nAlso, the enemy does not stop launching missile and air strikes against critical infrastructure sites, key industrial facilities, and other civil infrastructure.\n\nIn this context, CinC Syrskyi recalled that during the massive attack overnight August 11, Ukraine intercepted 58 Shahed-131/136 attack drones and 15 missiles.\n\nAs Ukrinform reported earlier, on August 18, Russian drones and artillery targeted the Nikopol, Marhanetsk, and Myriv communities. Industrial enterprises, 11 households, four gas mains, five power lines, and a solar panel were damaged.\n\nImage URL: https://static.ukrinform.com/photos/2023_05/thumb_files/630_360_1685215442-290.jpg"
    },
    {
        "title": "Line of active hostilities on frontline is over 1,000 kilometres - Syryskyi",
        "link": "https://www.ukrinform.net/rubric-ato/3897029-line-of-active-hostilities-on-frontline-is-over-1000-kilometres-syryskyi.html",
        "date": "2024-08-20T17:57:00",
        "image_url": "https://static.ukrinform.com/photos/2024_06/thumb_files/360_240_1719300895-840.jpg",
        "summary": "The length of the active combat line at the front is now 1,040 kilometres.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 17:57\n\nArticle Content:\nThis was stated at the Congress of Local and Regional Authorities under the President of Ukraine by the Commander-in-Chief of the Armed Forces of Ukraine Oleksandr Syrskyi, an Ukrinform correspondent reports.\n\n\n\n\n\n\"The defence forces are actively engaged in combat operations on a frontline stretching almost 1,040 kilometres,\" he said. In addition, the Ukrainian military is closing sections of the state border with Russia, Belarus and Moldova on a 2,393 km stretch.\n\n\n\n\n\nCurrently, the main efforts of the Defence Forces are focused on holding the occupied borders and preventing the enemy from advancing deeper into the territory, inflicting maximum losses on the enemy and restoring the lost position, Syrskyi said.\n\n\n\n\n\nAccording to him, in eastern Ukraine (in Donetsk and northern Kharkiv regions), the enemy, using its superiority in missiles and artillery ammunition, is trying to achieve its goal of reaching the administrative border of Donetsk region and creating a buffer zone in the border region of Kharkiv. In addition, Russian troops are trying to advance on the Lyman, Donetsk and Pokrovsk directions.\n\n\n\n\n\nIn the Pokrovsk sector, the enemy is trying to seize a section of the Kostiantynivka - Pokrovsk road to disrupt the logistics of the Defence Forces as much as possible. In the north, shelling of Sumy and Chernihiv regions continues, and Russians are conducting subversive activities.\n\n\n\n\n\nAccording to Syrskyi, the situation in the south of Ukraine (Zaporizhzhia and Kherson regions) is tense but controlled. The enemy is trying to make a move in the Orikhivsk sector. ‘In general, the Ukrainian Defence Forces did not allow the loss of key frontiers in the south of Ukraine,’ the Commander-in-Chief stressed.\n\n\n\n\n\nEarlier, the Commander-in-Chief of the Armed Forces of Ukraine said that the Armed Forces of Ukraine currently control over 1,260 square kilometres of territory and 93 settlements in the Kursk region (Russia).\n\nImage URL: https://static.ukrinform.com/photos/2024_06/thumb_files/630_360_1719300895-840.jpg"
    },
    {
        "title": "Enemy attacks Kherson suburbs with drones, two civilians wounded",
        "link": "https://www.ukrinform.net/rubric-ato/3897001-enemy-attacks-kherson-suburbs-with-drones-two-civilians-wounded.html",
        "date": "2024-08-20T16:59:00",
        "image_url": "https://static.ukrinform.com/photos/2023_08/thumb_files/360_240_1691501685-736.jpg",
        "summary": "Russian troops attacked a suburb of Kherson with drones, wounding two civilians.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 16:59\n\nArticle Content:\nAccording to Ukrinform, this was reported by the Kherson Regional Military Administration.\n\n\n\n\n\n\"Russian troops attacked the suburbs of Kherson with drones,\" the statement said.\n\n\n\n\n\nAs noted, a 62-year-old man who was on the street in Kindiyka was hit by an enemy UAV. He suffered an explosive injury and a shrapnel wound to his foot.\n\n\n\n\n\nA 36-year-old resident of Sadove was injured in the yard of his own house when explosives were dropped from a drone. He was diagnosed with explosive trauma and shrapnel wounds to his legs.\n\n\n\n\n\nThe RMA informs that both victims were taken to hospital.\n\n\n\n\n\nAs Ukrinform reported earlier, in Kherson region, Russians attacked a 60-year-old resident of Vesele village in the Novokakhovka community with a drone.\n\n\n\n\n\nAlso, a 49-year-old man was injured in the morning of 20 August as a result of shelling in the Korabelny district of Kherson.\n\nImage URL: https://static.ukrinform.com/photos/2023_08/thumb_files/630_360_1691501685-736.jpg"
    },
    {
        "title": "Expert: Belarus' statements about deployment of aviation and air defence near border with Ukraine are PSYOPs",
        "link": "https://www.ukrinform.net/rubric-ato/3896974-expert-expert-belarus-statements-about-deployment-of-aviation-and-air-defence-near-border-with-ukraine-are-psyops.html",
        "date": "2024-08-20T15:42:00",
        "image_url": "https://static.ukrinform.com/photos/2024_08/thumb_files/360_240_1724154945-581.jpg",
        "summary": "The deployment of Belarusian aviation and air defence forces near the border with Ukraine is currently an information and psychological operation (PSYOP), but it cannot be ruled out that Vladimir Putin will ‘push’ the Belarusian dictator to \"take more concrete actions\".\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 15:42\n\nArticle Content:\nThis opinion was expressed in a comment to Ukrinform by Yaroslav Chornohor, Director of the Russian and Belarusian Studies Programme of the Foreign Policy Council \"Ukrainian Prism\", PhD in History.\n\n\n\n\n\n\"So far, as of today, this is just an information and psychological operation on the part of Belarus. Of course, we cannot rule out the possibility that Putin will ‘push’ Lukashenko and he will take some more concrete actions, not just demonstrations. Therefore, we must be prepared for any development of events,\" Chornohor said.\n\n\n\n\n\nAccording to him, logically, it seems that it would not be profitable for Belarus to enter a full-fledged war. \"But it is clear that they have such close ties with Putin that if he puts pressure, Lukashenko will simply have to react somehow,\" Chornohor said.\n\n\n\n\n\nIn this context, he noted that an additional trigger could be a video of a Ukrainian tank flying a Belarusian white-red-white flag in the Kursk region, which was shared on social media. In the expert's opinion, the Belarusian dictator may \"cling to it and say that this is our national security, so we will somehow enter this war\".\n\n\n\n\n\nRegarding anti-war public sentiment in Belarus, Chornohor noted that we do not have reliable sociological data.\n\n\n\n\n\n\"All we know is either some distorted information, or the subjective views of the Belarusian democratic forces and their sociologists, or our imagination. It is believed that Belarusians are allegedly not inclined to war (with Ukraine)... And what people are, if they are not first ‘pumped up’ with propaganda, as, for example, in Russia? We cannot rule out the possibility that Belarus may somehow, again, through propaganda, be pushed to believe that this is not some kind of aggressive activity, but defence,\" suggested the director of the Russian and Belarusian Studies Programme.\n\n\n\n\n\nCommenting on the state of the Belarusian army, Chornohor noted that he could not analyse the military component of the Armed Forces of Belarus.\n\n\n\n\n\n\"But in recent years, we have been monitoring two aspects. The first is that it is really a fragment of the Soviet army. And the second is that they have not isolated themselves and are constantly conducting joint exercises with Russia. So I would not say that these are absolutely worthless fighting forces. It is clear that they are incomparable to the Ukrainian army. But they are not ‘cardboard soldiers’ either,\" the expert concluded.\n\n\n\n\n\nEarlier, AP reported that Belarus had deployed aviation and air defence troops on the border with Ukraine. The commander of the Belarusian Air Defence Forces, Major General Andrei Lukianovich, said on national television that anti-aircraft missiles and soldiers of the radio engineering corps had been deployed, calling it a \"significant reinforcement of troops\".\n\n\n\n\n\nAs reported, on 18 August, Alexander Lukashenko announced that he had sent almost a third of the Belarusian army to the border with Ukraine because of the alleged presence of more than 120,000 Ukrainian troops.\n\n\n\n\n\nIn this regard, the spokesperson for the State Border Guard Service, Andriy Demchenko, told Ukrinform that the situation on the border between Ukraine and Belarus remained unchanged.\n\n\n\n\n\nImage URL: https://static.ukrinform.com/photos/2024_08/thumb_files/630_360_1724154945-581.jpg"
    },
    {
        "title": "Russian attack on Ternopil region: Chlorine levels in the air 4-10 times higher than normal",
        "link": "https://www.ukrinform.net/rubric-ato/3896956-russian-attack-on-ternopil-region-chlorine-levels-in-the-air-410-times-higher-than-normal.html",
        "date": "2024-08-20T15:00:00",
        "image_url": "https://static.ukrinform.com/photos/2024_08/thumb_files/360_240_1724150840-666.jpg",
        "summary": "An excess of chlorine levels in the air was recorded in Ukraine's western Ternopil region due to a fire at an industrial facility following a Russian attack.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 15:00\n\nArticle Content:\nOksana Chaichuk, general director of Ternopil Regional Center for Disease Control and Prevention of the Ministry of Health of Ukraine, said this at a briefing on Tuesday, according to an Ukrinform correspondent.\n\n\"With the norm of 0.1 milligrams per cubic meter, there is an excess of chlorine levels from 0.4 to 1.01 milligrams per cubic meter. That is, from four to ten times in atmospheric air. We advise residents of Ternopil to limit the duration of their stay in the fresh air and limit access to atmospheric air in closed premises. If possible, use a recuperator. Cover the windows and doors with wet sheets so that the chlorine in the air does not enter the room. It is also recommended to limit swimming in water bodies and stay close to them,\" Chaichuk noted.\n\nEmployees of preschool institutions were recommended that children stay in the premises of the institutions. Parents were advised to take their children from kindergartens and leave them at home until special recommendations were issued.\n\nThe meetings of commissions on man-made and ecological safety and emergency situations are being urgently convened.\n\nPhoto credit: Ukraine's State Emergency Service\n\nImage URL: https://static.ukrinform.com/photos/2024_08/thumb_files/630_360_1724150840-666.jpg"
    },
    {
        "title": "Russians shell residential areas, educational institution in Kherson community this morning",
        "link": "https://www.ukrinform.net/rubric-ato/3896949-russians-shell-residential-areas-educational-institution-in-kherson-community-this-morning.html",
        "date": "2024-08-20T14:38:00",
        "image_url": "https://static.ukrinform.com/photos/2024_08/thumb_files/360_240_1724148272-421.jpg",
        "summary": "Russian forces shelled residential areas and an education institution in the Zelenivka district, Kherson community, this morning.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 14:38\n\nArticle Content:\nThat is according to the Kherson City Military Administration, which released the relevant photos, Ukrinform reports.\n\n\n\n\"This morning, the enemy struck the Zelenivka district,\" the post reads.\n\n\n\nThere were no reports of casualties, the post added.\n\nPhoto credit: Kherson City Military Administration / Telegram\n\nImage URL: https://static.ukrinform.com/photos/2024_08/thumb_files/630_360_1724148272-421.jpg"
    },
    {
        "title": "Ukrainian fighter jets hit position of Russian forces in Donetsk region with glide bombs",
        "link": "https://www.ukrinform.net/rubric-ato/3896939-ukrainian-fighter-jets-hit-position-of-russian-forces-in-donetsk-region-with-glide-bombs.html",
        "date": "2024-08-20T14:17:00",
        "image_url": "https://static.ukrinform.com/photos/2022_10/thumb_files/360_240_1666798892-927.jpg",
        "summary": "Ukrainian tactical aircraft have struck a position of Russian invaders in the Donetsk sector with guided aerial bombs.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 14:17\n\nArticle Content:\nUkrainian Air Force Commander Lieutenant General Mykola Oleshchuk published a respective video on his Facebook page, Ukrinform reports.\n\n\n\n\n\n\"Tactical aircraft are impressive! A guided aerial bomb strike on a concentration of equipment and personnel of the occupiers in the Donetsk direction. We continue to work!\" Oleshchuk said.\n\nEarlier reports said that a Ukrainian fighter jet had hit a Russian underground command post in the Kursk region with an AASM Hammer guided bomb.\n\n\n\nImage URL: https://static.ukrinform.com/photos/2022_10/thumb_files/630_360_1666798892-927.jpg"
    },
    {
        "title": "Czechia to buy several hundred thousand rounds of ammunition for Ukraine using frozen Russian assets",
        "link": "https://www.ukrinform.net/rubric-ato/3896926-czechia-to-buy-several-hundred-thousand-rounds-of-ammunition-for-ukraine-using-frozen-russian-assets.html",
        "date": "2024-08-20T13:33:00",
        "image_url": "https://static.ukrinform.com/photos/2023_04/thumb_files/360_240_1681212716-475.jpg",
        "summary": "The Czech Republic has acquired another important source of funds, which it will use to finance the supply of much-needed large-caliber ammunition for Ukraine -- profits from the assets of the Russian Central Bank frozen in the EU countries.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 13:33\n\nArticle Content:\nThat is according to the Czech Defense Ministry, Ukrinform reports.\n\n\"Thanks to the use of revenues from frozen Russian finances, released by the European Union, we will be able to supply Ukraine with several hundred thousand pieces of large-caliber ammunition,\" Czech Defense Minister Jana Cernochova said.\n\nAccording to the ministry, EU member states decided in May 2024 that the proceeds from frozen Russian assets will be used precisely for immediate military support for Ukraine. The total amount of these funds is EUR 1.4 billion, and the Czech Defense Ministry will be able to use part of them. This is a unique opportunity to quickly and effectively support Ukraine with funds that originally belonged to Russia.\n\n\"I am glad that the Czech Republic will participate in this new form of military support for Ukraine. This is another demonstration of the confidence of our foreign partners in the effectiveness of the Czech ammunition initiative. It was on the basis of the success of this initiative that the European Union approached us a few weeks ago to use the proceeds from frozen Russian assets to purchase ammunition for Ukraine,\" Cernochova said.\n\nThe procedure will be similar to other cases from the so-called ammunition initiative. According to the requirements of the donor of the money - in this case the European Union - the Czech Defense Ministry will mediate the procurement of ammunition so as to fulfill the urgent military needs specified by the Ukrainian side.\n\nThe deliveries of ammunition financed from the proceeds of the frozen assets of the Russian Central Bank will take place in the coming months. This is therefore an important aid to the defense of Ukraine, which will soon be reflected directly on the battlefield.\n\nIn early 2024, the Czech Republic offered the initiative to search in third countries and supply ammunition to Ukraine using EU money. Almost 20 countries joined the initiative. The first batches of ammunition arrived in Ukraine in June.\n\nIllustration photo \n\nImage URL: https://static.ukrinform.com/photos/2023_04/thumb_files/630_360_1681212716-475.jpg"
    },
    {
        "title": "Government allocates UAH 24B to buy drones for Ukrainian forces - Shmyhal",
        "link": "https://www.ukrinform.net/rubric-ato/3896910-government-allocates-uah-24b-to-buy-drones-for-ukrainian-forces-shmyhal.html",
        "date": "2024-08-20T13:08:00",
        "image_url": "https://static.ukrinform.com/photos/2024_01/thumb_files/360_240_1706207856-197.png",
        "summary": "The Cabinet of Ministers has allocated UAH 24 billion to purchase drones for the Ukrainian Security and Defense Forces.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 13:08\n\nArticle Content:\nPrime Minister Denys Shmyhal said this at a government meeting on Tuesday, Ukrinform reports, citing the Government Portal.\n\n\"The government is carrying out the instructions of the Supreme Commander-in-Chief and approving a draft law, which legally confirms the existence of the Unmanned Systems Forces. We are introducing respective amendments to the law on the Ukrainian Armed Forces. Once voted on in the parliament and signed by the president, the process of legalization of the new type of troops will be completed. Also, today we are allocating UAH 24 billion to purchase drones for the Security and Defense Forces,\" he said.\n\nShmyhal said that Ukraine is betting on innovation, asymmetric responses and approaches in the war with Russia.\n\nHe also recalled that a separate branch of troops – the Unmanned Systems Forces -- had been created in the structure of the Ukrainian Armed Forces at the behest of President Volodymyr Zelensky.\n\n\"Modern warfare is impossible without a powerful army of drones, which operates efficiently and interacts with other branches of troops. Ukraine has made a real breakthrough in the production and use of drones. The state has already contracted one million drones, with 500 Ukrainian companies producing UAVs,\" he added.\n\nPhoto: Government Portal\n\nImage URL: https://static.ukrinform.com/photos/2024_01/thumb_files/630_360_1706207856-197.png"
    },
    {
        "title": "Parliament bans activity of Russian church in Ukraine",
        "link": "https://www.ukrinform.net/rubric-ato/3896899-parliament-bans-activity-of-russian-church-in-ukraine.html",
        "date": "2024-08-20T12:45:00",
        "image_url": "https://static.ukrinform.com/photos/2024_08/thumb_files/360_240_1724145449-426.jpg",
        "summary": "The Verkhovna Rada, Ukraine's parliament, has adopted at second reading the bill \"On the Protection of the Constitutional Order in the Field of Activities of Religious Organizations,\" which bans the activity of religious organizations affiliated with Russia in Ukraine.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 12:45\n\nArticle Content:\nYaroslav Zheleznyiak, an MP from the Holos (Voice) party, announced this on the Telegram messaging app, Ukrinform reports.\n\nHe clarified that 265 lawmakers had voted for Bill No. 8371.\n\nThe bill is aimed at protecting national and public security, human rights and freedoms and determining the specifics of the activities of foreign religious organizations in Ukraine.\n\nThe document states that no provision of the law can be interpreted as limiting the freedom of religion or belief, the right to observe religious practices and ritual rites.\n\nThe bill bans the activity in Ukraine of foreign religious organizations located in a state that is recognized as having carried out or carrying out armed aggression against Ukraine and/or temporarily occupying part of Ukrainian territory, as well as directly or indirectly supporting armed aggression against Ukraine (including through public speeches of managers or other management bodies).\n\n\"Given that the Russian Orthodox Church is an ideological continuation of the regime of the aggressor state, an accomplice in war crimes and crimes against humanity committed on behalf of the Russian Federation and the ideology of the 'Russian world,' the activities of the Russian Orthodox Church in Ukraine are prohibited,\" the bill reads.\n\nThe activity of religious organizations affiliated with a foreign religious organization, the activity of which is prohibited in Ukraine, must be terminated.\n\nRelations, connections and communications of religious organizations, including religious communities and other legal entities, with foreign religious organizations, the activities of which are prohibited in Ukraine, are not allowed.\n\nAccording to the bill, a religious organization operating in Ukraine cannot have a management center in Russia.\n\nA commission will also be created, which should be independent of the executive power and which will conduct research into the existence of connections and affiliation with Moscow or research into the spread of the ideology of the \"Russian world.\"\n\nThe conclusions of a religious examination, information from other central executive authorities, data from public electronic registers, as well as information received from individuals and/or legal entities, from the media and other open sources could be used during the review.\n\nIn the future, the results of the examination will be studied by the State Service for Ethnic Policy and Freedom of Conscience that will issue an order in case of any violations.\n\nA religious organization is given two months, taking into account the administrative appeal procedure, to comply with the requirements of the order and severe ties with Russia.\n\nIf the organization's ties with the aggressor state have not been severed within 60 days, the State Service for Ethnic Policy and Freedom of Conscience will apply to the court.\n\nThe Ukrainian government in January 2023 registered in the Verkhovna Rada Bill No. 8371 on the activity of religious organizations in Ukraine, according to which the activities of the Ukrainian Orthodox Church of the Moscow Patriarchate could be terminated.\n\nThe Verkhovna Rada adopted the bill at first reading on October 19, 2023.\n\nMPs on July 23 blocked the rostrum of the Verkhovna Rada due to the parliament's refusal to consider the bill banning the Moscow-linked church.\n\nThe All-Ukrainian Council of Churches and Religious Organizations announced on August 17 that it supported the legislative initiative to ban the activities of religious organizations affiliated with the Russian Orthodox Church in Ukraine.\n\nImage URL: https://static.ukrinform.com/photos/2024_08/thumb_files/630_360_1724145449-426.jpg"
    },
    {
        "title": "AASM Hammer bomb destroys Russia’s control bunker in Kursk axis",
        "link": "https://www.ukrinform.net/rubric-ato/3896838-aasm-hammer-bomb-destroys-russias-control-bunker-in-kursk-axis.html",
        "date": "2024-08-20T11:43:00",
        "image_url": "https://static.ukrinform.com/photos/2023_08/thumb_files/360_240_1691501474-286.jpg",
        "summary": "A Ukrainian fighter jet hit a Russian underground control point in the Kursk direction using an AASM Hammer guided air bomb.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 11:43\n\nArticle Content:\n\n\nThat’s according to Air Force Commander Lieutenant General Mykola Oleshchuk, who reported the news on Telegram, posting the video of the strike.\n\nAccording to the commander, \"the Air Force’s aircraft strike enemy targets in the Kursk direction every day.\"\n\nAs seen in the video, Oleshchuk noted, \"a Ukrainian fighter jet de-Nazifies an underground enemy control point with an AASM Hammer guided air bomb.\"\n\n\n\n\n\nThe Highly Agile Modular Munition Extended Range), commonly called AASM Hammer, is a French, all-weather, smart air-to-surface stand-off weapon meant for both close air support and deep strike missions.\n\nAs Ukrinform reported earlier, on August 18, the Air Force commander posted a video of another bridge in Russia’s Kursk region being destroyed in the Ukrainian airstrike.\n\nImage URL: https://static.ukrinform.com/photos/2023_08/thumb_files/630_360_1691501474-286.jpg"
    },
    {
        "title": "Fire contained at industrial facility in Ternopil region following Russian strike",
        "link": "https://www.ukrinform.net/rubric-ato/3896826-fire-contained-at-industrial-facility-in-ternopil-region-following-russian-strike.html",
        "date": "2024-08-20T11:22:00",
        "image_url": "https://static.ukrinform.com/photos/2024_08/thumb_files/360_240_1724137121-308.jpg",
        "summary": "During the air raid alert overnight Tuesday, August 20, the Russians hit an industrial facility in Ternopil region in the western part of Ukraine.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 11:22\n\nArticle Content:\nThis was reported by local officials, Ukrinform heard.\n\n\"At around 3:00 at night, we received a report of a fire at one of the enterprises in the city of Ternopil. Upon arrival at the scene, it was established that the fire started after an oil tank was hit. To put out the fire, nearly 90 firefighters and 20 firetrucks were involved. Two firefighting trains from Ternopil and Lviv scrambled to the scene,\" said local emergency service chief Viktor Masley.\n\nAt 6:50, the blaze was contained. The fire is currently being put out, the State Emergency Service reported.\n\nAs Ukrinform reported earlier, a fire broke out in Ternopil region overnight Tuesday during an air raid alert.\n\nPhoto: State Emergency Service\n\nImage URL: https://static.ukrinform.com/photos/2024_08/thumb_files/630_360_1724137121-308.jpg"
    },
    {
        "title": "Russian missiles hit energy infrastructure in Sumy region",
        "link": "https://www.ukrinform.net/rubric-ato/3896815-russian-missiles-hit-energy-infrastructure-in-sumy-region.html",
        "date": "2024-08-20T10:40:00",
        "image_url": "https://static.ukrinform.com/photos/2024_08/thumb_files/360_240_1724139057-551.jpg",
        "summary": "Overnight Tuesday, Russian troops launched a missile strike targeting energy facilities in Sumy region, leaving nearly 20,000 residents in blackout.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 10:40\n\nArticle Content:\nThis was reported by the regional military administration, Ukrinform saw on social media.\n\n\"Overnight August 20, the enemy launched a missile attack on the energy facilities of the Hlukhiv community. As a result of the enemy attack, 72 settlements and more than 18,500 consumers were left without electricity,\" the statement reads.\n\nEmergency recovery works are currently underway.\n\nElectricity supply has already been restored to some of the critical infrastructure facilities and the residential sector.\n\nAs Ukrinform reported earlier, since midnight, the Russians 44 times shelled areas near the state border in Sumy region.\n\nImage URL: https://static.ukrinform.com/photos/2024_08/thumb_files/630_360_1724139057-551.jpg"
    },
    {
        "title": "Ukraine downs 28 incoming air targets overnight Tue",
        "link": "https://www.ukrinform.net/rubric-ato/3896820-ukraine-downs-28-incoming-air-targets-overnight-tue.html",
        "date": "2024-08-20T10:16:00",
        "image_url": "https://static.ukrinform.com/photos/2024_03/thumb_files/360_240_1711100483-822.jpg",
        "summary": "Ukraine’s air defense forces intercepted a Russian Iskander-K cruise missile, two Kh-59 guided air missiles, and 25 Shahed-131/136 one-way attack drones.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 10:16\n\nArticle Content:\nThat’s according to the Air Force Commander, Mykola Oleshchuk, Ukrinform reports.\n\nThe Russians attacked Ukraine using two Iskander-M/KN-23 ballistic missiles launched from Voronezh region, an Iskander-K cruise missile (from Bryansk region), and Kh-59 guided air missiles (from the airspace over the Kursk and Zaporizhzhia regions), as well as 26 attack UAVs of the Shahed type (launch areas – Primorsk-Akhtarsk, Yeisk, and Kursk), the commander reported via Telegram.\n\nAs a result of joint efforts by Ukraine’s aviation, anti-aircraft missile units, mobile fire groups, and e-warfare capabilities, 28 air targets have been taken down, including an Iskander-K missile, two Kh-59 missiles, and 25 Shahed-131/136 drones over Kyiv, Dnipropetrovsk, Mykolaiv, Kherson, Vinnytsia, Khmelnytskyi, Kirovohrad, Sumy, and Chernihiv regions.\n\nAs Ukrinform reported earlier, referring to the Kyiv officials, on Tuesday morning the Russians attacked the capital from the northern direction, likely involving cruise missiles of the Iskander-K type. Air defense forces destroyed the missiles on their approach to the city.\n\nImage URL: https://static.ukrinform.com/photos/2024_03/thumb_files/630_360_1711100483-822.jpg"
    },
    {
        "title": "War update: 158 combat clashes in past day",
        "link": "https://www.ukrinform.net/rubric-ato/3896808-war-update-158-combat-clashes-in-past-day.html",
        "date": "2024-08-20T10:04:00",
        "image_url": "https://static.ukrinform.com/photos/2024_08/thumb_files/360_240_1724135101-426.jpg",
        "summary": "During the past 24 hours, Ukraine’s military reported 158 combat engagements with the Russian invasion force along the frontline.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 10:04\n\nArticle Content:\nThat’s according to the spokesman for the General Staff of Ukraine’s Armed Forces, Andriy Kovaliov, who spoke on the air of the national telethon, Ukrinform reports.\n\n\"Over the past 24 hours, 158 combat clashes took place. More than a third of them were recorded in the Pokrovsk axis,\" said the spokesman.\n\nKharkiv axis: Russia made five assault attempts near Lyptsi and Vovchansk.\n\nKupiansk axis: Ukraine’s Defense Forces repelled 14 assaults in the areas of Hlushkivka, Stelmakhivka, Kruhliakivka, Synkivka, Andriivka, and toward Lozova.\n\nLyman axis: Ukrainian troops held back 11 attacks in the districts of Hrakivka, Novosadove, Makiivka, Nevske, Novoserhiivka, Novoiehorivka, and Torske.\n\nSiversk axis: Defense Forces repelled 10 attacks near Ivanodaryivka, Spirne, and Verkhniokamianske.\n\nKramatorsk axis: Ukrainian soldiers stopped seven attempts by the enemy to break through their defenses in the Ivanivske and Andriivka areas in Donetsk region.\n\nToretsk axis: the enemy unsuccessfully tried 24 times to advance in the areas of Pivnichne, New York, Nelypivka, Zalizne and, most actively, near Toretsk, where the Russians also launched five glide bombs.\n\nPokrovsk axis: Ukraine’s defenders repelled 63 attacks, most of them near Novohrodivka, Mykhailivka, and Vozdvyzhenka.\n\nKurakhove axis: Defense Forces continue to hold back the enemy in the areas of Nevelske and Kostiantynivka, where the invaders tried 11 times to penetrate Ukrainian defense lines.\n\nVremivka axis: the enemy made five attempts to capture Ukrainian positions near Vodiane and Vuhledar in Donetsk region, having also attacked from the side of Volodymyrivka and Solodke.\n\nOrikhiv and Huliaipole axes: the invaders took no offensive action.\n\nPrydniprovska axis: Ukraine’s forces repelled a Russian assault on their positions.\n\nVolyn and Polissia axes: the operational situation has not changed significantly. Ukraine’s forces observed no signs of enemy offensive groupings being formed.\n\nAcross the border in Chernihiv region, the enemy maintains their military presence, pursuing reconnaissance.\n\nUkraine’s forces are working to exhaust Russia’s combat potential, including during a raid in Kursk region.\n\nAs reported earlier, Russia’s war casualties over the past day have amounted to 1,330 killed or wounded.\n\nImage URL: https://static.ukrinform.com/photos/2024_08/thumb_files/630_360_1724135101-426.jpg"
    },
    {
        "title": "Paratroopers post video showing Marder IFV in action in Kursk region",
        "link": "https://www.ukrinform.net/rubric-ato/3896802-paratroopers-post-video-showing-marder-ifv-in-action-in-kursk-region.html",
        "date": "2024-08-20T09:41:00",
        "image_url": "https://static.ukrinform.com/photos/2023_08/thumb_files/360_240_1691501474-309.jpg",
        "summary": "Fighters from the 95th Separate Airborne Assault Brigade destroyed Russia’s combat positions in Kursk region’s Sudzha district, making full use of their Marder infantry fighting vehicle’s firepower.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 09:41\n\nArticle Content:\nThat’s according to the press service of the Airborne Assault Forces command, Ukrinform reports.\n\nThe command uploaded on its social media raw footage showing the Marder IFV engaging the enemy positions in the village of Malaya Loknya, Kursk region.\n\n\"Quite well-equipped firing points and combat positions of the Russians came under a powerful blow of the Plossia paratroopers. The enemy suffered significant losses in manpower, equipment and other materiel,\" the report reads.\n\n\n\n\n\nIn terms of firepower, German-made Marder 1A3, supplied to Ukraine, is equipped with a 20mm automatic cannon, which represents a significant upgrade over the 73mm gun on the BMP-1 and is comparable to the 30mm cannon on the BMP-2 as per ArmyRecognition. Additionally, the Marder's capacity to carry anti-tank guided missiles offers greater firepower against enemy armored vehicles.\n\nAs Ukrinform reported earlier, fighters from the 80th Galicia Separate Airborne Assault Brigade captured Russia’s newest T-90M Proryv (Breakthrough) main battle tank tank during a raid in Kursk region.\n\nImage URL: https://static.ukrinform.com/photos/2023_08/thumb_files/630_360_1691501474-309.jpg"
    },
    {
        "title": "Russian army loses 1,330 troops in Ukraine over past day",
        "link": "https://www.ukrinform.net/rubric-ato/3896787-russian-army-loses-1330-troops-in-ukraine-over-past-day.html",
        "date": "2024-08-20T08:57:00",
        "image_url": "https://static.ukrinform.com/photos/2024_08/thumb_files/360_240_1724132456-902.jpg",
        "summary": "The total combat losses of Russian troops in Ukraine from 24 February 2022 to 20 August 2024 amounted to about 601,800 people, including 1,330 people in the last 24 hours.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 08:57\n\nArticle Content:\nThe General Staff of the Armed Forces of Ukraine reported this on Facebook, Ukrinform reports.\n\n\n\n\n\nThe Ukrainian Defence Forces also destroyed 8,518 (+5) Russian tanks, 1,564 (+26) armoured combat vehicles, 1,756 (+52) artillery systems, 1,166 (+1) MLRS, 926 (+1) air defence systems, 367 (+0) aircraft, and 328 (+0) helicopters, Operational and tactical UAVs - 13,864 (+55), cruise missiles - 2,438 (+1), ships/boats - 28 (+0), submarines - 1 (+0), vehicles and tankers - 23,142 (+95), special equipment - 2,885 (+22).\n\n\n\n\n\nThe data are being updated.\n\n\n\n\n\nAs reported by Ukrinform, on 19 August, 154 clashes between the Ukrainian Defence Forces and Russian invaders took place at the front, most of them in the Pokrovsk sector.\n\nImage URL: https://static.ukrinform.com/photos/2024_08/thumb_files/630_360_1724132456-902.jpg"
    },
    {
        "title": "There are no Russian warships in Black and Azov Seas",
        "link": "https://www.ukrinform.net/rubric-ato/3896785-there-are-no-russian-warships-in-black-and-azov-seas.html",
        "date": "2024-08-20T08:32:00",
        "image_url": "https://static.ukrinform.com/photos/2018_11/thumb_files/360_240_1542109762-268.jpg",
        "summary": "There are no Russian warships in the Black and Azov Seas as of 06:00 on 20 August.\n",
        "full_content": "Title: No Title\nPublished on: 20.08.2024 08:32\n\nArticle Content:\nAccording to Ukrinform, this was reported on Facebook by the Naval Forces of the Armed Forces of Ukraine.\n\n\n\n\n\nRussia has two ships in the Mediterranean Sea, but no Kalibr cruise missile carriers.\n\n\n\n\n\nAs reported by Ukrinform, Ukrainian Navy spokesman Dmytro Pletenchuk said that Russia does not have the same capabilities to mine the Black Sea as before.\n\nImage URL: https://static.ukrinform.com/photos/2018_11/thumb_files/630_360_1542109762-268.jpg"
    }
]